Repository: px22222/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: tr_tr

source: Restart the NTP service:
tr_tr: NTP servisini yeniden başlatın:

source: Restart the Networking services.
tr_tr: Ağ servislerini yeniden başlatın.

source: Restart the database service:
tr_tr: Veritabanı servisini yeniden başlatın:

source: Restart the httpd service:
tr_tr: httpd servisini yeniden başlat:

source: Restart the other Compute services:
tr_tr: Diğer Hesaplama servislerini yeniden başlat:

source: Restart the web server and session storage service:
tr_tr: Web sunucu ve oturum depolama servisini yeniden başlatın:

source: Return to :ref:`Launch an instance - Create virtual networks <launch-instance-networks>`.
tr_tr: :ref:`Bir sunucu başlat - Sanal ağlar oluştur <launch-instance-networks>`a geri dön.

source: Return to :ref:`Launch an instance <launch-instance-complete>`.
tr_tr: :ref:`Sunucu başlatmaya <launch-instance-complete>` dön.

source: Return to :ref:`launch-instance`.
tr_tr: :ref:`sunucu-başlat`a dön.

source: Root password for the database
tr_tr: Veritabanı için root parolası

source: Run the following command to install the packages:
tr_tr: Paketleri kurmak için şu komutu çalıştırın:

source: Run the following commands on the **controller** node.
tr_tr: **Kontrol** düğümünde şu komutları çalıştırın.

source: Run the same command on *all other* nodes:
tr_tr: Aynı komutu *diğer tüm* düğümlerde çalıştırın:

source: Run this command on the *controller* node:
tr_tr: *Kontrol* düğümünde şu komutu çalıştırın:

source: SLES enables apparmor by default and restricts dnsmasq. You need to either completely disable apparmor or disable only the dnsmasq profile:
tr_tr: SLES öntanımlı olarak apparmor'u etkinleştirir ve dnsmasq'ı kısıtlar. Ya apparmor'u tamamen ya da yalnızca dnsmasq profilini kapatmalısınız:

source: SQL database
tr_tr: SQL veritabanı

source: Secret for the metadata proxy
tr_tr: Metaveri vekili için giz

source: Secure the database service by running the ``mysql_secure_installation`` script. In particular, choose a suitable password for the database ``root`` account:
tr_tr: ``mysql_secure_installation`` betiğini çalıştırarak veritabanı servisini güven altına alın. Özellikle veritabanı ``root`` hesabı için uygun bir parola seçin:

source: Security
tr_tr: Güvenlik

source: Select novnc startup in ``/etc/default/nova-consoleproxy``:
tr_tr: ``/etc/default/nova-consoleproxy`` içinde novnc başlangıcını seç:

source: Self-service network
tr_tr: Kendine servis ağı

source: Self-service networks connect to provider networks using a virtual router that typically performs bidirectional NAT. Each router contains an interface on at least one self-service network and a gateway on a provider network.
tr_tr: Kendine servis ağları sağlayıcı ağlara genellikle bir snal yönlendirici üzerinden çift yönlü NAT ile bağlanırlar. Her yönlendirici en az bir kendine servis ağında ve bir sağlayıcı ağında ağ geçidinde arayüz içerir.

source: Self-service networks typically use overlay networks. Overlay network protocols such as VXLAN include additional headers that increase overhead and decrease space available for the payload or user data. Without knowledge of the virtual network infrastructure, instances attempt to send packets using the default Ethernet :term:`maximum transmission unit (MTU)` of 1500 bytes. The Networking service automatically provides the correct MTU value to instances via DHCP. However, some cloud images do not use DHCP or ignore the DHCP MTU option and require configuration using metadata or a script.
tr_tr: Kendine servis ağlar genellikle overlay ağları kullanır. Overlay ağ iletişim kuralları örneğin VXLAN ek başlıklar içerir ve kullanıcı verisi ve faydalı yük için kullanılabilecek alanı azaltarak yükü artırır. Sanal ağ alt yapısı hakkında bilgi sahibi olmadan, sunucular paketleri öntanımlı 1500 Ethernet :term:`azami aktarım birimi (MTU)` ile gönderirler. Ağ servisi DHCP ile doğru MTU değerini sunuculara sağlar. Ancak, bazı bulut imajları DHCP kullanmaz veya DHCP MTU seçeneğini göz ardı eder ve metaveri veya betik kullanılarak yapılandırma gerektirirler.

source: Set a gateway on the provider network on the router:
tr_tr: Yönlendirici üzerindeki sağlayıcı ağda bir ağ geçidi ayarlayın:

source: Set the hostname of the node to ``block1``.
tr_tr: Düğüm makine adını ``block1`` olarak ayarlayın.

source: Set the hostname of the node to ``compute1``.
tr_tr: Düğüm makine adını ``compute1`` olarak ayarlayın.

source: Set the hostname of the node to ``controller``.
tr_tr: Düğümün makine adını ``controller`` olarak ayarlayın.

source: Set up session storage. See `Set up session storage for the dashboard <https://docs.openstack.org/admin-guide/dashboard-sessions.html>`__.
tr_tr: Oturum depolamayı ayarla. Bknz `Kontrol paneli için oturum depolama ayarları <https://docs.openstack.org/admin-guide/dashboard-sessions.html>`__.

source: Shared File Systems
tr_tr: Paylaşımlı Dosya Sistemleri

source: Shared File Systems service (manila)
tr_tr: Paylaşımlı Dosya Sistemleri servisi (manila)

source: Shutdown ``nova-spicehtml5proxy``:
tr_tr: ``nova-spicehtml5proxy``i kapat:

source: Similarly, if your compute nodes use LVM on the operating system disk, you must also modify the filter in the ``/etc/lvm/lvm.conf`` file on those nodes to include only the operating system disk. For example, if the ``/dev/sda`` device contains the operating system:
tr_tr: Benzer şekilde, hesaplama düğümünüz işletim sistemi diskinde LVM kullanıyorsa, bu düğümlerde ``/etc/lvm/lvm.conf`` dosyasındaki süzgeçleri de yalnızca işletim sistemi diskini içerecek şekilde değiştirmelisiniz. Örneğin, ``/dev/sda`` aygıtı işletim sistemini içeriyorsa:

source: Some distributions add an extraneous entry in the ``/etc/hosts`` file that resolves the actual hostname to another loopback IP address such as ``127.0.1.1``. You must comment out or remove this entry to prevent name resolution problems. **Do not remove the 127.0.0.1 entry.**
tr_tr: Bazı dağıtımlar ``/etc/hosts`` dosyasına makine adını ``127.0.1.1`` gibi başka bir geri döngü IP adresine çözen ek girdiler eklerler. İsim çözme problemlerini engellemek için bu girdiyi yorum satırına almalı ya da silmelisiniz. **127.0.0.1 girdisini silmeyin.**

source: Some distributions include LVM by default.
tr_tr: Bazı dağıtımlar öntanımlı olarak LVM'i içerirler.

source: Source the ``admin`` credentials to gain access to admin-only CLI commands:
tr_tr: ``admin`` kimlik bilgilerini kaynak alarak yalnız-yönetici CLI komutlarına erişim sağlayın:

source: Source the ``demo`` credentials to gain access to user-only CLI commands:
tr_tr: Salk-kullanıcı CLI komutlarına erişim elde etmek için ``demo`` kimlik bilgilerini kaynak edin:

source: Source the ``demo`` credentials to perform the following steps as a non-administrative project:
tr_tr: Aşağıdaki adımları yönetici olmayan proje olarak yapmak için ``demo`` kimlik bilgilerini kaynak edin:

source: Source the ``demo`` project credentials:
tr_tr: ``demo`` projesi kimlik bilgilerini kaynak edin:

source: Source the admin credentials to enable admin-only CLI commands, then confirm there are compute hosts in the database:
tr_tr: Yalnızca-yönetici CLI komutlarını etkinleştirmek için yönetici kimlik bilgilerini kaynak edin, ardından veritabanında hesaplama sunucuları olduğunu onaylayın:

source: Start the Apache HTTP service and configure it to start when the system boots:
tr_tr: Apache HTTP servisini başlatın ve sistem ön yüklenirken başlayacak şekilde yapılandırın:

source: Start the Block Storage backup service and configure it to start when the system boots:
tr_tr: Blok Depolama yedek servisini başlat ve sistem önyüklenirken başlayacak şekilde yapılandır:

source: Start the Block Storage services and configure them to start when the system boots:
tr_tr: Blok Depolama servislerini başlatın ve sistem ön yüklenirken başlayacak şekilde yapılandırın:

source: Start the Block Storage volume service including its dependencies and configure them to start when the system boots:
tr_tr: Blok Depolama birimi servisini bağımlılıklarıyla beraber başlatın ve sistem ön yüklenirken başlayacak şekilde yapılandırın:

source: Start the Compute service including its dependencies and configure them to start automatically when the system boots:
tr_tr: Hesaplama servisini bağımlılıklarıyla beraber başlatın ve sistem ön yüklenirken otomatik başlayacak şekilde yapılandırın:

source: Start the Compute services and configure them to start when the system boots:
tr_tr: Hesaplama servislerini başlat ve sistem ön yüklenirken başlayacak şekilde yapılandır:

source: Start the Image services and configure them to start when the system boots:
tr_tr: İmaj servislerini başlatın ve sistem ön yüklenirken başlayacak şekilde yapılandırın:

source: Start the LVM metadata service and configure it to start when the system boots:
tr_tr: LVM metaveri servisini başlatın ve sistem ön yüklenirken başlayacak şekilde yapılandırın:

source: Start the Linux Bridge agent and configure it to start when the system boots:
tr_tr: Linux Köprüleme aracını başlatın ve sistem ön yüklenirken başlayacak şekilde yapılandırın:

source: Start the Linux bridge agent and configure it to start when the system boots:
tr_tr: Linux köprüleme aracını başlatın ve sistem ön yüklenince başlayacak şekilde yapılandırın:

source: Start the Memcached service and configure it to start when the system boots:
tr_tr: Memcached servisini başlatın ve sistem ön yüklenince başlayacak şekilde yapılandırın:

source: Start the NTP service and configure it to start when the system boots:
tr_tr: NTP servisini başlatın ve sistem ön yüklenirken başlayacak şekilde yapılandırın:

source: Start the Networking services and configure them to start when the system boots.
tr_tr: Ağ servislerini başlat ve sistem ön yüklenirken başlayacak şekilde yapılandır.

source: Start the database service and configure it to start when the system boots:
tr_tr: Veritabanı servisini başlatın ve sistem ön yüklendiğinde başlayacak şekilde yapılandırın:

source: Start the message queue service and configure it to start when the system boots:
tr_tr: Mesaj kuyruğu servisini başlatın ve sistem ön yüklenirken başlayacak şekilde yapılandırın:

source: Start the noVNC proxy:
tr_tr: noVNC vekilini başlat:

source: Starting with the Newton release, SUSE OpenStack packages are shipping with the upstream default configuration files. For example ``/etc/glance/glance-api.conf`` or ``/etc/glance/glance-registry.conf``, with customizations in ``/etc/glance/glance-api.conf.d/`` or ``/etc/glance/glance-registry.conf.d/``. While the following instructions modify the default configuration files, adding new files in ``/etc/glance/glance-api.conf.d`` or ``/etc/glance/glance-registry.conf.d`` achieves the same result.
tr_tr: Newton dağıtımıyla beraber, SUSE OpenStack paketleri öntanımlı yapılandırma dosyalarıyla birlikte gelir. Örneğin ``/etc/glance/glance-api.conf`` veya ``/etc/glance/glance-registry.conf``, `/etc/glance/glance-api.conf.d/`` veya ``/etc/glance/glance-registry.conf.d/`` içinde özelleştirmelerle vs. Bu yönergeler öntanımlı yapılandırma dosyalarını değiştirse de, ``/etc/glance/glance-api.conf.d`` veya ``/etc/glance/glance-registry.conf.d`` ye yeni dosyalar eklemek de aynı sonucu verir.

source: Starting with the Newton release, SUSE OpenStack packages are shipping with the upstream default configuration files. For example ``/etc/keystone/keystone.conf``, with customizations in ``/etc/keystone/keystone.conf.d/010-keystone.conf``. While the following instructions modify the default configuration file, adding a new file in ``/etc/keystone/keystone.conf.d`` achieves the same result.
tr_tr: Newton dağıtımından itibaren, SUSE OpenStack paketleri dağıtımdan gelen yapılandırma dosyalarıyla dağıtılıyor. Örneğin özelleştirmelerin ``/etc/keystone/keystone.conf.d/010-keystone.conf`` dosyasında olduğu ``/etc/keystone/keystone.conf`` dosyası gibi. Aşağıdaki yönergeler öntanımlı yapılandırma dosyalarını değiştiriyor olsa da, ``/etc/keystone/keystone.conf.d`` dizinine yeni bir dosya eklemek de aynı sonucu verir.

source: Telemetry Alarming services (aodh)
tr_tr: Telemetri Alarm servisi (aodh)

source: Telemetry Data Collection service (ceilometer)
tr_tr: Telemetri Veri Toplama servisi (ceilometer)

source: The :command:`systemctl enable` call on openSUSE outputs a warning message when the service uses SysV Init scripts instead of native systemd files. This warning can be ignored.
tr_tr: openSUSE'de :command:`systemctl enable` çağrısı servis systemd dosyaları yerine SysV Init betiklerini kullandığında bir uyarı iletisi çıktılar. Bu uyarı göz ardı edilebilir.

source: The :term:`DHCP agent` provides DHCP services for virtual networks.
tr_tr: :term:`DHCP aracısı` sanal ağlar için DHCP servisleri sağlar.

source: The :term:`Layer-3 (L3) agent` provides routing and NAT services for self-service virtual networks.
tr_tr: :term:`Katman-3 (L3) aracısı` kendine servis sanal ağları için yönlendirme ve NAT servisleri sağlar.

source: The :term:`OpenStack` project is an open source cloud computing platform that supports all types of cloud environments. The project aims for simple implementation, massive scalability, and a rich set of features. Cloud computing experts from around the world contribute to the project.
tr_tr: :term:`OpenStack` projesi her tür bulut ortamını destekleyen açık kaynaklı bulut hesaplama plpatformudur. Proje basit kurulum, güçlü ölçekleme, ve zengin özellik kümesi hedefler. Projeye tüm dünyadan bulut hesaplama uzmanları katkı verir.

source: The :term:`metadata agent <Metadata agent>` provides configuration information such as credentials to instances.
tr_tr: :term:`metaveri aracısı <Metadata agent>` kimlik bilgileri gibi yapılandırma bilgilerini sunuculara sağlar.

source: The Application Catalog service (murano) combines an application catalog with versatile tooling to simplify and accelerate packaging and deployment.
tr_tr: Uygulama Katalog servisi (murano) paketleme ve yerleştirmeyi basitleştirmek ve hızlandırmak için uygulama kataloğunu çok amaçlı araçlarla birleştirir.

source: The Bare Metal service is a collection of components that provides support to manage and provision physical machines.
tr_tr: Saf Metal servisi fiziksel makineleri yönetmeyi ve hazırlamayı destekleyen bileşenlerin koleksiyonudur.

source: The Block Storage API and scheduler services typically run on the controller nodes. Depending upon the drivers used, the volume service can run on controller nodes, compute nodes, or standalone storage nodes.
tr_tr: Blok Depolama API'si ve zamanlayıcı servisler genellikle kontrol düğümünde çalışır. Kullanılan sürücülere bağlı olarak, birim servisi kontrol düğümlerinde, hesaplama düğümlerinde, veya bağımsız depolama düğümlerinde çalışabilir.

source: The Block Storage service (cinder) provides block storage devices to guest instances. The method in which the storage is provisioned and consumed is determined by the Block Storage driver, or drivers in the case of a multi-backend configuration. There are a variety of drivers that are available: NAS/SAN, NFS, iSCSI, Ceph, and more.
tr_tr: Blok Depolama servisi (cinder) misafir sunuculara blok depolama aygıtları sağlar. Depolamanın içinde hazırlanacağı ve tüketileceği yöntem Blok Depolama sürücüsü tarafından, ya da birden çok arka uçlu yapılandırmalarda sürücüler tarafından belirlenir. Kullanılabilir çok çeşitli sürücü bulunur: NAS/SAN, NFS, iSCSI, Ceph, ve fazlası.

source: The Block Storage service creates logical volumes in this volume group.
tr_tr: Blok Depolama servisi bu birim grubunda mantıksal birimler oluşturur.

source: The Block Storage services require endpoints for each service entity.
tr_tr: Blok Depolama servisi her servis elemanı için uç noktalar gerektirir.

source: The Block Storage services require two service entities.
tr_tr: Blok Depolama servisi iki servis varlığı gerektiriyor.

source: The CirrOS image includes conventional user name/password authentication and provides these credentials at the login prompt. After logging into CirrOS, we recommend that you verify network connectivity using ``ping``.
tr_tr: CirrOS imajı geleneksel kullanıcı/parola kimlik doğrulaması içerir ve bu kimlik bilgilerini giriş ekranında sağlar. CirrOS'a giriş yaptıktan sonra, ``ping`` kullanarak ağ bağlantısını doğrulamanızı öneririz.

source: The Container Infrastructure Management service (magnum) is an OpenStack API service making container orchestration engines (COE) such as Docker Swarm, Kubernetes and Mesos available as first class resources in OpenStack.
tr_tr: Kapsayıcı Altyapı Yönetim servisi (magnum) Docker Swarm, Kubernetes ve Mesos gibi kapsayıcı orkestrasyon motorlarını (COE) OpenStack'de birinci sınıf kaynaklar haline getiren OpenStack API servisidir.

source: The DNS service (designate) provides cloud provisioning functionality for DNS Zones and Recordsets.
tr_tr: DNS servisi (designate) DNS Bölgeleri ve Kayıt kümeleri için bulut hazırlığı işlevselliği sağlar.

source: The Dashboard (horizon) is a web interface that enables cloud administrators and users to manage various OpenStack resources and services.
tr_tr: Kontrol paneli (horizon) bulut yöneticileri ve kullanıcılarının çeşitli OpenStack kaynaklarını ve servislerini yönetmesini sağlayan web arayüzüdür.

source: The Database service (trove) provides cloud provisioning functionality for database engines.
tr_tr: Veritabanı servisi (trove) veritabanı motorları için bulut hazırlığı işlevselliğini sağlar.

source: The Debian package will perform the below operations for you:
tr_tr: Debian paketi aşağıdaki işlemleri sizin için yapacak:

source: The Identity service authentication mechanism for services uses Memcached to cache tokens. The memcached service typically runs on the controller node. For production deployments, we recommend enabling a combination of firewalling, authentication, and encryption to secure it.
tr_tr: Servisler için Kimlik servisi kimlik doğrulama mekanizması jetonları önbelleklemek için Memecached kullanır. Memcached servisi genellikle kontrol düğümünde çalışır. Üretim kurulumları için, güvenliğin sağlanması için güvenlik duvarı, yetkilendirme ve şifreleme birleşimini etkinleştirmenizi öneriyoruz.

source: The Identity service provides authentication services for each OpenStack service. The authentication service uses a combination of :term:`domains <domain>`, :term:`projects<project>`, :term:`users<user>`, and :term:`roles<role>`.
tr_tr: Kimlik servisi her bir OpenStack servisi için kimlik doğrulama sağlar. Kimlik doğrulama servisi :term:`alanlar <domain>`, :term:`projeler<project>`, :term:`kullanıcılar<user>`, ve :term:`rollerin<role>` birleşimini kullanır.

source: The Key Manager service provides a RESTful API for the storage and provisioning of secret data such as passphrases, encryption keys, and X.509 certificates.
tr_tr: Anahtar Yönetim servisi parolalar, şifreleme anahtarları, ve X.509 sertifikaları gibi gizli verilerin depolama ve hazırlığı için RESTful API sağlar.

source: The Linux bridge agent builds layer-2 (bridging and switching) virtual networking infrastructure for instances and handles security groups.
tr_tr: Linux köprüleme aracı sunucular için katman-2 (köprüleme ve anahtarlama) sanal ağ alt yapısı inşa eder ve güvenlik gruplarını ele alır.

source: The Linux bridge agent only supports VXLAN overlay networks.
tr_tr: Linux köprüleme aracı yalnızca VXLAN overlay ağlarını destekler.

source: The ML2 plug-in uses the Linux bridge mechanism to build layer-2 (bridging and switching) virtual networking infrastructure for instances.
tr_tr: ML2 eklentisi Linux köprüleme mekanizmasını kullanarak sunucular için katman-2 (köprüleme ve anahtarlama) sanal ağ alt yapısını inşa eder.

source: The Messaging service allows developers to share data between distributed application components performing different tasks, without losing messages or requiring each component to be always available.
tr_tr: Mesajlaşma servisi geliştiricilere değişik görevler yapan dağıtık uygulama bileşenleri arasında veri paylaşımını, ileti kaybı olmadan veya her bileşenin her zaman kullanılabilir olmasını gerektirmeden sunar.

source: The Networking common component configuration includes the authentication mechanism, message queue, and plug-in.
tr_tr: Ağ genel bileşen yapılandırması kimlik doğrulama mekanizmasını, mesaj kuyruğunu, ve eklentileri içerir.

source: The Networking server component configuration includes the database, authentication mechanism, message queue, topology change notifications, and plug-in.
tr_tr: Ağ sunucu bileşeni yapılandırması veritabanı, kimlik doğrulama mekanizması, mesaj kuyruğu, topoloji değişim iletileri, ve eklentileri içerir.

source: The Networking service assumes default values for kernel network parameters and modifies firewall rules. To avoid most issues during your initial installation, we recommend using a stock deployment of a supported distribution on your hosts. However, if you choose to automate deployment of your hosts, review the configuration and policies applied to them before proceeding further.
tr_tr: Ağ servisi çekirdek ağ parametreleri için öntanımlı değerleri var sayar ve güvenlik duvarı kurallarını değiştirir. İlk kurulumunuzda çoğu sorundan uzak durmak için, sunucunuzda desteklenen dağıtımlardan birinin standart kurulumunu yapmanızı öneririz. Ancak, sunucularınızın kurulumunu otomatize etmeyi seçerseniz, daha fazla ilerlemeden onlara uygulanan yapılandırma ve ilkeleri gözden geçirin.

source: The Networking service initialization scripts expect a symbolic link ``/etc/neutron/plugin.ini`` pointing to the ML2 plug-in configuration file, ``/etc/neutron/plugins/ml2/ml2_conf.ini``. If this symbolic link does not exist, create it using the following command:
tr_tr: Ağ servisi ilklendirme betikleri ``/etc/neutron/plugins/ml2/ml2_conf.ini`` ML2 eklenti yapılandırma dosyasını gösteren ``/etc/neutron/plugin.ini`` sembolik bağlantısı olmasını bekler. Bu sembolik bağlantı yoksa, şu komutla oluşturun:

source: The Networking service initialization scripts expect the variable ``NEUTRON_PLUGIN_CONF`` in the ``/etc/sysconfig/neutron`` file to reference the ML2 plug-in configuration file. Ensure that the ``/etc/sysconfig/neutron`` file contains the following:
tr_tr: Ağ servisi ilklendirme betikleri ``/etc/sysconfig/neutron`` dosyasında ``NEUTRON_PLUGIN_CONF`` değişkeninin ML2 eklenti yapılandırma dosyasını göstermesini beklerler. ``/etc/sysconfig/neutron`` dosyasının aşağıdakileri içerdiğinden emin olun:

source: The Newton release is available directly through the official Debian backports repository. To use this repository, follow the instruction from the official `Debian website <https://backports.debian.org/Instructions/>`_, which basically suggest doing the following steps:
tr_tr: Newton yayımı doğrudan resmi Debian backports deposundan kullanılabilir. Bu depoyu kullanmak için resmi `Debian web sitesindeki <https://backports.debian.org/Instructions/>`_ yönergeleri takip edin, temelde şu adımları yapmanızı isteyeceklerdir:

source: The Object Storage services (swift) work together to provide object storage and retrieval through a REST API.
tr_tr: Nesne Depolama servisleri (swift)nesne depolama ve alımını REST API üzerinden sağlamak için beraber çalışırler.

source: The OpenStack client also supports using a ``clouds.yaml`` file. For more information, see the `os-client-config <http://docs.openstack.org/developer/os-client-config/>`_.
tr_tr: OpenStack istemcisi ayrıca ``clouds.yaml`` dosyası kullanımını destekler. Daha fazla bilgi için bknz. `os-client-config <http://docs.openstack.org/developer/os-client-config/>`_.
