Repository: px22222/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: tr_tr

source: (Optional) If you intend to use non-raw image types such as QCOW2 and VMDK, install the QEMU package:
tr_tr: (İsteğe bağlı) QCOW2 ve VMDK gibi ham-olmayan imaj türlerini kullanmak isterseniz, QEMU paketini kurun:

source: **Example**
tr_tr: **Örnek**

source: **Hardware requirements**
tr_tr: **Donanım gereksinimleri**

source: **Networking Option 1: Provider networks - Connectivity**
tr_tr: **Ağ Seçeneği 1: Sağlayıcı ağlar - Bağlantı**

source: **Networking Option 1: Provider networks - Overview**
tr_tr: **Ağ Seçeneği 1: Sağlayıcı ağlar - Genel Görünüm**

source: **Networking Option 2: Self-service networks - Connectivity**
tr_tr: **Ağ Seçeneği 2: Kendine servis ağı - Bağlantı**

source: **Networking Option 2: Self-service networks - Overview**
tr_tr: **Ağ Seçeneği 2: Kendine servis ağı - Genel Görünüm**

source: **On SLES:**
tr_tr: **SLES'de:**

source: **On openSUSE:**
tr_tr: **openSUSE'de:**

source: **Passwords**
tr_tr: **Parolalar**

source: A flavor specifies a virtual resource allocation profile which includes processor, memory, and storage.
tr_tr: Nitelik işlemci, hafıza, ve depolamayı içeren sanal bir kaynak ayırma profili belirtir.

source: A single disk partition on each node works for most basic installations. However, you should consider :term:`Logical Volume Manager (LVM)` for installations with optional services such as Block Storage.
tr_tr: Her düğümde tek bir disk bölümü çoğu temel kurulum için yeterlidir. Ancak, Blok Depolama gibi isteğe bağlı servisleri olan kurulumlar için :term:`Mantıksal Birim Yönetimini (LVM)` ele almalısınız.

source: A unique ``nova-consoleproxy`` package provides the ``nova-novncproxy``, ``nova-spicehtml5proxy``, and ``nova-xvpvncproxy`` packages. To select packages, edit the ``/etc/default/nova-consoleproxy`` file or use the debconf interface. You can also manually edit the ``/etc/default/nova-consoleproxy`` file, and stop and start the console daemons.
tr_tr: Tek ``nova-consoleproxy`` paketi ``nova-novncproxy``, ``nova-spicehtml5proxy``, ve ``nova-xvpvncproxy`` paketlerini içerir. Paketleri seçmek için, ``/etc/default/nova-consoleproxy`` dosyasını düzenleyin veya debconf arayüzünü kullanın. ``/etc/default/nova-consoleproxy`` dosyasını elle de düzenleyerek konsol artalan işlemlerini durdurup başlatabilirsiniz.

source: ALLOWED_HOSTS can also be ['*'] to accept all hosts. This may be useful for development work, but is potentially insecure and should not be used in production. See https://docs.djangoproject.com/en/dev/ref/settings/#allowed-hosts for further information.
tr_tr: ALLOWED_HOSTS tüm istemcileri kabul etmesi için ['*'] olabilir. Bu geliştirme ortamı için faydalı olabileceği gibi, güvensizdir ve üretim ortamında kullanılmamalıdır. Daha fazla bilgi için bknz https://docs.djangoproject.com/en/dev/ref/settings/#allowed-hosts.

source: Ability to take periodic "snap shots" throughout the installation process and "roll back" to a working configuration in the event of a problem.
tr_tr: Kurulum sürecinde aralıklarla "anlık görüntüler" alabilme ve bir sorun durumunda çalışan yapılandırmaya "geri alabilme" yeteneği.

source: Abstract
tr_tr: Özet

source: Access the dashboard using a web browser at ``http://controller/``.
tr_tr: Kontrol paneline bir tarayıcı kullanarak ``http://controller/`` adresinden erişin.

source: Access the dashboard using a web browser at ``http://controller/dashboard``.
tr_tr: Kontrol paneline bir tarayıcı kullanarak ``http://controller/dashboard`` adresinden erişin.

source: Access the dashboard using a web browser at ``http://controller/horizon``.
tr_tr: Kontrol paneline bir tarayıcı kullanarak ``http://controller/horizon`` adresinden erişin.

source: Access the instance remotely
tr_tr: Sunucuya uzaktan eriş

source: Access the instance using a virtual console
tr_tr: Sunucuya bir sanal konsolla erişin

source: Access the instance using the virtual console
tr_tr: Sanal konsol kullanarak sunucuya erişin

source: Access your instance using SSH and use the ``fdisk`` command to verify presence of the volume as the ``/dev/vdb`` block storage device:
tr_tr: Sunucunuza SSH kullanarak erişin ve ``fdisk`` komutunu kullanarak birimin ``/dev/vdb`` blok depolama aygıtı olarak varlığını onaylayın:

source: Access your instance using SSH from the controller node or any host on the provider physical network:
tr_tr: Kontrol düğümünden ya da sağlayıcı fiziksel ağındaki herhangi bir istemciden sunucunuza SSH ile erişin:

source: Actual output may differ slightly from this example.
tr_tr: Asıl çıktı bu örnektekinden biraz farklı olabilir.

source: Add a systemd service file for nova-novncproxy in ``/lib/systemd/system/nova-novncproxy.service``:
tr_tr: ``/lib/systemd/system/nova-novncproxy.service`` içine nova-novncproxy için bir systemd servis dosyası ekle:

source: Add rules to the ``default`` security group:
tr_tr: ``default`` güvenlik grubuna kurallar ekleyin:

source: Add security group rules
tr_tr: Güvenlik grubu kuralları ekle

source: Add the Placement user to the service project with the admin role:
tr_tr: Yerleştirme kullanıcısını servis projesine yönetici rolüyle ekleyin:

source: Add the ``admin`` role to the ``cinder`` user:
tr_tr: ``admin`` rolünü ``cinder`` kullanıcısına ekleyin:

source: Add the ``admin`` role to the ``glance`` user and ``service`` project:
tr_tr: ``admin`` rolünü ``glance`` kullanıcısına ve ``service`` projesine ekleyin:

source: Add the ``admin`` role to the ``neutron`` user:
tr_tr: ``admin`` rolünü ``neutron`` kullanıcısına ekleyin:

source: Add the ``admin`` role to the ``nova`` user:
tr_tr: ``admin`` rolünü ``nova`` kullanıcısına ekleyin:

source: Add the ``openstack`` user:
tr_tr: ``openstack`` kullanıcısını ekleyin:

source: Add the ``user`` role to the ``demo`` project and user:
tr_tr: ``user`` rolünü ``demo`` projesi ve kullanıcısına ekleyin:

source: Add the compute node to the cell database
tr_tr: Hesaplama düğümünü hücre veritabanına ekleyin

source: Add the self-service network subnet as an interface on the router:
tr_tr: Kendine servis ağı alt ağını yönlendiricide bir arayüz olarak ekleyin:

source: Additional compute nodes should use 10.0.0.32, 10.0.0.33, and so on.
tr_tr: Ek hesaplama düğümleri 10.0.0.32, 10.0.0.33 .. kullanmalı.

source: Additional services
tr_tr: Ek servisler

source: Additionally, you can allocate IP addresses on external networks to ports on the internal network. Whenever something is connected to a subnet, that connection is called a port. You can associate external network IP addresses with ports to VMs. This way, entities on the outside network can access VMs.
tr_tr: Ek olarak, harici ağlardan dahili ağdaki bağlantı noktalarına IP adresleri ayırabilirsiniz. Bir alt ağa ne zaman bir şey bağlanırsa, bu bağlantıya bağlantı noktası denir. Harici ağ IP adreslerini bağlantı noktalarıyla sanal makinelerle ilişkilendirebilirsiniz. Bu şekilde, dış ağdaki varlıklar sanal makinelere erişebilir.

source: After a short time, the volume status should change from ``creating`` to ``available``:
tr_tr: Kısa süre sonra, birim durumu ``oluşturuluyordan`` ``kullanılabilire`` dönmeli:

source: After becoming familiar with basic installation, configuration, operation, and troubleshooting of these OpenStack services, you should consider the following steps toward deployment using a production architecture:
tr_tr: Bu OpenStack servislerinin temel kurulum, yapılandırma, işlem ve sorun giderme işleriyle aşina olduğuktan sonra, bir üretim mimarisi kullanarak kurulum için şu adımları takip etmeyi düşünmelisiniz:

source: After creating the appropriate networks for your environment, you can continue preparing the environment to launch an instance.
tr_tr: Ortamınız için uygun ağları oluşturduktan sonra, bir sunucu başlatmak için ortamı hazırlamaya devam edebilirsiniz.

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the `SLES 12 <https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_basicnet_manconf.html>`__ or `openSUSE <https://doc.opensuse.org/documentation/leap/reference/html/book.opensuse.reference/cha.basicnet.html>`__ documentation.
tr_tr: Her bir düğüme seçtiğiniz mimaride işletim sistemi kurulumunu yaptıktan sonra, ağ arayüzlerini yapılandırmalısınız. Otomatik ağ yönetim araçlarını kapatmanızı ve dağıtımınız için uygun yapılandırmayı elle girmenizi öneririz. Dağıtımınızda ağ yapılandırmasının nasıl yapıldığıyla ilgili daha fazla bilgi için `SLES 12 <https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_basicnet_manconf.html>`__ veya `openSUSE <https://doc.opensuse.org/documentation/leap/reference/html/book.opensuse.reference/cha.basicnet.html>`__ belgelendirmesine göz atın.

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the `documentation <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/Networking_Guide/sec-Using_the_Command_Line_Interface.html>`__ .
tr_tr: Her bir düğüme seçtiğiniz mimaride işletim sistemi kurulumunu yaptıktan sonra, ağ arayüzlerini yapılandırmalısınız. Otomatik ağ yönetim araçlarını kapatmanızı ve dağıtımınız için uygun yapılandırmayı elle girmenizi öneririz. Dağıtımınızda ağ yapılandırmasının nasıl yapıldığıyla ilgili daha fazla bilgi için `belgelendirmeye <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/Networking_Guide/sec-Using_the_Command_Line_Interface.html>`__ göz atın.

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the `documentation <https://help.ubuntu.com/lts/serverguide/network-configuration.html>`_.
tr_tr: Her bir düğüme seçtiğiniz mimaride işletim sistemi kurulumunu yaptıktan sonra, ağ arayüzlerini yapılandırmalısınız. Otomatik ağ yönetim araçlarını kapatmanızı ve dağıtımınız için uygun yapılandırmayı elle girmenizi öneririz. Dağıtımınızda ağ yapılandırmasının nasıl yapıldığıyla ilgili daha fazla bilgi için `belgelendirmeye <https://help.ubuntu.com/lts/serverguide/network-configuration.html>`_ göz atın.

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the `documentation <https://wiki.debian.org/NetworkConfiguration>`__ .
tr_tr: Her bir düğüme seçtiğiniz mimaride işletim sistemi kurulumunu yaptıktan sonra, ağ arayüzlerini yapılandırmalısınız. Otomatik ağ yönetim araçlarını kapatmanızı ve dağıtımınız için uygun yapılandırmayı elle girmenizi öneririz. Dağıtımınızda ağ yapılandırmasının nasıl yapıldığıyla ilgili daha fazla bilgi için `belgelendirmeye <https://wiki.debian.org/NetworkConfiguration>`__ göz atın.

source: After you configure the ML2 plug-in, removing values in the ``type_drivers`` option can lead to database inconsistency.
tr_tr: ML2 eklentisini yapılandırdıktan sonra, ``type_drivers`` seçeneğindeki değerleri kaldırmak veritabanı tutarsızlığına yol açabilir.

source: After you install and configure the dashboard, you can complete the following tasks:
tr_tr: Kontrol panelini yükleyip yapılandırdıktan sonra, şu görevleri tamamlayabilirsiniz:

source: All nodes require Internet access for administrative purposes such as package installation, security updates, :term:`DNS <Domain Name System (DNS)>`, and :term:`NTP <Network Time Protocol (NTP)>`. In most cases, nodes should obtain Internet access through the management network interface. To highlight the importance of network separation, the example architectures use `private address space <https://tools.ietf.org/html/rfc1918>`__ for the management network and assume that the physical network infrastructure provides Internet access via :term:`NAT <Network Address Translation (NAT)>` or other methods. The example architectures use routable IP address space for the provider (external) network and assume that the physical network infrastructure provides direct Internet access.
tr_tr: Tüm düğümler paket yükleme, güvenlik güncellemeleri :term:`DNS <Domain Name System (DNS)>`, ve :term:`NTP <Network Time Protocol (NTP)>` gibi yönetim işleri için internet erişimine ihtiyaç duyarlar. Çoğu durumda, düğümler internet erişimini yönetim ağ arayüzünden karşılamalıdır. Ağ ayrımının önemini vurgulamak için, örnek mimariler yönetim ağı için `özel adres uzayı<https://tools.ietf.org/html/rfc1918>`__ kullanır ve fiziksel ağ alt yapısının :term:`NAT <Network Address Translation (NAT)>` veya başka yöntemlerle interneti sağladığını var sayar. Örnek mimari sağlayıcı (harici) ağ için yönlendirilebilir IP adres uzayı kullanır ve fiziksel ağ alt yapısının doğrudan internet erişimi sağladığını var sayar.

source: Allow your hosts to access the dashboard:
tr_tr: İstemcilerinize kontrol paneline erişim verin:

source: Alternatively, you can skip the ``ssh-keygen`` command and use an existing public key.
tr_tr: Alternatif olarak, ``ssh-keygen`` komutunu geçip mevcut bir açık anahtarı kullanabilirsiniz.

source: Although most environments include Identity, Image service, Compute, at least one networking service, and the Dashboard, the Object Storage service can operate independently. If your use case only involves Object Storage, you can skip to `Object Storage Installation Guide <https://docs.openstack.org/project-install-guide/object-storage/draft/>`_ after configuring the appropriate nodes for it.
tr_tr: Çoğu ortam Kimlik, İmaj servici, Hesaplama, en az bir ağ servisi, ve Kontrol paneli içerse de Nesne Depolama servici bağımsız olarak çalışabilir. Kullanım durumunuz Nesne Depolamayı içeriyorsa, gerekli düğümleri yapılandırdıktan sonra `Nesne Depolama Kurulum Kılavuzuna <https://docs.openstack.org/project-install-guide/object-storage/draft/>`_ geçebilirsiniz.

source: Any given Networking set up has at least one external network. Unlike the other networks, the external network is not merely a virtually defined network. Instead, it represents a view into a slice of the physical, external network accessible outside the OpenStack installation. IP addresses on the external network are accessible by anybody physically on the outside network.
tr_tr: Verilen her Ağ kurulumu en az bir harici ağa sahiptir. Diğer ağlardan farklı olarak, harici ağ sanal olarak tanımlanmış bir ağdan ibaret değildir. Bunun yerine, OpenStack kurulumunun dışından erişilebilir fiziksel, harici bir ağın bir parçası görünümündedir. Harici ağdaki IP adresleri fiziksel olarak dış ağdaki herkes tarafından erişilebilir.

source: Application Catalog service (murano)
tr_tr: Uygulama Katalog servisi (murano)

source: As of Ubuntu 16.04, MariaDB was changed to use the "unix_socket Authentication Plugin". Local authentication is now performed using the user credentials (UID), and password authentication is no longer used by default. This means that the root user no longer uses a password for local access to the server.
tr_tr: Ubuntu 16.04 itibariyle, MariaDB "unix_socket Yetkilendirme Eklentisini" kullanacak şekilde değişti. Yerel yetkilendirme artık kullanıcı kimlik bilgileriyle (UID) yapılıyor ve parolayla yetkilendirme artık öntanımlı değil. Bunun anlamı root kullanıcının sunucuya yerel erişim için bir parola kullanmaması.

source: As of the Newton release, SUSE OpenStack packages are shipped with the upstream default configuration files. For example, ``/etc/nova/nova.conf`` has customizations in ``/etc/nova/nova.conf.d/010-nova.conf``. While the following instructions modify the default configuration file, adding a new file in ``/etc/nova/nova.conf.d`` achieves the same result.
tr_tr: Newton dağıtımıyla birlikte, SUSE OpenStack paketleri paketle gelen yapılandırma dosyalarıyla gelir. Örneğin, ``/etc/nova/nova.conf`` dosyası ``/etc/nova/nova.conf.d/010-nova.conf`` da özelleştirmeler içerir. Aşağıdaki yönergeler öntanımlı yapılandırm dosyasını değiştirse de, ``/etc/nova/nova.conf.d``dizinine yeni bir dosya eklemek de aynı sonucu verir.

source: As the ``admin`` user, request an authentication token:
tr_tr: ``admin`` kullanıcısı olarak, bir kimlik doğrulama jetonu isteyin:

source: As the ``demo`` user, request an authentication token:
tr_tr: ``demo`` kullanıcısı olarak, bir kimlik doğrulama jetonu iste:

source: As the number of OpenStack services and virtual machines increase, so do the hardware requirements for the best performance. If performance degrades after enabling additional services or virtual machines, consider adding hardware resources to your environment.
tr_tr: OpenStack servisleri ve sanal makinelerin sayısı arttıkça, en iyi başarım için donanım gereksinimleri de artar. Ek servisleri etkinleştirince ya da yeni sanal makineler açınca başarım düşerse, ortamınıza donanım kaynağı eklemeyi düşünün.

source: Associate the floating IP address with the instance:
tr_tr: Değişken IP adresi sunucuyla ilişkilendirin:

source: Attach a volume to an instance:
tr_tr: Bir birimi bir sunucuya ekleyin:

source: Attach the ``volume1`` volume to the ``provider-instance`` instance:
tr_tr: ``volume1`` birimini ``provider-instance`` sunucusuna ekle:

source: Attach the volume to an instance
tr_tr: Birimi bir sunucuya ekleyin

source: Authenticate using ``admin`` or ``demo`` user and ``default`` domain credentials.
tr_tr: ``admin`` veya ``demo`` kullanıcısıyla ve ``öntanımlı`` alan kimlik bilgileriyle giriş yapın.

source: Back-end names are arbitrary. As an example, this guide uses the name of the driver as the name of the back end.
tr_tr: Arka-uç isimleri isteğe bağlıdır. Örneğin, bu kılavuz arka uç ismi olarak sürücü ismini kullanır.

source: Bare Metal service (ironic)
tr_tr: Saf Metal servisi (ironic)

source: Before launching an instance, you must create the necessary virtual network infrastructure. For networking option 1, an instance uses a provider (external) network that connects to the physical network infrastructure via layer-2 (bridging/switching). This network includes a DHCP server that provides IP addresses to instances.
tr_tr: Bir sunucu başlatmadan önce, gerekli sanal ağ alt yapısını oluşturmalısınız. Ağ seçeneği 1, sunucu katman-2 (köprüleme/anahtarlama) aracılığıyla fiziksel ağ alt yapısına bağlanan sağlayıcı (harici) ağ kullanır. Bu ağ sunuculara IP adresi sağlayan bir DHCP sunucu içerir.

source: Before you begin, ensure you have the most recent version of ``python-pyasn1`` `installed <https://pypi.python.org/pypi/pyasn1>`_.
tr_tr: Başlamadan önce, ``python-pyasn1`` paketinin son sürümünün kurulu olduğundan emin olun <https://pypi.python.org/pypi/pyasn1>`_.

source: Before you configure the OpenStack Networking (neutron) service, you must create a database, service credentials, and API endpoints.
tr_tr: OpenStack ağ servisini (neutron) yapılandırmadan önce, bir veritabanı, servis kimlik bilgiler, ve API uç noktaları oluşturmalısınız.

source: Before you install and configure the Block Storage service on the storage node, you must prepare the storage device.
tr_tr: Blok Depolama servisini depolama düğümünde kurup yapılandırmadan önce, depolama aygıtını hazırlamalısınız.

source: Before you install and configure the Block Storage service, you must create a database, service credentials, and API endpoints.
tr_tr: Blok Depolama servisini kurup yapılandırmadan önce bir veritabanı, servis kimlik bilgileri ve API uç noktaları oluşturmalısınız.

source: Before you install and configure the Compute service, you must create databases, service credentials, and API endpoints.
tr_tr: Hesaplama servisini kurup yapılandırmadan önce, veritabanları, servis kimlik bilgileri ve API uç noktaları oluşturmalısınız.

source: Before you install and configure the Identity service, you must create a database.
tr_tr: Kimlik servisini kurup yapılandırmadan önce, bir veritabanı oluşturmalısınız.

source: Before you install and configure the Image service, you must create a database, service credentials, and API endpoints.
tr_tr: İmaj servisini kurup yapılandırmadan önce, bir veritabanı, servis kimlik bilgileri, ve API uç noktaları oluşturmalısınız.

source: Below endpoints list may differ depending on the installation of OpenStack components.
tr_tr: Aşağıdaki uç nokta listesi OpenStack bileşenlerinin kuruluma göre değişebilir.

source: Block Storage
tr_tr: Blok Depolama

source: Block Storage service
tr_tr: Blok Depolama servisi

source: Block storage node (Optional)
tr_tr: Blok depolama düğümü (İsteğe bağlı)

source: Bootstrap the Identity service:
tr_tr: Kimlik servisini ön yükleyin:

source: By default, Compute uses an internal firewall driver. Since the Networking service includes a firewall driver, you must disable the Compute firewall driver by using the ``nova.virt.firewall.NoopFirewallDriver`` firewall driver.
tr_tr: Öntanımlı olarak, Hesaplama dahili bir güvenlik duvarı kullanır. Ağ servisi de bir güvenlik duvarı içerdiğinden, ``nova.virt.firewall.NoopFirewallDriver`` güvenlik duvarı sürücüsünü kullanarak Hesaplama güvenlik duvarını kapatmalısınız.

source: By default, Compute uses an internal firewall service. Since Networking includes a firewall service, you must disable the Compute firewall service by using the ``nova.virt.firewall.NoopFirewallDriver`` firewall driver.
tr_tr: Öntanımlı olarak, Hesaplama dahili bir güvenlik duvarı servisi kullanır. Ağ da bir güvenlik duvarı servisi içerdiğinden, Hesaplama güvenlik duvarını ``nova.virt.firewall.NoopFirewallDriver`` güvenlik duvarı sürücüsünü kullanarak kapatmalısınız.

source: By default, the ``default`` security group applies to all instances and includes firewall rules that deny remote access to instances. For Linux images such as CirrOS, we recommend allowing at least ICMP (ping) and secure shell (SSH).
tr_tr: Öntanımlı olarak, ``default`` güvenlik grubu tüm sunuculara uygulanır ve sunuculara uzak erişimi engelleyen güvenlik kuralları içerir. CirrOS gibi Linux imajları için, en azından ICMP (ping) ve güvenli kabuk (SSH) için izin vermenizi öneriyoruz.

source: By default, the controller node synchronizes the time via a pool of public servers. However, you can optionally configure alternative servers such as those provided by your organization.
tr_tr: Öntanımlı olarak, kontrol düğümü zamanı bir açık sunucu havuzu aracılığıyla eşzamanlar. Ancak, organizasyonunuzun sağladığı sunucular gibi, alternatif sunucular da yapılandırabilirsiniz.

source: Change the existing line ``MEMCACHED_PARAMS="-l 127.0.0.1,::1"``.
tr_tr: ``MEMCACHED_PARAMS="-l 127.0.0.1,::1"`` satırını değiştirin.

source: Change the existing line ``OPTIONS="-l 127.0.0.1,::1"``.
tr_tr: ``OPTIONS="-l 127.0.0.1,::1"`` satırını değiştirin.

source: Change the existing line that had ``-l 127.0.0.1``.
tr_tr: ``-l 127.0.0.1`` içeren satırı değiştirin.

source: Check the cells and placement API are working successfully:
tr_tr: Hücrelerin ve yerleştirme API'sinin düzgün çalıştığını kontrol edin:
