Repository: px22222/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: tr_tr

source: Check the status of your floating IP address:
tr_tr: Değişken IP adresinin durumunu kontrol edin:

source: Check the status of your instance:
tr_tr: Sunucunuzun durumunu kontrol edin:

source: Choose one of the following virtual networking options.
tr_tr: Aşağıdaki sanal ağ seçeneklerinden birini seçin.

source: Collects event and metering data by monitoring notifications sent from services.
tr_tr: Servislerden gelen bildirimleri izleyerek olay ve ölçüm verileri toplar.

source: Comment out any other session storage configuration.
tr_tr: Diğer oturum depolama yapılandırmalarını yorum satırına alın.

source: Comment out or remove any other ``connection`` options in the ``[database]`` section.
tr_tr: ``[database]`` kısmındaki diğer tüm ``connection`` anahtarlarını silin ya da yorum satırına alın.

source: Comment out or remove any other options in the ``[keystone_authtoken]`` section.
tr_tr: ``[keystone_authtoken]`` kısmındaki diğer seçenekleri yorum satırıyla ya da silerek kaldırın.

source: Comment out the ``pool 2.debian.pool.ntp.org offline iburst`` line.
tr_tr: ``pool 2.debian.pool.ntp.org offline iburst`` satırını yorum satırı haline getirin.

source: Compute
tr_tr: Hesaplama

source: Compute Node: 1 processor, 2 GB memory, and 10 GB storage
tr_tr: Hesaplama Düğümü: 1 işlemci, 2 GB hafıza, ve 10 GB depolama

source: Compute node
tr_tr: Hesaplama düğümü

source: Compute service
tr_tr: Hesaplama servisi

source: Configure API versions:
tr_tr: API sürümlerini yapılandır:

source: Configure Compute to use Block Storage
tr_tr: Hesaplamayı Blok Depolama kullanacak şekilde yapılandırın

source: Configure ``Default`` as the default domain for users that you create via the dashboard:
tr_tr: Kontrol panelden oluşturduğunuz kullanıcılar için öntanımlı alan olarak ``Default`` anahtarını yapılandır:

source: Configure ``user`` as the default role for users that you create via the dashboard:
tr_tr: Kontrol panelden oluşturduğunuz kullanıcılar için öntanımlı rol olarak ``user`` anahtarını yapılandır:

source: Configure name resolution
tr_tr: İsim çözümünü yapılandırın

source: Configure network interfaces
tr_tr: Ağ arayüzlerini yapılandır

source: Configure networking options
tr_tr: Ağ seçeneklerini yapılandırın

source: Configure the Apache HTTP server
tr_tr: Apache HTTP sunucuyu yapılandır

source: Configure the Compute service to use the Networking service
tr_tr: Hesaplama servisini Ağ servisini kullanacak şekilde yapılandırın

source: Configure the DHCP agent
tr_tr: DHCP aracını yapılandırın

source: Configure the Linux bridge agent
tr_tr: Linux köprüleme aracını yapılandırın

source: Configure the Modular Layer 2 (ML2) plug-in
tr_tr: Modüler Katman 2 (ML2) eklentisini yapılandır

source: Configure the Networking components on a *compute* node.
tr_tr: Ağ bileşenlerini *hesaplama* düğümünde yapılandırın.

source: Configure the ``memcached`` session storage service:
tr_tr: ``memcached`` oturumunu ve depolama servisini yapılandırın:

source: Configure the administrative account
tr_tr: Yönetici hesabını yapılandırın

source: Configure the common component
tr_tr: Genel bileşenleri yapılandır

source: Configure the dashboard to use OpenStack services on the ``controller`` node:
tr_tr: Kontrol panelini ``kontrol`` düğümündeki OpenStack servislerini kullanacak şekilde yapılandır:

source: Configure the first interface as the management interface:
tr_tr: İlk arayüzü yönetim arayüzü olarak yapılandır:

source: Configure the layer-3 agent
tr_tr: Katman-3 aracıyı yapılandırın

source: Configure the management interface:
tr_tr: Yönetim arayüzünü yapılandırın:

source: Configure the metadata agent
tr_tr: Metaveri aracısını yapılandırın

source: Configure the server component
tr_tr: Sunucu bileşenini yapılandır

source: Configure the service to use the management IP address of the controller node. This is to enable access by other nodes via the management network:
tr_tr: Servisi kontrol düğümünün yönetici IP adresini kullanacak şekilde yapılandırın. Bu, yönetim aracılığıyla diğer düğümler tarafından erişime izin içindir.

source: Configure the web server:
tr_tr: Web sunucusunu yapılandır:

source: Confirm upload of the image and validate attributes:
tr_tr: İmaj yüklenmesini onaylayın ve öznitelikleri doğrulayın:

source: Container Infrastructure Management service (magnum)
tr_tr: Kapsayıcı Altyapı Yönetim servisi (magnum)

source: Contents
tr_tr: İçerik

source: Contents in the *Name/IP address* column should indicate the hostname of the controller node.
tr_tr: *İsim/IP adresi* sütunundaki içerik kontrol düğümünüzün makine adını göstermeli.

source: Contents in the *Name/IP address* column should indicate the hostname or IP address of one or more NTP servers. Contents in the *MS* column should indicate *\** for the server to which the NTP service is currently synchronized.
tr_tr: *İsim/IP adresi* sütunundaki içerik bir ya da daha fazla NTP sunucunun makine adı veya IP adresini göstermeli. *MS* sütunundaki içerik NTP servisinin şu an eşzamanlandığı sunucu için *\** belirtmeli.

source: Controller
tr_tr: Kontrol

source: Controller Node: 1 processor, 4 GB memory, and 5 GB storage
tr_tr: Kontrol Düğümü: 1 işlemci, 4 GB hafıza, ve 5 GB depolama

source: Controller node
tr_tr: Kontrol düğümü

source: Create OpenStack client environment scripts
tr_tr: OpenStack istemci ortam betiklerini oluşturun

source: Create a 1 GB volume:
tr_tr: 1 GB birim oluşturun:

source: Create a :term:`floating IP address` on the provider virtual network:
tr_tr: Sağlayıcı sanal ağında bir :term:`değişken IP adresi` oluşturun:

source: Create a Placement service user using your chosen ``PLACEMENT_PASS``:
tr_tr: Seçtiğiniz ``PLACEMENT_PASS`` ile bir Yerleştirme servisi kullanıcısı oluşturun:

source: Create a ``[mysqld]`` section, and set the ``bind-address`` key to the management IP address of the controller node to enable access by other nodes via the management network. Set additional keys to enable useful options and the UTF-8 character set:
tr_tr: Bir ``[mysqld]`` bölümü oluşturun, ve ``bind-address`` anahtarını kontrol düğümünün yönetim IP adresi olarak ayarlayarak diğer düğümlerin yönetici ağı aracılığıyla erişimini etkinleştirin. Kullanışlı seçenekleri ve UTF-8 karakter kümesini etkinleştirmek için ek anahtar ayarlayın:

source: Create a ``cinder`` user:
tr_tr: Bir ``cinder`` kullanıcısı oluşturun:

source: Create a domain, projects, users, and roles
tr_tr: Bir alan, projeler, kullanıcılar ve roller oluşturun

source: Create a link to the ``/usr/share/keystone/wsgi-keystone.conf`` file:
tr_tr: ``/usr/share/keystone/wsgi-keystone.conf`` dosyasına bir bağlantı oluşturun:

source: Create a router
tr_tr: Bir yönlendirici oluştur

source: Create a subnet on the network:
tr_tr: Ağda bir alt ağ oluştur:

source: Create a volume
tr_tr: Bir birim oluşturun

source: Create and edit the ``/etc/my.cnf.d/openstack.cnf`` file and complete the following actions:
tr_tr: ``/etc/my.cnf.d/openstack.cnf`` dosyasını oluşturun ve düzenleyerek aşağıdaki eylemleri tamamlayın:

source: Create and edit the ``/etc/mysql/conf.d/openstack.cnf`` file and complete the following actions:
tr_tr: ``/etc/mysql/conf.d/openstack.cnf`` dosyasını oluşturun ve düzenleyerek şu eylemleri tamamlayın:

source: Create and edit the ``/etc/mysql/mariadb.conf.d/99-openstack.cnf`` file and complete the following actions:
tr_tr: ``/etc/mysql/mariadb.conf.d/99-openstack.cnf`` dosyasını oluşturup düzenleyin ve şu eylemleri tamamlayın:

source: Create and edit the ``admin-openrc`` file and add the following content:
tr_tr: ``admin-openrc`` dosyasını oluşturun ve düzenleyerek şu içeriği ekleyin:

source: Create and edit the ``demo-openrc`` file and add the following content:
tr_tr: ``demo-openrc`` dosyasını oluşturun ve şu içeriği ekleyerek düzenleyin:

source: Create client environment scripts for the ``admin`` and ``demo`` projects and users. Future portions of this guide reference these scripts to load appropriate credentials for client operations.
tr_tr: ``admin`` ve ``demo`` projeleri ve kullanıcılar için istemci ortam betiklerini oluştur. Bu kılavuzun ilerleyen bölümleri istemci işlemleri için uygun kimlik bilgilerinin yüklenmesi için bu betiklere başvurur.

source: Create m1.nano flavor
tr_tr: m1.nano niteliği oluştur

source: Create the Block Storage service API endpoints:
tr_tr: Blok Depolama servis API uç noktalarını oluşturun:

source: Create the Compute API service endpoints:
tr_tr: Hesaplama API'si servis uç noktalarını oluşturun:

source: Create the Compute service credentials:
tr_tr: Hesaplama servisi kimlik bilgilerini oluşturun:

source: Create the Image service API endpoints:
tr_tr: İmaj servisi API uç noktalarını oluşturun:

source: Create the LVM physical volume ``/dev/sdb``:
tr_tr: ``/dev/sdb`` LVM fiziksel birimini oluşturun:

source: Create the LVM volume group ``cinder-volumes``:
tr_tr: ``cinder-volumes`` LVM birim grubunu oluşturun:

source: Create the Networking service API endpoints:
tr_tr: Ağ servis API uç noktalarını oluşturun:

source: Create the Placement API entry in the service catalog:
tr_tr: Servis kataloğunda Yerleştirme API girdisini oluşturun:

source: Create the Placement API service endpoints:
tr_tr: Yerleştirme API'si servis uç noktalarını oluşturun:

source: Create the ``/etc/apache2/conf.d/wsgi-keystone.conf`` file with the following content:
tr_tr: ``/etc/apache2/conf.d/wsgi-keystone.conf`` dosyasını şu içerikle oluşturun:

source: Create the ``/etc/tgt/conf.d/cinder.conf`` file with the following data:
tr_tr: ``/etc/tgt/conf.d/cinder.conf`` dosyasını aşağıdaki veri ile oluşturun:

source: Create the ``cell1`` cell:
tr_tr: ``cell1`` hücresini oluştur:

source: Create the ``cinderv2`` and ``cinderv3`` service entities:
tr_tr: ``cinderv2`` ve ``cinderv3`` servis varlıklarını oluşturun:

source: Create the ``demo`` project:
tr_tr: ``demo`` projesini oluşturun:

source: Create the ``demo`` user:
tr_tr: ``demo`` kullanıcısını oluşturun:

source: Create the ``glance`` service entity:
tr_tr: ``glance`` servis varlığını oluşturun:

source: Create the ``glance`` user:
tr_tr: ``glance`` kullanıcısını oluşturun:

source: Create the ``keystone`` database:
tr_tr: ``keystone`` veritabanını oluşturun:

source: Create the ``neutron`` service entity:
tr_tr: ``neutron`` servis varlığını oluşturun:

source: Create the ``neutron`` user:
tr_tr: ``neutron`` kullanıcısını oluşturun:

source: Create the ``nova`` service entity:
tr_tr: ``nova`` servis varlığını oluşturun:

source: Create the ``nova`` user:
tr_tr: ``nova`` kullanıcısını oluştur:

source: Create the ``user`` role:
tr_tr: ``user`` rolünü oluşturun:

source: Create the network:
tr_tr: Ağı oluşturun:

source: Create the provider network
tr_tr: Sağlayıcı ağı oluştur

source: Create the router:
tr_tr: Yönlendiriciyi oluşturun:

source: Create the self-service network
tr_tr: Kendine servis ağını oluştur

source: Create virtual networks
tr_tr: Sanal ağlar oluşturun

source: Create virtual networks for the networking option that you chose in :ref:`networking`. If you chose option 1, create only the provider network. If you chose option 2, create the provider and self-service networks.
tr_tr: :ref:`networking` kısmında seçtiğiniz ağ seçeneği için sanal ağlar oluşturun. Seçenek 1'i seçtiyseniz, yalnızca sağlayıcı ağı oluşturun. Seçenek 2'yi seçtiyseniz, sağlayıcı ve kendine servis ağlarını oluşturun.

source: Creating the scripts
tr_tr: Betiklerin oluşturulması

source: Customize your dashboard. See section `Customize and configure the Dashboard <https://docs.openstack.org/admin-guide/dashboard-customize-configure.html>`__.
tr_tr: Kontrol panelinizi yapılandırın. `Kontrol panelini özelleştirin ve yapılandırın <https://docs.openstack.org/admin-guide/dashboard-customize-configure.html>`__ kısmına göz atın.

source: DNS service (designate)
tr_tr: DNS servisi (designate)

source: Dashboard
tr_tr: Kontrol Paneli

source: Database password (no variable used)
tr_tr: Veritabanı parolası (değişken kullanılmadı)

source: Database password for Compute service
tr_tr: Hesaplama servisi için veritabanı parolası

source: Database password for Image service
tr_tr: İmaj servisi için veritabanı parolası

source: Database password for the Block Storage service
tr_tr: Blok Depolama servisi için veritabanı parolası

source: Database password for the Dashboard
tr_tr: Kontrol paneli için veritabanı parolası

source: Database password for the Networking service
tr_tr: Ağ servisi için veritabanı parolası

source: Database password of Identity service
tr_tr: Kimlik servisinin veritabanı parolası

source: Database population occurs later for Networking because the script requires complete server and plug-in configuration files.
tr_tr: Veritabanı doldurma Ağ için daha sonra olur çünkü betik sunucunun ve eklenti yapılandırma dosyalarının tam olmasını gerektirir.

source: Database service (trove)
tr_tr: Veritabanı servisi (trove)

source: Default configuration files vary by distribution. You might need to add these sections and options rather than modifying existing sections and options. Also, an ellipsis (``...``) in the configuration snippets indicates potential default configuration options that you should retain.
tr_tr: Öntanımlı yapılandırma dosyaları dağıtımdan dağıtıma değişir. Mevcut kısım ve seçenekleri değiştirmek yerine bu kısım ve seçenekleri eklemeniz gerekebilir. Yapılandırma parçacıklarındaki (``...``) elips korumanız gereken öntanımlı yapılandırma seçeneklerini gösterir.

source: Default gateway: 10.0.0.1
tr_tr: Öntanımlı ağ geçidi: 10.0.0.1

source: Default gateway: ``10.0.0.1``
tr_tr: Öntanımlı ağ geçidi: ``10.0.0.1``

source: Description
tr_tr: Açıklama

source: Determine and implement the necessary core and optional services to meet performance and redundancy requirements.
tr_tr: Başarım ve yeterlilik gerekliliklerini karşılamak için çekirdek ve isteğe bağlı servisleri tanımlayın ve uygulayın.

source: Determine instance options
tr_tr: Sunucu seçeneklerini kararlaştırın

source: Determine whether your compute node supports hardware acceleration for virtual machines:
tr_tr: Hesaplama düğümünüzün sanal makineler için donanım hızlandırmasını destekleyip desteklemediğini öğrenin:

source: Disable or remove any automatic update services because they can impact your OpenStack environment.
tr_tr: OpenStack ortamınızı etkileyebileceklerinden tüm otomatik güncelleme servislerini kapatın ya da kaldırın.

source: Discover compute hosts:
tr_tr: Hesaplama sunucularını kefşet:

source: Distributions release OpenStack packages as part of the distribution or using other methods because of differing release schedules. Perform these procedures on all nodes.
tr_tr: Dağıtımlar OpenStack paketlerini dağıtımın parçası olarak ya da değişken yayım takvimleri sebebiyle başka yöntemlerle yayınlarlar. Bu yordamları tüm düğümlerde uygulayın.

source: Do not change the ``HWADDR`` and ``UUID`` keys.
tr_tr: ``HWADDR`` ve ``UUID`` anahtarlarını değiştirmeyin.

source: Do not edit the ``ALLOWED_HOSTS`` parameter under the Ubuntu configuration section.
tr_tr: Ubuntu yapılandırma kısmı altındaki ``ALLOWED_HOSTS`` parametresini düzenlemeyin.

source: Do not repeat this step when creating additional users for this project.
tr_tr: Bu proje için ek kullanıcılar oluştururken bu adımı tekrarlamayın.

source: Download the source image:
tr_tr: Kaynak imajı indirin:

source: Due to a `packaging bug <https://bugzilla.redhat.com/show_bug.cgi?id=1430540>`_, you must enable access to the Placement API by adding the following configuration to ``/etc/httpd/conf.d/00-nova-placement-api.conf``:
tr_tr: Bir `paketleme hatası <https://bugzilla.redhat.com/show_bug.cgi?id=1430540>`_ yüzünden, aşağıdaki yapılandırmayı ``/etc/httpd/conf.d/00-nova-placement-api.conf`` dosyasına ekleyerek Yerleştirme API'sine erişimi etkinleştirmelisiniz:

source: Due to a packaging bug, remove the ``log_dir`` option from the ``[DEFAULT]`` section.
tr_tr: Paketleme hatası yüzünden, ``[DEFAULT]`` kısmından ``log_dir`` seçeneğini kaldırın.

source: Each item in the filter array begins with ``a`` for **accept** or ``r`` for **reject** and includes a regular expression for the device name. The array must end with ``r/.*/`` to reject any remaining devices. You can use the :command:`vgs -vvvv` command to test filters.
tr_tr: Süzgeç dizisindeki her öge **accept** anlamında ``a`` veya **reject** anlamında ``r`` ile başlar ve aygıt ismi için bir düzenli ifade içerir. Dizi geri kalan tüm aygıtları reddetmek için ``r/.*/`` ile bitmelidir. Süzgeçleri denemek için :command:`vgs -vvvv` komutunu kullanabilirsiniz.

source: Each plug-in that Networking uses has its own concepts. While not vital to operating the VNI and OpenStack environment, understanding these concepts can help you set up Networking. All Networking installations use a core plug-in and a security group plug-in (or just the No-Op security group plug-in). Additionally, Firewall-as-a-Service (FWaaS) and Load-Balancer-as-a-Service (LBaaS) plug-ins are available.
tr_tr: Ağın kullandığı her eklentinin kendi kavramları vardır. VNI ve OpenStack ortamını çalıştırmak için elzem olmasa da, bu kavramları anlamak Ağı ayarlarken yardımcı olabilir. Tüm Ağ kurulumları bir çekirdek eklenti ve güvenlik grubu eklentisi (ya da yalnızca No-Op güvenlik grubu eklentisi) kullanır. Ek olarak, Servis-olarak-Güvenlik-Duvarı (FWaaS) ve Servis-olarak-Yük-Dengeleyici (LBaaS) eklentileri kullanılabilir.

source: Edit the ``/etc/apache2/apache2.conf`` file and configure the ``ServerName`` option to reference the controller node:
tr_tr: ``/etc/apache2/apache2.conf`` dosyasını düzenleyin ve ``ServerName`` seçeneğini kontrol düğümünü gösterecek şekilde yapılandırın:

source: Edit the ``/etc/chrony.conf`` file and add, change, or remove these keys as necessary for your environment:
tr_tr: ``/etc/chrony.conf`` dosyasını düzenleyin ve ortamınıza uygun şekilde bu anahtarları ekleyin, değiştirin ya da kaldırın:

source: Edit the ``/etc/chrony.conf`` file and comment out or remove all but one ``server`` key. Change it to reference the controller node:
tr_tr: ``/etc/chrony.conf`` dosyasını düzenleyin ve tüm ``server`` anahtarlarını bir tane kalacak şekilde silin ya da yorum satırına alın. Kalan anahtarı kontrol düğümüne bakacak şekilde değiştirin:

source: Edit the ``/etc/chrony/chrony.conf`` file and add, change, or remove these keys as necessary for your environment:
tr_tr: ``/etc/chrony/chrony.conf`` dosyasını düzenleyin ve şu anahtarları ortamınıza göre ekleyin, değiştirin ya da kaldırın:

source: Edit the ``/etc/chrony/chrony.conf`` file and comment out or remove all but one ``server`` key. Change it to reference the controller node:
tr_tr: ``/etc/chrony/chrony.conf`` dosyasını düzenleyin ve tek ``server`` anahtarı dışındakileri silin ya da yorum satırına alın. Kontrol düğümüne başvuracak şekilde değiştirin.

source: Edit the ``/etc/cinder/cinder.conf`` file and complete the following actions:
tr_tr: ``/etc/cinder/cinder.conf`` dosyasını düzenleyin aşağıdaki eylemleri tamamlayın:

source: Edit the ``/etc/glance/glance-api.conf`` file and complete the following actions:
tr_tr: ``/etc/glance/glance-api.conf`` dosyasını düzenleyin ve şu eylemlerle tamalayın:

source: Edit the ``/etc/glance/glance-registry.conf`` file and complete the following actions:
tr_tr: ``/etc/glance/glance-registry.conf`` dosyasını düznleyin ve şu eylemleri tamamlayın:

source: Edit the ``/etc/hosts`` file to contain the following:
tr_tr: ``/etc/hosts`` dosyasını aşağıdakileri içerecek şekilde düzenleyin:

source: Edit the ``/etc/httpd/conf/httpd.conf`` file and configure the ``ServerName`` option to reference the controller node:
tr_tr: ``/etc/httpd/conf/httpd.conf`` dosyasını düzenleyin ve ``ServerName`` seçeneğini kontrol düğümünü gösterecek şekilde yapılandırın:

source: Edit the ``/etc/keystone/keystone-paste.ini`` file and remove ``admin_token_auth`` from the ``[pipeline:public_api]``, ``[pipeline:admin_api]``, and ``[pipeline:api_v3]`` sections.
tr_tr: ``/etc/keystone/keystone-paste.ini`` dosyasını düzenleyin ve ``[pipeline:public_api]``, ``[pipeline:admin_api]``, ve ``[pipeline:api_v3]`` kısımlarından ``admin_token_auth`` anahtarını silin.

source: Edit the ``/etc/keystone/keystone.conf`` file and complete the following actions:
tr_tr: ``/etc/keystone/keystone.conf`` dosyasını düzenleyin ve şu eylemleri tamamlayın:

source: Edit the ``/etc/memcached.conf`` file and configure the service to use the management IP address of the controller node. This is to enable access by other nodes via the management network:
tr_tr: ``/etc/memcached.conf`` dosyasını düzenleyin ve kontrol düğümünün yönetim IP adresini kullanacak servisi yapılandırın. Bu diğer düğümlerden yönetim arayüzü aracılığıyla erişimi etkinleştirmek içindir:

source: Edit the ``/etc/network/interfaces`` file to contain the following:
tr_tr: ``/etc/network/interfaces`` dosyasını aşağıdakileri içerecek şekilde düzenleyin:

source: Edit the ``/etc/neutron/dhcp_agent.ini`` file and complete the following actions:
tr_tr: ``/etc/neutron/dhcp_agent.ini`` dosyasını düzenleyin ve şu eylemleri tamamlayın:

source: Edit the ``/etc/neutron/l3_agent.ini`` file and complete the following actions:
tr_tr: ``/etc/neutron/l3_agent.ini`` dosyasını düzenleyin ve aşağıdaki eylemleri tamamlayın:

source: Edit the ``/etc/neutron/metadata_agent.ini`` file and complete the following actions:
tr_tr: ``/etc/neutron/metadata_agent.ini`` dosyasını düzenleyin ve şu eylemlerle tamamlayın:

source: Edit the ``/etc/neutron/neutron.conf`` file and complete the following actions:
tr_tr: ``/etc/neutron/neutron.conf`` dosyasını düzenleyerek şu eylemleri tamamlayın:

source: Edit the ``/etc/neutron/plugins/ml2/linuxbridge_agent.ini`` file and complete the following actions:
tr_tr: ``/etc/neutron/plugins/ml2/linuxbridge_agent.ini`` dosyasını düzenle ve şu eylemleri tamamla:

source: Edit the ``/etc/neutron/plugins/ml2/ml2_conf.ini`` file and complete the following actions:
tr_tr: ``/etc/neutron/plugins/ml2/ml2_conf.ini`` dosyasını düzenleyin ve şu eylemleri tamamlayın:

source: Edit the ``/etc/nova/nova.conf`` file and add the following to it:
tr_tr: ``/etc/nova/nova.conf`` dosyasını düzenleyip şunları ekleyin:

source: Edit the ``/etc/nova/nova.conf`` file and complete the following actions:
tr_tr: ``/etc/nova/nova.conf`` dosyasını düzenleyin ve şu eylemleri tamamlayın:

source: Edit the ``/etc/nova/nova.conf`` file and perform the following actions:
tr_tr: ``/etc/nova/nova.conf`` dosyasını düzenleyin ve şu eylemleri gerçekleştirin:

source: Edit the ``/etc/openstack-dashboard/local_settings.py`` file and complete the following actions:
tr_tr: ``/etc/openstack-dashboard/local_settings.py`` dosyasını düzenleyin ve şu eylemleri tamamlayın:

source: Edit the ``/etc/openstack-dashboard/local_settings`` file and complete the following actions:
tr_tr: ``/etc/openstack-dashboard/local_settings`` dosyasını düzenleyin ve şu eylemleri tamamlayın:

source: Edit the ``/etc/sysconfig/apache2`` file and configure the ``APACHE_SERVERNAME`` option to reference the controller node:
tr_tr: ``/etc/sysconfig/apache2`` dosyasını düzenleyin ve ``APACHE_SERVERNAME`` seçeneğini kontrol düğümünü gösterecek şekilde yapılandırın:

source: Edit the ``/etc/sysconfig/memcached`` file and complete the following actions:
tr_tr: ``/etc/sysconfig/memcached`` dosyasını düzenleyin ve aşağıdaki eylemleri tamamlayın:

source: Edit the ``/etc/sysconfig/network-scripts/ifcfg-INTERFACE_NAME`` file to contain the following:
tr_tr: ``/etc/sysconfig/network-scripts/ifcfg-INTERFACE_NAME`` dosyasını aşağıdakini içerek şekilde düzenleyin:

source: Edit the ``/etc/sysconfig/network/ifcfg-INTERFACE_NAME`` file to contain the following:
tr_tr: ``/etc/sysconfig/network/ifcfg-ARAYÜZ_ADI`` dosyasını şunları içerecek şekilde düzenleyin:
