Repository: px22222/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: tr_tr

source: Your OpenStack environment now includes the dashboard. You can :ref:`launch-instance` or add more services to your environment.
tr_tr: OpenStack ortamınız artık kontrol paneline sahip. Ortamınıza daha fazla servis ekleyebilir veya :ref:`launch-instance` sunucu başlatabilirsiniz.

source: Your distribution does not enable a restrictive :term:`firewall` by default. For more information about securing your environment, refer to the `OpenStack Security Guide <https://docs.openstack.org/security-guide/>`_.
tr_tr: Dağıtımınız öntanımlı olarak kısıtlayıcı bir :term:`güvenlik duvarı` etkinleştirmiyor. Ortamınızı güvenli hale getirmekle ilgili daha fazla bilgi için `OpenStack Güvenlik Kılavuzuna <https://docs.openstack.org/security-guide/>`_ göz atın.

source: Your distribution enables a restrictive :term:`firewall` by default. During the installation process, certain steps will fail unless you alter or disable the firewall. For more information about securing your environment, refer to the `OpenStack Security Guide <https://docs.openstack.org/security-guide/>`_.
tr_tr: Dağıtımınız öntanımlı olarak kısıtlayıcı bir :term:`güvenlik duvarı` etkinleştirir. Kurulum sürecinde, güvenlik duvarını değiştirmez ya da kapatmazsanız bazı adımlar başarısız olacaktır. Ortamınızı güvenli hale getirmekle ilgili daha fazla bilgi için `OpenStack Güvenlik Kılavuzuna <https://docs.openstack.org/security-guide/>`_ göz atın.

source: Your hosts must contain the latest versions of base installation packages available for your distribution before proceeding further.
tr_tr: Daha fazla ilerlemeden makinenizin temel kurulum paketlerinin son sürümlerini içerdiğinden emin olun.

source: ``ALLOWED_HOSTS`` can also be ``['*']`` to accept all hosts. This may be useful for development work, but is potentially insecure and should not be used in production. See `Django documentation <https://docs.djangoproject.com/en/dev/ref/settings/#allowed-hosts>`_ for further information.
tr_tr: ``ALLOWED_HOSTS`` tüm istemcileri kabul etmesi için ``['*']`` olabilir. Geliştirme ortamında bu faydalı olabilir, ama üretim ortamında güvensiz olabilir ve kullanılmamalıdır. Daha fazla bilgi için `Django yapılandırmasına <https://docs.djangoproject.com/en/dev/ref/settings/#allowed-hosts>`_ göz atın.

source: ``ALLOWED_HOSTS`` can also be ``['*']`` to accept all hosts. This may be useful for development work, but is potentially insecure and should not be used in production. See the `Django documentation <https://docs.djangoproject.com/en/dev/ref/settings/#allowed-hosts>`_ for further information.
tr_tr: ``ALLOWED_HOSTS`` tüm istemcileri kabul etmesi için ``['*']`` olabilir. Bu geliştirme ortamı için faydalı olabileceği gibi, güvensizdir ve üretim ortamında kullanılmamalıdır. Daha fazla bilgi için bknz https://docs.djangoproject.com/en/dev/ref/settings/#allowed-hosts.

source: ``nova-api-metadata`` is included in the ``nova-api`` package, and can be selected through debconf.
tr_tr: ``nova-api-metadata`` ``nova-api`` paketine dahildir, ve debconf üzerinden seçilebilir.
