Repository: px22222/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: tr_tr

source: Edit the ``/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py`` file and complete the following actions:
tr_tr: ``/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py`` dosyasını düzenleyin ve şu eylemleri tamamlayın:

source: Edit the ``[libvirt]`` section in the ``/etc/nova/nova-compute.conf`` file as follows:
tr_tr: ``/etc/nova/nova-compute.conf`` dosyasında ``libvirt`` kısmını şu şekilde düzenleyin:

source: Edit the ``[libvirt]`` section in the ``/etc/nova/nova.conf`` file as follows:
tr_tr: ``/etc/nova/nova.conf`` dosyasında ``libvirt`` kısmını şu şekilde düzenleyin:

source: Efficiently polls metering data related to OpenStack services.
tr_tr: Verimli bir şekilde OpenStack servisleriyle ilgili kontroller toplar.

source: Enable support for domains:
tr_tr: Alanlar için desteği etkinleştir:

source: Enable the Identity API version 3:
tr_tr: Kimlik API'si sürüm 3'ü etkinleştir:

source: Enable the Open Build Service repositories based on your openSUSE or SLES version:
tr_tr: openSUSE veya SLES sürümünüze göre Açık İnşa Servisi depolarını etkinleştirin:

source: Enable the OpenStack repository
tr_tr: OpenStack deposunu etkinleştirin

source: Enable the backports repository
tr_tr: Backports deposunu etkinleştirin

source: Enable the placement API Apache vhost:
tr_tr: Yerleştirme API'si Apache vhost'unu etkinleştir:

source: Ensure the kernel module ``nbd`` is loaded.
tr_tr: ``nbd`` çekirdek modülünün yüklü olduğundan emin olun.

source: Ensure the module loads on every boot by adding ``nbd`` to the ``/etc/modules-load.d/nbd.conf`` file.
tr_tr: ``/etc/modules-load.d/nbd.conf`` dosyasına ``nbd`` ekleyerek modülün her açılışta yükleneceğinden emin olun.

source: Environment
tr_tr: Ortam

source: Example architecture
tr_tr: Örnek mimari

source: Exit the database access client.
tr_tr: Veritabanı erişim istemcisinden çık.

source: Explanations of configuration options and sample configuration files are included.
tr_tr: Yapılandırma seçenekleri için açıklamalar ve örnek yapılandırma dosyaları dahil edilmiştir.

source: Finalize installation
tr_tr: Kurulumu bitir

source: Finalize the installation
tr_tr: Kurulumu tamamla

source: For OpenStack services, this guide uses ``SERVICE_PASS`` to reference service account passwords and ``SERVICE_DBPASS`` to reference database passwords.
tr_tr: OpenStack servisleri için, bu kılavuz servis hesabı parolalarını göstermek için ``SERVICE_PASS``, veritabanı parolalarını göstermek için ``SERVICE_DBPASS`` kullanır.

source: For best performance, we recommend that your environment meets or exceeds the hardware requirements in :ref:`figure-hwreqs`.
tr_tr: En iyi başarım için, ortamınızın :ref:`figure-hwreqs` deki donanım gereksinimlerini karşılamasını öneriyoruz.

source: For both networking options:
tr_tr: Her iki ağ seçeneği için:

source: For details about browsers that support noVNC, see `README <https://github.com/kanaka/noVNC/blob/master/README.md>`__ and `browser support <https://github.com/kanaka/noVNC/wiki/Browser-support>`__.
tr_tr: noVNC destekleyen tarayıcılar hakkında daha fazla bilgi için, `BENİOKU <https://github.com/kanaka/noVNC/blob/master/README.md>`__ ve `tarayıcı desteğine <https://github.com/kanaka/noVNC/wiki/Browser-support>`__ göz atın.

source: For first-time installation and testing purposes, many users select to build each host as a :term:`virtual machine (VM)`. The primary benefits of VMs include the following:
tr_tr: İlk defa kurulum ve deneme amacı için, çoğu kullanıcı her sunucuyu bir :term:`sanal makine (VM)` olarak inşa etmeyi seçer. Sanal makinelerin faydalarından bazıları şunlardır:

source: For information about disk and container formats for images, see `Disk and container formats for images <https://docs.openstack.org/image-guide/image-formats.html>`__ in the ``OpenStack Virtual Machine Image Guide``.
tr_tr: İmajlar için disk ve kapsayıcı biçimleri hakkında daha fazla bilgi için, ``OpenStack Sanal Makine İmaj Kılavuzundaki`` `İmajlar için disk ve kapsayıcı biçimlerine <https://docs.openstack.org/image-guide/image-formats.html>`__ göz atın.

source: For information about the :command:`openstack image create` parameters, see `Create or update an image (glance) <https://docs.openstack.org/user-guide/common/cli-manage-images.html#create-or-update-an-image-glance>`__ in the ``OpenStack User Guide``.
tr_tr: :command:`openstack image create` parametreleriyle ilgili daha fazla bilgi için, ``OpenStack Kullanıcı Kılavuzundaki`` `Bir imaj oluştur ya da güncelleye (glance) <https://docs.openstack.org/user-guide/common/cli-manage-images.html#create-or-update-an-image-glance>`__ göz atın.

source: For more information about how to download and build images, see `OpenStack Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`__. For information about how to manage images, see the `OpenStack End User Guide <https://docs.openstack.org/user-guide/common/cli-manage-images.html>`__.
tr_tr: İmajları nasıl indirip inşa edeceğinizle ilgili daha fazla bilgi için, `OpenStack Sanal Makine İmaj Kılavuzuna <https://docs.openstack.org/image-guide/>`__ göz atın. İmajları nasıl yöneteceğinizle ilgili daha fazla bilgi için, `OpenStack Son Kullanıcı Kılavuzuna <https://docs.openstack.org/user-guide/common/cli-manage-images.html>`__ göz atın.

source: For more information about how to manage volumes, see the `Manage volumes <https://docs.openstack.org/user-guide/common/cli-manage-volumes.html>`__ in OpenStack End User Guide.
tr_tr: Birimlerin nasıl yönetileceğiyle ilgili daha fazla bilgi için, OpenStack Son Kullanıcı Kılavuzundaki `Birimlerin yönetilmesine <https://docs.openstack.org/user-guide/common/cli-manage-volumes.html>`__ göz atın.

source: For more information about system requirements, see the `OpenStack Operations Guide <https://docs.openstack.org/ops-guide/>`_.
tr_tr: Sistem gereksinimleriyle ilgili daha fazla bilgi için, `OpenStack İşlemleri Kılavuzuna <https://docs.openstack.org/ops-guide/>`_ göz atın.

source: For more information about the Networking service including virtual networking components, layout, and traffic flows, see the `OpenStack Networking Guide <https://docs.openstack.org/ocata/networking-guide/>`__.
tr_tr: Sanal ağ bileşenleri, yerleşim, ve trafik akışları da dahil olmak üzere Ağ hakkında daha fazla bilgi için, `OpenStack Ağ Kılavuzuna <https://docs.openstack.org/ocata/networking-guide/>`__ göz atın.

source: For more information on production architectures, see the `Architecture Design Guide <https://docs.openstack.org/arch-design/>`_, `OpenStack Operations Guide <https://docs.openstack.org/ops-guide/>`_, and `OpenStack Networking Guide <https://docs.openstack.org/ocata/networking-guide/>`_.
tr_tr: Üretim mimarileriyle ilgili daha fazla bilgi için, `Mimari Tasarım Kılavuzu <https://docs.openstack.org/arch-design/>`_, `OpenStack İşlem Kılavuzu <https://docs.openstack.org/ops-guide/>`_, ve `OpenStack Ağ Kılavuzuna <https://docs.openstack.org/ocata/networking-guide/>`_ göz atın.

source: For more information on registering the system, see the `Red Hat Enterprise Linux 7 System Administrator's Guide <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/System_Administrators_Guide/part-Subscription_and_Support.html>`_.
tr_tr: Sistem kaydı için daha fazla bilgi için, `Red Hat Enterprise Linux 7 Sistem Yönetici Kılavuzuna <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/System_Administrators_Guide/part-Subscription_and_Support.html>`_ göz atın.

source: For more information, see the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/block-storage/volume-drivers.html>`_.
tr_tr: Daha fazla bilgi için, `Yapılandırma Başvurusuna <https://docs.openstack.org/ocata/config-reference/block-storage/volume-drivers.html>`_ göz atın.

source: For more information, see the `Orchestration installation guide <https://docs.openstack.org/project-install-guide/orchestration/ocata/launch-instance.html>`_.
tr_tr: Daha fazla bilgi için, bknz `Orkestrasyon kurulum kılavuzu <https://docs.openstack.org/project-install-guide/orchestration/ocata/launch-instance.html>`_.

source: For more information, see the `Shared File Systems installation guide <https://docs.openstack.org/project-install-guide/shared-file-systems/ocata>`_.
tr_tr: Daha fazla bilgi için, bknz `Paylaşımlı Dosya Sistemleri kurulum kılavuzu <https://docs.openstack.org/project-install-guide/shared-file-systems/ocata>`_.

source: For networking option 2, also enable and start the layer-3 service:
tr_tr: Ağ seçeneği 2 için, katman-3 servisini de etkinleştirin ve başlatın:

source: For networking option 2, also restart the layer-3 service:
tr_tr: Ağ seçeneği 2 için, katman-3 servisini de yeniden başlatın:

source: For security reasons, disable the temporary authentication token mechanism:
tr_tr: Güvenlik sebebiyle, geçici kimlik doğrulama jeton mekanizmasını kapat:

source: For simplicity, service traffic between compute nodes and this node uses the management network. Production environments should implement a separate storage network to increase performance and security.
tr_tr: Basitlik için, hesaplama düğümleri ve bu düğüm arasındaki servis trafiği yönetim ağını kullanır. Üretim ortamları başarım ve güvenliği artırmak için ayrı bir depolama ağı kurmalıdırlar.

source: For the outside network to access VMs, and vice versa, routers between the networks are needed. Each router has one gateway that is connected to an external network and one or more interfaces connected to internal networks. Like a physical router, subnets can access machines on other subnets that are connected to the same router, and machines can access the outside network through the gateway for the router.
tr_tr: Dış ağın sanal makinelere erişimi ve tersi için, ağlar arasında yönlendiriciler gereklidir. Her yönlendiricinin harici ağa bağlı bir geçidi ve dahili ağa bağlı bir ya da daha fazla arayüzü bulunur. Fiziksel bir yönlendirici gibi, alt ağlar aynı yönlendiriciye bağlı diğer alt ağlardaki makinelere erişebilir, ve makineler yönlendirici geçidinden dış ağa erişebilir.

source: From the *compute* node, test access to the Internet:
tr_tr: *hesaplama* düğümünden, internet erişimini deneyin:

source: From the *compute* node, test access to the management interface on the *controller* node:
tr_tr: *hesaplama* düğümünden, *kontrol* düğümündeki yönetim arayüzüne erişimi deneyin:

source: From the *controller* node, test access to the Internet:
tr_tr: *kontrol* düğümünden, internet erişimini denetleyin:

source: From the *controller* node, test access to the management interface on the *compute* node:
tr_tr: *kontrol* düğümünden, *hesaplama* düğümündeki yönetim arayüzüne erişimi deneyin:

source: Generate a key pair
tr_tr: Bir anahtar çifti üret

source: Generate a key pair and add a public key:
tr_tr: Bir anahtar çifti oluşturun ve bir açık anahtar ekleyin:

source: Grant proper access to the ``keystone`` database:
tr_tr: ``keystone`` veritabanına gerekli izni verin:

source: Host networking
tr_tr: Sunucu ağ iletişimi

source: However, VMs will reduce performance of your instances, particularly if your hypervisor and/or processor lacks support for hardware acceleration of nested VMs.
tr_tr: Ancak, sanal makineler sunucularınızın başarımını düşürür, özellike hipervizör ve/veya işlemciniz içiçe sanal makinelerin donanım hızlandırmasını desteklemiyorsa.

source: IP address: 10.0.0.11
tr_tr: IP adresi: 10.0.0.11

source: IP address: 10.0.0.31
tr_tr: İP adresi :10.0.0.31

source: IP address: ``10.0.0.41``
tr_tr: IP adresi: ``10.0.0.41``

source: Identity service
tr_tr: Kimlik servisi

source: If necessary, replace ``10.0.0.0/24`` with a description of your subnet.
tr_tr: Gerekliyse, ``10.0.0.0/24`` değerini alt ağınızın tanımıyla değiştirin.

source: If the ``nova-compute`` service fails to start, check ``/var/log/nova/nova-compute.log``. The error message ``AMQP server on controller:5672 is unreachable`` likely indicates that the firewall on the controller node is preventing access to port 5672. Configure the firewall to open port 5672 on the controller node and restart ``nova-compute`` service on the compute node.
tr_tr: ``nova-compute`` servisi başlayamazsa, ``/var/log/nova/nova-compute.log`` dosyasını kontrol edin. ``controller:5672 üzerindeki AMQP sunucusuna erişilemiyor`` hata iletisi muhtemelen kontrol düğümünün 5672 bağlantı noktasına erişimi engellemesindendir. Güvenlik duvarını kontrol düğümündeki 5672 bağlantı noktasını açacak şekilde yapılandırın ve hesaplama düğümünde ``nova-compute`` servisini yeniden başlatın.

source: If the web browser to access remote consoles resides on a host that cannot resolve the ``controller`` hostname, you must replace ``controller`` with the management interface IP address of the controller node.
tr_tr: Uzak konsollara erişilecek web tarayıcı ``controller`` makine adını çözemeyen bir sunucudaysa, ``controller`` değerini kontrol düğümünün yönetim arayüzü IP adresiyle değiştirmelisiniz.

source: If this command returns a value of ``one or greater``, your compute node supports hardware acceleration which typically requires no additional configuration.
tr_tr: Bu komut ``bir ya da daha büyük`` bir değer döndürürse, hesaplama düğümünüz donanım hızlandırmayı destekliyordur, genellikle ek yapılandırmaya gerek yok demektir.

source: If this command returns a value of ``zero``, your compute node does not support hardware acceleration and you must configure ``libvirt`` to use QEMU instead of KVM.
tr_tr: Bu komut ``sıfır`` döndürürse, hesaplama düğümünüz donanım hızlandırmayı desteklemiyordur, ``libvirt``i KVM yerine QEMU kullanacak şekilde yapılandırmanız gerekir.

source: If you choose to install on VMs, make sure your hypervisor provides a way to disable MAC address filtering on the provider network interface.
tr_tr: Sanal makineler üzerine kurmayı seçerseniz, hipervizörünüzün sağlayıcı ağ arayüzünde MAC adresi süzgecini kapatmak için bir yol sağladığından emin olun.

source: If you chose networking option 1, disable support for layer-3 networking services:
tr_tr: Ağ seçeneği 1'i seçerseniz, katman-3 ağ servisleri için desteği kapatın:

source: If you chose networking option 1, you can only launch an instance on the provider network. If you chose networking option 2, you can launch an instance on the provider network and the self-service network.
tr_tr: Ağ seçeneği 1'i seçtiyseniz, yalnızca sağlayıcı ağda sunucu başlatabilirsiniz. Ağ seçeneği 2'yi seçtiyseniz, sağlayıcı ağda ve kendine servis ağında sunucu başlatabilirsiniz.

source: If you chose networking option 2, you can also create a self-service (private) network that connects to the physical network infrastructure via NAT. This network includes a DHCP server that provides IP addresses to instances. An instance on this network can automatically access external networks such as the Internet. However, access to an instance on this network from external networks such as the Internet requires a :term:`floating IP address`.
tr_tr: Ağ seçeneği 2'yi seçerseniz, fiziksel ağ alt yapısına NAT ile bağlanan bir kendine-servisli (özel) ağ oluşturabilirsiniz. Bu ağ sunuculara IP adresi sağlayan bir DHCP sunucu içerir. Bu ağdaki bir sunucu internet gibi harici ağlara otomatik olarak erişebilir. Ancak, internet gibi harici ağlardan bu ağa erişim bir :term:`değişken IP adresi` gerektirir.

source: If you chose option 1 and your environment contains only one network, you can omit the ``--nic`` option because OpenStack automatically chooses the only network available.
tr_tr: 1. seçeneği seçtiyseniz ve ortamınız tek bir ağ içeriyorsa, OpenStack kullanılabilir tek ağı seçeceğinden ``--nic`` seçeneğini kullanmayabilirsiniz.

source: If you chose option 2, the output should also contain the ``selfservice`` self-service network.
tr_tr: Seçenek 2'yi seçerseniz, çıktı ayrıca ``selfservice`` kendine servis ağını içermelidir.

source: If you prefer to use debconf, refer to the debconf install-guide for Debian.
tr_tr: Debconf kullanmayı tercih ederseniz, Debian için debconf kurulum-kılavuzuna başvurun.

source: If you want to deploy the Block Storage service, configure one additional storage node.
tr_tr: Blok Depolama servisini uygulamak istiyorsanız, ek bir depolama düğümü yapılandırın.

source: If your environment includes the Block Storage service, you can create a volume and attach it to an instance.
tr_tr: Ortamınız Blok Depolama servisi içeriyorsa, bir birim oluşturup sunucuya ekleyebilirsiniz.

source: If your environment includes the Orchestration service, you can create a stack that launches an instance.
tr_tr: Ortamınız bir Orkestrasyon servisi içeriyorsa, bir sunucu başlatan yığın oluşturabilirsiniz.

source: If your environment includes the Shared File Systems service, you can create a share and mount it in an instance.
tr_tr: Ortamınız Paylaşımlı Dosya Sistemleri servisini içeriyorsa, bir paylaşım oluşturup bir sunucuya bağlayabilirsiniz.

source: If your instance does not launch or seem to work as you expect, see the `Instance Boot Failures <https://docs.openstack.org/ops-guide/ops-maintenance-compute.html#instances>`__ section in OpenStack Operations Guide for more information or use one of the :doc:`many other options <common/app-support>` to seek assistance. We want your first installation to work!
tr_tr: Sunucunuz başlamazsa veya istediğiniz gibi çalışmıyor görünüyorsa, daha fazla bilgi için OpenStack İşlemler Kılavuzundaki `Sunucu Önyükleme Başarısızlıkları <https://docs.openstack.org/ops-guide/ops-maintenance-compute.html#instances>`__ kısmına veya :doc:`diğer seçeneklere <common/app-support>` göz atın. İlk kurulumunuzun çalışmasını istiyoruz!

source: If your storage nodes use LVM on the operating system disk, you must also add the associated device to the filter. For example, if the ``/dev/sda`` device contains the operating system:
tr_tr: Depolama düğümleriniz işletim sistemi diskinde LVM kullanıyorsa, ilgili aygıt da süzgece eklenmelidir. Örneğin, ``/dev/sda`` aygıtı işletim sistemini içeriyorsa:

source: If your web browser runs on a host that cannot resolve the ``controller`` host name, you can replace ``controller`` with the IP address of the management interface on your controller node.
tr_tr: Web tarayıcınız ``controller`` makine adını çözemeyen bir sunucuda çalışıyorsa, ``controller`` değerini kontrol düğümünüzdeki yönetim arayüzünün IP adresiyle değiştirebilirsiniz.

source: Ignore any deprecation messages in this output.
tr_tr: Bu çıktıdaki artık kullanılmıyor iletilerini göz ardı edin.

source: Ignore any warnings in this output.
tr_tr: Bu çıktıdaki uyarıları dikkat almayın.

source: Image service
tr_tr: İmaj servisi

source: Implement a deployment tool such as Ansible, Chef, Puppet, or Salt to automate deployment and management of the production environment.
tr_tr: Üretim ortamının otomatik kurulum ve yönetimi için Ansible, Chef, Puppet, veya Salt gibi bir kurulum aracı uygulayın.

source: In addition to ``rhel-7-server-rpms``, you also need to have the ``rhel-7-server-optional-rpms``, ``rhel-7-server-extras-rpms``, and ``rhel-7-server-rh-common-rpms`` repositories enabled:
tr_tr: ``rhel-7-server-rpms`` deposunun yanında ``rhel-7-server-optional-rpms``, ``rhel-7-server-extras-rpms``, ve ``rhel-7-server-rh-common-rpms`` depolarını da etkinleştirmelisiniz:

source: In addition to external networks, any Networking set up has one or more internal networks. These software-defined networks connect directly to the VMs. Only the VMs on any given internal network, or those on subnets connected through interfaces to a similar router, can access VMs connected to that network directly.
tr_tr: Harici ağlara ek olarak, Ağ kurulumlarının bir ya da daha fazla iç ağı bulunur. Bu yazılım-tanımlı ağlar sanal makinelere doğrudan bağlanır. Yalnızca verilen dahili ağdaki sanal makineler, ya da benzeri bir yönlendirici üzerinden alt ağlara bağlı arayüzleri olanlar, bu ağa doğrudan bağlı sanal makinelere erişebilirler.

source: In the Dashboard configuration section, allow your hosts to access Dashboard:
tr_tr: Kontrol paneli yapılandırma kısmında, istemcilerinizin Kontrol paneline erişimine izin verin:

source: In the ``[DEFAULT]`` and ``[keystone_authtoken]`` sections, configure Identity service access:
tr_tr: ``[DEFAULT]`` ve ``[keystone_authtoken]`` kısımlarında, Kimlik servisi erişimini yapılandırın:

source: In the ``[DEFAULT]`` and ``[nova]`` sections, configure Networking to notify Compute of network topology changes:
tr_tr: ``[DEFAULT]`` ve ``[nova]`` kısımlarında, Ağı Hesaplamaya ağ topoloji değişikliklerini iletecek şekilde yapılandırın:

source: In the ``[DEFAULT]`` section, check that the ``my_ip`` option is correctly set (this value is handled by the config and postinst scripts of the ``nova-common`` package using debconf):
tr_tr: ``[DEFAULT]`` kısmında ``my_ip`` seçeneğinin düzgün ayarlandığından emin olun (bu değer debconf kullanılarak ``nova-common`` paketinin yapılandırma kurulum sonrası betiklerinde ele alınır):

source: In the ``[DEFAULT]`` section, configure ``RabbitMQ`` message queue access:
tr_tr: ``[ÖNTANIMLI]`` kısmında, ``RabbitMQ`` ileti kuyruğu erişimini yapılandırın:

source: In the ``[DEFAULT]`` section, configure backup options:
tr_tr: ``[ÖNTANIMLI]`` kısmında, yedek seçeneklerini yapılandırın:

source: In the ``[DEFAULT]`` section, configure the Linux bridge interface driver and external network bridge:
tr_tr: ``[DEFAULT]`` kısmında, Linux köprüleme arayüzü sürücüsünü ve harici ağ köprülemeyi yapılandırın:

source: In the ``[DEFAULT]`` section, configure the Linux bridge interface driver, Dnsmasq DHCP driver, and enable isolated metadata so instances on provider networks can access metadata over the network:
tr_tr: ``[DEFAULT]`` kısmında, Linux köprüleme arayüzü sürücüsünü, Dnsmasq DHCP sürücüsünü yapılandırın ve yalıtılmış metaveriyi etkinleştirin böylece sağlayıcı ağlardaki sunucular ağ üzerinden metaveriye erişebilirler:

source: In the ``[DEFAULT]`` section, configure the ``my_ip`` option to use the management interface IP address of the controller node:
tr_tr: ``[ÖNTANIMLI]`` kısmında, ``my_ip`` seçeneğini denetim düğümünün yönetici arayüzü IP adresini kullanacak şekilde yapılandırın:

source: In the ``[DEFAULT]`` section, configure the ``my_ip`` option:
tr_tr: ``[DEFAULT]`` kısmında, ``my_ip`` seçeneğini yapılandırın:

source: In the ``[DEFAULT]`` section, configure the location of the Image service API:
tr_tr: ``[DEFAULT]`` kısmında, imaj servis API'sinin konumunu yapılandırın:

source: In the ``[DEFAULT]`` section, configure the metadata host and shared secret:
tr_tr: ``[DEFAULT]`` kısmında, metaveri sunucusunu ve paylaşılan gizi yapılandırın:

source: In the ``[DEFAULT]`` section, enable only the compute and metadata APIs:
tr_tr: ``[DEFAULT]`` kısmında, yalnızca hesaplama ve metaveri API'lerini etkinleştir:

source: In the ``[DEFAULT]`` section, enable support for the Networking service:
tr_tr: ``[DEFAULT]`` kısmında, Ağ servisi için desteği etkinleştirin:

source: In the ``[DEFAULT]`` section, enable the LVM back end:
tr_tr: ``[DEFAULT]`` kısmında, LVM arka ucunu etkinleştirin:

source: In the ``[DEFAULT]`` section, enable the Modular Layer 2 (ML2) plug-in and disable additional plug-ins:
tr_tr: ``[DEFAULT]`` kısmında, Modüler Katman 2 (ML2) eklentisini etkinleştirin ve ek eklentileri kapatın:

source: In the ``[DEFAULT]`` section, enable the Modular Layer 2 (ML2) plug-in, router service, and overlapping IP addresses:
tr_tr: ``[DEFAULT]`` kısmında, Modüler Katman 2 (ML2) eklentisini, yönlendirici servisini, ve çakışan IP adreslerini etkinleştirin:

source: In the ``[DEFAULT]`` section, set the ``compute_driver``:
tr_tr: ``[DEFAULT]`` kısmında, ``compute_driver`` ayarla:
