Repository: px22222/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: tr_tr

source: OpenStack Networking (neutron) manages all networking facets for the Virtual Networking Infrastructure (VNI) and the access layer aspects of the Physical Networking Infrastructure (PNI) in your OpenStack environment. OpenStack Networking enables projects to create advanced virtual network topologies which may include services such as a :term:`firewall`, a :term:`load balancer`, and a :term:`virtual private network (VPN)`.
tr_tr: OpenStack Ağı (neutron) OpenStack ortamınızdaki Sanal Ağ Alt Yapısı (VNI) için tüm ağ görünüşlerini ve Fiziksel Ağ Alt Yapısının (PNI) tüm erişim katmanlarını yönetir. OpenStack Ağı projelerin :term:`güvenlik duvarı`, :term:`yük dengeleyici` ve :term:`sanal özel ağ (VPN)` gibi servisler içeren gelişmiş ağ topolojileri oluşturmalarını sağlar.

source: OpenStack and supporting services require administrative privileges during installation and operation. In some cases, services perform modifications to the host that can interfere with deployment automation tools such as Ansible, Chef, and Puppet. For example, some OpenStack services add a root wrapper to ``sudo`` that can interfere with security policies. See the `OpenStack Administrator Guide <https://docs.openstack.org/ admin-guide/compute-root-wrap-reference.html>`__ for more information.
tr_tr: OpenStack ve destekleyen servisler kurulum ve çalışma sırasında yönetici ayrıcalıklarına ihtiyaç duyarlar. Bazı durumlarda, servisler sunucuda Ansible, Chef, ve Puppet gibi otomasyon araçlarıyla çakışacak değişiklikler yaparlar. Örneğin, bazı OpenStack servisleri güvenlik ilkeleriyle çakışacak şekilde ``sudo`` ya bir root sarıcı eklerler. Daha fazla bilgi için `OpenStack Yönetici Kılavuzuna <https://docs.openstack.org/ admin-guide/compute-root-wrap-reference.html>`__ göz atın.

source: OpenStack generates IDs dynamically, so you will see different values in the example command output.
tr_tr: OpenStack kimlikleri dinamik olarak oluşturur, yani örnek komut çıktısında farklı değerler göreceksiniz.

source: OpenStack packages
tr_tr: OpenStack paketleri

source: OpenStack provides an :term:`Infrastructure-as-a-Service (IaaS)` solution through a variety of complementary services. Each service offers an :term:`Application Programming Interface (API)` that facilitates this integration.
tr_tr: OpenStack çeşitli tamamlayıcı servisler aracılığıyla :term:`Servis olarak Alt Yapı (IaaS)` sağlar. Her servis bu tümleşimi kolaylaştıran :term:`Uygulama Programlama Arayüzü (API)` sağlar.

source: OpenStack services support various security methods including password, policy, and encryption. Additionally, supporting services including the database server and message broker support password security.
tr_tr: OpenStack servisleri parola, ilke, ve şifreleme de dahil bir çok güvenlik yöntemi destekler. Ek olarak, desteklenen servisler veritabanı sunucusu ve mesaj kuyruğu parola ile korunabilir.

source: OpenStack uses a :term:`message queue` to coordinate operations and status information among services. The message queue service typically runs on the controller node. OpenStack supports several message queue services including `RabbitMQ <https://www.rabbitmq.com>`__, `Qpid <https://qpid.apache.org>`__, and `ZeroMQ <http://zeromq.org>`__. However, most distributions that package OpenStack support a particular message queue service. This guide implements the RabbitMQ message queue service because most distributions support it. If you prefer to implement a different message queue service, consult the documentation associated with it.
tr_tr: OpenStack :term:`mesaj kuyruğu` kullanarak işlemleri ve servisler arasındaki durum bilgisini eşgüdümler. Mesaj kuyruğu servisi genellikle kontrol düğümünde çalışır. OpenStack `RabbitMQ <https://www.rabbitmq.com>`__, `Qpid <https://qpid.apache.org>`__, ve `ZeroMQ <http://zeromq.org>`__ dahil bir çok mesaj kuyruğu servisini destekler. Ancak, OpenStack'i paketleyen bir çok dağıtım belli bir mesaj kuyruğu servisini destekler. Bu kılavuz çoğu dağıtım onu desteklediğinden RabbitMQ mesaj kuyruğu servisini uygular. Başka bir mesaj kuyruğu servisi tercih ediyorsanız, onunla ilişkili belgelendirmeye başvurun.

source: Option 1 deploys the simplest possible architecture that only supports attaching instances to provider (external) networks. No self-service (private) networks, routers, or floating IP addresses. Only the ``admin`` or other privileged user can manage provider networks.
tr_tr: Seçenek 1 sunucuları yalnızca sağlayıcı (harici) ağa eklemeyi destekleyen en basit mimariyi kurar. Kendine servis (özel) ağlar, yönlendiriciler, veya değişken IP adresleri yoktur. Yalnızca ``admin`` veya diğeryetkili kullanıcı sağlayıcı ağları yönetebilir.

source: Option 2 also supports attaching instances to provider networks.
tr_tr: Seçenek 2 ayrıca sunucuların sağlayıcı ağlara eklenmesini destekler.

source: Option 2 augments option 1 with layer-3 services that support attaching instances to self-service networks. The ``demo`` or other unprivileged user can manage self-service networks including routers that provide connectivity between self-service and provider networks. Additionally, floating IP addresses provide connectivity to instances using self-service networks from external networks such as the Internet.
tr_tr: Seçenek 2 seçenek 1 ve sunucuları kendine servis ağlara eklemeyi destekleyen katman-3 servisleri kapsar. ``demo`` veya diğer yetkisiz kullanıcı kendine servis ve sağlayıcı ağlar arasında bağlantı sağlayan yönlendiriciler de dahil kendine servis ağlarını yönetebilir. Ek olarak, değişken IP adresleri internet gibi harici ağlardan kendine servis ağları kullanarak sunuculara bağlantı sağlarlar.

source: Optionally, configure the time zone:
tr_tr: İsteğe bağlı olarak, zaman bölgesini yapılandırın:

source: Optionally, install and configure the backup service. For simplicity, this configuration uses the Block Storage node and the Object Storage (swift) driver, thus depending on the `Object Storage service <https://docs.openstack.org/project-install-guide/object-storage/ocata/>`_.
tr_tr: İsteğe bağlı olarak, yedek servisini kurun ve yapılandırın. Basit olması için, bu yapılandırma Blok Depolama düğümü ve Nesne Depolama (swift) sürücüsünü kullanır, yani `Nesne Depolama servisine <https://docs.openstack.org/project-install-guide/object-storage/ocata/>`_ bağımlıdır.

source: Optionally, the controller node runs portions of the Block Storage, Object Storage, Orchestration, and Telemetry services.
tr_tr: İsteğe bağlı olarak, kontrol düğümü Nesne Depolama, Blok Depolama, Orkestrasyon, ve Telemetri servislerini de çalıştırır.

source: Orchestration
tr_tr: Orkestrasyon

source: Orchestration service (heat)
tr_tr: Orkestrasyon servisi (heat)

source: Other nodes
tr_tr: Diğer düğümler

source: Other nodes reference the controller node for clock synchronization. Perform these steps on all other nodes.
tr_tr: Diğer düğümler kontrol düğümüne saat eşzamanlaması için başvurur. Tüm düğümlerde bu adımları gerçekleştirin.

source: Overlay (tunnel) traffic for self-service networks traverses the management network instead of a dedicated network.
tr_tr: Kendine servis ağlar için overlay (tünel) trafiği adanmış bir ağ yerine yönetim ağından geçiyor.

source: Overview
tr_tr: Önizleme

source: Password name
tr_tr: Parola adı

source: Password of Block Storage service user ``cinder``
tr_tr: Blok Depolama servisi kullanıcısı ``cinder`` için parola

source: Password of Compute service user ``nova``
tr_tr: Hesaplama servisi kullanıcısı ``nova`` için parola

source: Password of Image service user ``glance``
tr_tr: İmaj servisi kullanıcısı ``glance`` için parola

source: Password of Networking service user ``neutron``
tr_tr: Ağ servisi kullanıcısı ``neutron`` parolası

source: Password of RabbitMQ user ``openstack``
tr_tr: RabbitMQ kullanıcısı ``openstack`` için parola

source: Password of the Placement service user ``placement``
tr_tr: Yerleştirme servisi kullanıcısı ``placement`` için parola

source: Password of user ``admin``
tr_tr: ``admin`` kullanıcısı için parola

source: Password of user ``demo``
tr_tr: ``demo`` kullanıcısının parolası

source: Perform these commands on the controller node.
tr_tr: Kontrol düğümünde şu komutları çalıştırın.

source: Perform these steps on the Block Storage node.
tr_tr: Bu adımları Blok Depolama düğümünde yapın.

source: Perform these steps on the controller node.
tr_tr: Bu adımları kontrol düğümünde uygulayın.

source: Perform these steps on the storage node.
tr_tr: Depolama düğümünde bu adımları gerçekleştirin.

source: Permit :term:`ICMP <Internet Control Message Protocol (ICMP)>` (ping):
tr_tr: :term:`ICMP <Internet Control Message Protocol (ICMP)>` (ping) ye izin ver:

source: Permit configuration, write, and read access for the ``openstack`` user:
tr_tr: ``openstack`` kullanıcısı için yapılandırma, yazma ve okuma erişimine izin verin:

source: Permit secure shell (SSH) access:
tr_tr: Güvenli kabuğa (SSH) izin ver:

source: Ping this IP address from the controller node or any host on the physical provider network:
tr_tr: Bu IP adresini kontrol düğümünden ya da fiziksel sağlayıcı ağındaki herhangi bir makineden pingleyin:

source: Populate the Block Storage database:
tr_tr: Blok Depolama veritabanını doldurun:

source: Populate the Identity service database:
tr_tr: Kimlik servisi veritabanını doldurun:

source: Populate the Image service database:
tr_tr: İmaj servisi veritabanını doldurun:

source: Populate the database:
tr_tr: Veritabanını doldurun:

source: Populate the nova database:
tr_tr: nova veritabanını doldur:

source: Populate the nova-api database:
tr_tr: nova-api veritabanını doldur:

source: Prerequisites
tr_tr: Ön gereklilikler

source: Provide users with a public IP address, a username, and a password so they can access the dashboard through a web browser. In case of any SSL certificate connection problems, point the server IP address to a domain name, and give users access.
tr_tr: Kullanıcılara bir IP adresi, kullanıcı adı, ve parola verip kontrol panelinde bir web tarayıcı aracılığıyla erişmelerini sağlayabilirsiniz. Herhangi bir SSL sertifika bağlantı problemi olursa, sunucu IP adresini bir alan adına yönlendirin, ve kullanıcı erişimi verin.

source: Provider network
tr_tr: Sağlayıcı ağı

source: Provider on 203.0.113.0/24 with gateway 203.0.113.1
tr_tr: Sağlayıcı 203.0.113.0/24 üzerinde, ağ geçidi 203.0.113.1

source: Publishes collected data to various targets including data stores and message queues.
tr_tr: Toplanan veriyi veri depoları ve ileti kuyrukları gibi çeşitli hedeflere dağıtır.

source: RHEL and CentOS enable :term:`SELinux` by default. Install the ``openstack-selinux`` package to automatically manage security policies for OpenStack services:
tr_tr: RHEL ve CentOS öntanımlı olarak :term:`SELinux` etkinleştirirler. OpenStack servisleri için güvenlik ilkelerini otomatik yönetmek için ``openstack-selinux`` paketini yükleyin:

source: Reboot the system to activate the changes.
tr_tr: Değişiklikleri etkinleştirmek için sistemi yeniden başlatın.

source: Reconfiguring network interfaces will interrupt network connectivity. We recommend using a local terminal session for these procedures.
tr_tr: Ağ arayüzlerinin yeniden yapılandırılması ağ bağlantısını keser. Bu tarz yordamlar için yerel bir terminal oturumu kullanmanızı öneriyoruz.

source: Recursively change the ownership of the ``/etc/keystone`` directory:
tr_tr: ``/etc/keystone`` dizininin sahipliğini yinelemeli olarak değiştir:

source: Register the ``cell0`` database:
tr_tr: ``cell0`` veritabanını kaydet:

source: Regular (non-admin) tasks should use an unprivileged project and user. As an example, this guide creates the ``demo`` project and user.
tr_tr: Sıradan (yönetici-olmayan) görevler yetkisizi bir proje ve kullanıcı kullanmalıdır. Örneğin, bu kılavuz ``demo`` projesi ve kullanıcısını oluşturur.

source: Reload the web server configuration:
tr_tr: Web sunucu yapılandırmasını yeniden yükleyin:

source: Replace ``ADMIN_PASS`` with a suitable password for an administrative user.
tr_tr: ``ADMIN_PASS`` anahtarını yönetici kullanıcı için uygun parolayla değiştirin.

source: Replace ``ADMIN_PASS`` with the password you chose for the ``admin`` user in the Identity service.
tr_tr: ``ADMIN_PASS`` anahtarını Kimlik servisinde ``admin`` kullanıcısı için seçtiğiniz parolayla değiştirin.

source: Replace ``CINDER_DBPASS`` with the password you chose for the Block Storage database.
tr_tr: ``CINDER_DBPASS`` değerini Blok Depolama veritabanı için seçeceğiniz parola ile değiştirin.

source: Replace ``CINDER_PASS`` with the password you chose for the ``cinder`` user in the Identity service.
tr_tr: ``CINDER_PASS``i Kimlik servisindeki ``cinder`` kullanıcısı için seçtiğiniz parola ile değiştirin.

source: Replace ``DEMO_PASS`` with the password you chose for the ``demo`` user in the Identity service.
tr_tr: ``DEMO_PASS`` anahtarını Kimlik servisinde ``demo`` kullanıcısı için seçtiğiniz parolayla değiştirin.

source: Replace ``DNS_RESOLVER`` with the IP address of a DNS resolver. In most cases, you can use one from the ``/etc/resolv.conf`` file on the host.
tr_tr: ``DNS_RESOLVER`` anahtarını bir DNS çözücünün IP adresiyle değiştirin. Çoğu durumda, sunucudaki ``/etc/resolv.conf`` dosyasından bir tane kullanabilirsiniz.

source: Replace ``GLANCE_DBPASS`` with the password you chose for the Image service database.
tr_tr: ``GLANCE_DBPASS`` anahtarını İmaj servisi veritabanı için seçtiğiniz parolayla değiştirin.

source: Replace ``GLANCE_PASS`` with the password you chose for the ``glance`` user in the Identity service.
tr_tr: ``GLANCE_PASS`` anahtarını Kimlik servisindeki ``glance`` kullanıcısı için seçtiğiniz parola ile değiştirin.

source: Replace ``INSTANCE_NAME`` with the name of the instance and ``VOLUME_NAME`` with the name of the volume you want to attach to it.
tr_tr: ``INSTANCE_NAME`` alanını sunucunun adıyla ve ``VOLUME_NAME`` anahtarını eklemek istediğiniz birimin ismiyle değiştirin.

source: Replace ``INTERFACE_NAME`` with the actual interface name. For example, *eth1* or *ens224*.
tr_tr: ``INTERFACE_NAME`` değerini arayüz ismiyle değiştirin. Örneğin, *eth1* veya *ens224*.

source: Replace ``KEYSTONE_DBPASS`` with a suitable password.
tr_tr: ``KEYSTONE_DBPASS`` anahtarını uygun parolayla değiştirin:

source: Replace ``KEYSTONE_DBPASS`` with the password you chose for the database.
tr_tr: ``KEYSTONE_DBPASS`` anahtarını veritabanı için seçtiğiniz bir parolayla değiştirin.

source: Replace ``MANAGEMENT_INTERFACE_IP_ADDRESS`` with the IP address of the management network interface on your compute node, typically 10.0.0.31 for the first node in the :ref:`example architecture <overview-example-architectures>`.
tr_tr: ``MANAGEMENT_INTERFACE_IP_ADDRESS`` anahtarını hesaplama düğümünüzdeki yönetim arayüzünün IP adresiyle değiştirin, :ref:`örnek mimaride <overview-example-architectures>` ilk düğüm için genellikle 10.0.0.31.

source: Replace ``MANAGEMENT_INTERFACE_IP_ADDRESS`` with the IP address of the management network interface on your storage node, typically 10.0.0.41 for the first node in the :ref:`example architecture <overview-example-architectures>`.
tr_tr: ``MANAGEMENT_INTERFACE_IP_ADDRESS`` değerini depolama düğümünüzdeki yönetim ağ arayüzünün IP adresi ile değiştirin, genelde :ref:`örnek mimaride <overview-example-architectures>` ilk düğüm olan 10.0.0.41 ile.

source: Replace ``METADATA_SECRET`` with a suitable secret for the metadata proxy.
tr_tr: ``METADATA_SECRET`` anahtarını metaveri vekili için uygun giz ile değiştirin.

source: Replace ``METADATA_SECRET`` with the secret you chose for the metadata proxy.
tr_tr: ``METADATA_SECRET`` anahtarını metaveri vekili için seçtiğiniz giz ile değiştirin.

source: Replace ``NEUTRON_DBPASS`` with the password you chose for the database.
tr_tr: ``NEUTRON_DBPASS`` anahtarını veritabanı olarak seçtiğiniz parolayla değiştirin.

source: Replace ``NEUTRON_PASS`` with the password you chose for the ``neutron`` user in the Identity service.
tr_tr: ``NEUTRON_PASS`` anahtarını Kimlik servisinde ``neutron`` için seçtiğiniz parolayla değiştirin.

source: Replace ``NOVA_DBPASS`` with the password you chose for the Compute databases.
tr_tr: ``NOVA_DBPASS`` alanını Hesaplama veritabanları için seçtiğiniz parolayla değiştirin.

source: Replace ``NOVA_PASS`` with the password you chose for the ``nova`` user in the Identity service.
tr_tr: ``NOVA_PASS`` aanhtarını Kimlik servisinde ``nova`` kullanıcısı için seçtiğiniz parolayla değiştirin.

source: Replace ``NTP_SERVER`` with the hostname or IP address of a suitable more accurate (lower stratum) NTP server. The configuration supports multiple ``server`` keys.
tr_tr: ``NTP_SERVER`` anahtarını uygun daha kesin (az katmanlı) NTP sunucu ile değiştirin. Yapılandırma birden fazla ``server`` anahtarlarını destekler.

source: Replace ``OVERLAY_INTERFACE_IP_ADDRESS`` with the IP address of the underlying physical network interface that handles overlay networks. The example architecture uses the management interface to tunnel traffic to the other nodes. Therefore, replace ``OVERLAY_INTERFACE_IP_ADDRESS`` with the management IP address of the compute node. See :ref:`environment-networking` for more information.
tr_tr: ``OVERLAY_INTERFACE_IP_ADDRESS`` anahtarını altta yatan overlay ağlarını ele alan fiziksel ağ arayüzünün IP adresiyle değiştirin. Örnek mimari trafiği diğer düğümlere tünellemek için yönetim arayüzünü kullanır. Yani ``OVERLAY_INTERFACE_IP_ADDRESS`` anahtarını hesaplama düğümünün yönetim IP adresiyle değiştirin. Daha fazla bilgi için bknz :ref:`environment-networking`.

source: Replace ``OVERLAY_INTERFACE_IP_ADDRESS`` with the IP address of the underlying physical network interface that handles overlay networks. The example architecture uses the management interface to tunnel traffic to the other nodes. Therefore, replace ``OVERLAY_INTERFACE_IP_ADDRESS`` with the management IP address of the controller node. See :ref:`environment-networking` for more information.
tr_tr: ``OVERLAY_INTERFACE_IP_ADDRESS`` anahtarını overlay ağları ele alan altta yatan fiziksel ağ arayüzünün IP adresiyle değiştirin. Örnek mimari diğer düğümlere trafik tünellemek için yönetim arayüzünü kullanır. Yani, ``OVERLAY_INTERFACE_IP_ADDRESS`` anahtarını kontrol düğümünün yönetim IP adresiyle değiştirmelisiniz. Daha fazla bilgi için bknz :ref:`environment-networking`.

source: Replace ``PLACEMENT_PASS`` with the password you choose for the ``placement`` user in the Identity service. Comment out any other options in the ``[placement]`` section.
tr_tr: ``PLACEMENT_PASS`` anahtarını Kimlik servisinde ``placement`` kullanıcısı için seçtiğiniz parolayla değiştirin. ``[placement]`` kısmındaki diğer seçenekleri yorum satırına alın.

source: Replace ``PROVIDER_INTERFACE_NAME`` with the name of the underlying provider physical network interface. See :ref:`environment-networking` for more information.
tr_tr: ``PROVIDER_INTERFACE_NAME`` anahtarını altta yatan sağlayıcı fiziksel ağ arayüzünün ismiyle değiştirin. Daha fazla bilgi için bknz :ref:`environment-networking`.

source: Replace ``PROVIDER_NETWORK_CIDR`` with the subnet on the provider physical network in CIDR notation.
tr_tr: ``PROVIDER_NETWORK_CIDR`` anahtarını CIDR gösteriminde sağlayıcı fiziksel ağdaki alt ağla değiştirin.

source: Replace ``PROVIDER_NETWORK_GATEWAY`` with the gateway IP address on the provider network, typically the ".1" IP address.
tr_tr: ``PROVIDER_NETWORK_GATEWAY`` anahtarını sağlayıcı ağın geçit IP adresiyle değiştirin, genellikle ".1" IP'li adrestir.

source: Replace ``PROVIDER_NET_ID`` with the ID of the ``provider`` provider network.
tr_tr: ``PROVIDER_NET_ID`` anahtarını ``provider`` sağlayıcı ağının kimliğiyle değiştir.

source: Replace ``RABBIT_PASS`` with a suitable password.
tr_tr: ``RABBIT_PASS`` değerini uygun parolayla değiştirin.

source: Replace ``RABBIT_PASS`` with the password you chose for the ``openstack`` account in RabbitMQ.
tr_tr: ``RABBIT_PASS`` anahtarını RabbitMQ'da ``openstack`` hesabı için seçtiğiniz parolayla değiştirin.

source: Replace ``RABBIT_PASS`` with the password you chose for the ``openstack`` account in ``RabbitMQ``.
tr_tr: ``RABBIT_PASS`` değerini ``RabbitMQ``da ``openstack`` hesabı için seçtiğiniz parola ile değiştirin.

source: Replace ``SELFSERVICE_NETWORK_CIDR`` with the subnet you want to use on the self-service network. You can use any arbitrary value, although we recommend a network from `RFC 1918 <https://tools.ietf.org/html/rfc1918>`_.
tr_tr: ``SELFSERVICE_NETWORK_CIDR`` alanını kendine servis ağında kullanmak istediğiniz alt ağla değiştirin. `RFC 1918 <https://tools.ietf.org/html/rfc1918>`_den bir ağ tavsiye etsek de istediğiniz değeri kullanabilirsiniz.

source: Replace ``SELFSERVICE_NETWORK_GATEWAY`` with the gateway you want to use on the self-service network, typically the ".1" IP address.
tr_tr: ``SELFSERVICE_NETWORK_GATEWAY`` anahtarını kendine servis ağında kullanmak istediğiniz ağ geçidi ile değiştirin, genellikle ".1" IP adresidir.

source: Replace ``SELFSERVICE_NET_ID`` with the ID of the ``selfservice`` network.
tr_tr: ``SELFSERVICE_NET_ID`` anahtarını ``selfservice`` ağının kimliğiyle değiştirin.

source: Replace ``START_IP_ADDRESS`` and ``END_IP_ADDRESS`` with the first and last IP address of the range within the subnet that you want to allocate for instances. This range must not include any existing active IP addresses.
tr_tr: ``START_IP_ADDRESS`` ve ``END_IP_ADDRESS`` anahtarlarını sunucular için ayırmak istediğiniz alt ağ içindeki ilk ve son IP adresiyle değiştirin. Bu aralık mevcut etkin IP adreslerinden herhangi birini içermemeli.

source: Replace ``SWIFT_URL`` with the URL of the Object Storage service. The URL can be found by showing the object-store API endpoints:
tr_tr: ``SWIFT_URL`` yi Nesne Depolama servisi URL'si ile değiştirin. URL nesne-depolama API uç noktaları gösterilerek bulunabilir:

source: Replace ``TIME_ZONE`` with an appropriate time zone identifier. For more information, see the `list of time zones <https://en.wikipedia.org/wiki/List_of_tz_database_time_zones>`__.
tr_tr: ``TIME_ZONE`` anahtarını uygun bir zaman bölgesi tanımlayıcısıyla değiştirin. Daha fazla bilgi için `zaman bölgesi listesine <https://en.wikipedia.org/wiki/List_of_tz_database_time_zones>`__ göz atın.

source: Replace the ``nova-compute-kvm`` package with ``nova-compute-qemu`` which automatically changes the ``/etc/nova/nova-compute.conf`` file and installs the necessary dependencies:
tr_tr: ``nova-compute-kvm`` peketini ``nova-compute-qemu`` ile değiştirin, bu ``/etc/nova/nova-compute.conf`` dosyasını otomatik olarak değiştirir ve gerekli bağımlılıkları yükler:

source: Request an authentication token:
tr_tr: Bir kimlik doğrulama jetonu isteyin:

source: Respond to prompts for web server configuration.
tr_tr: Web sunucu yapılandırması için soruları yanıtlayın.

source: Restart the Apache service:
tr_tr: Apache servisini yeniden başlat:

source: Restart the Block Storage backup service:
tr_tr: Blok Depolama yedek servisini yeniden başlat:

source: Restart the Block Storage services:
tr_tr: Blok Depolama servislerini yeniden başlatın:

source: Restart the Block Storage volume service including its dependencies:
tr_tr: Blok Depolama birimi servisi ve bağımlılıklarını yeniden başlatın:

source: Restart the Compute API service:
tr_tr: Hesaplama API servisini yeniden başlatın:

source: Restart the Compute service:
tr_tr: Hesaplama servisini yeniden başlatın:

source: Restart the Compute services:
tr_tr: Hesaplama servislerini yeniden başlat:

source: Restart the Image services:
tr_tr: İmaj servislerini yeniden başlatın:

source: Restart the Linux bridge agent:
tr_tr: Linux köprüleme ajanını yeniden başlat:

source: Restart the Memcached service:
tr_tr: Memcached servisini yeniden başlatın:
