Repository: px22222/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: tr_tr

source: In the ``[api]`` and ``[keystone_authtoken]`` sections, configure Identity service access:
tr_tr: ``[api]`` ve ``[keystone_authtoken]`` kısımlarında, Kimlik servisi erişimini yapılandır:

source: In the ``[api_database]`` and ``[database]`` sections, configure database access:
tr_tr: ``[api_database]`` ve ``[database]`` kısımlarında, veritabanı erişimini yapılandırın:

source: In the ``[database]`` section, comment out any ``connection`` options because compute nodes do not directly access the database.
tr_tr: ``[database]`` kısmında, ``connection`` seçeneklerini yorum satırına alın, çünkü hesaplama düğümleri veritabanına doğrudan erişmezler.

source: In the ``[database]`` section, configure database access:
tr_tr: ``[veritabanı]`` kısmında, veritabanı erişimini yapılandırın:

source: In the ``[glance]`` section, configure the location of the Image service API:
tr_tr: ``[glance]`` kısmında, İmaj servis API'sinin konumunu yapılandırın:

source: In the ``[glance_store]`` section, configure the local file system store and location of image files:
tr_tr: ``[glance_store]`` kısmında, yerel dosya sistemi deposunu ve imaj dosyalarının konumunu yapılandırın:

source: In the ``[keystone_authtoken]`` and ``[paste_deploy]`` sections, configure Identity service access:
tr_tr: ``[keystone_authtoken]`` ve ``[paste_deploy]`` kısımlarında, Kimlik servisi erişimini yapılandırın:

source: In the ``[linux_bridge]`` section, map the provider virtual network to the provider physical network interface:
tr_tr: ``[linux_bridge]`` kısmında, sağlayıcı sanal ağını sağlayıcı fiziksel ağ arayüzüne eşleştirin:

source: In the ``[lvm]`` section, configure the LVM back end with the LVM driver, ``cinder-volumes`` volume group, iSCSI protocol, and appropriate iSCSI service. If the ``[lvm]`` section does not exist, create it:
tr_tr: ``[lvm]`` kısmında, LVM arka ucunu LVM sürücüsü, ``cinder-volumes`` birim grubu, iSCSI iletişim kuralı, ve uygun iSCSI servisi ile yapılandırın. ``[lvm]`` kısmı yoksa, oluşturun:

source: In the ``[lvm]`` section, configure the LVM back end with the LVM driver, ``cinder-volumes`` volume group, iSCSI protocol, and appropriate iSCSI service:
tr_tr: ``[lvm]`` kısmında, LVM arka ucunu LVM sürücüsü, ``cinder-volumes`` birim grubu, iSCSI iletişim kuralı, ve uygun iSCSI servisi ile yapılandırın:

source: In the ``[ml2]`` section, disable self-service networks:
tr_tr: ``[ml2]`` kısmında, kendine servis ağları kapatın:

source: In the ``[ml2]`` section, enable VXLAN self-service networks:
tr_tr: ``[ml2]`` kısmında, VXLAN kendine servis ağlarını etkinleştirin:

source: In the ``[ml2]`` section, enable flat and VLAN networks:
tr_tr: ``[ml2]`` kısmında, düz ve VLAN ağları etkinleştirin:

source: In the ``[ml2]`` section, enable flat, VLAN, and VXLAN networks:
tr_tr: ``[ml2]`` kısmında, düz, VLAN, ve VXLAN ağları etkinleştirin:

source: In the ``[ml2]`` section, enable the Linux bridge and layer-2 population mechanisms:
tr_tr: ``[ml2]`` kısmında, Linux köprüleme ve katman-2 doldurma mekanizmalarını etkinleştirin:

source: In the ``[ml2]`` section, enable the Linux bridge mechanism:
tr_tr: ``[ml2]`` kısmında, Linux köprüleme mekanizmasını etkinleştirin:

source: In the ``[ml2]`` section, enable the port security extension driver:
tr_tr: ``[ml2]`` kısmında, bağlantı noktası güvenlik uzantısı sürücüsünü etkinleştirin:

source: In the ``[ml2_type_flat]`` section, configure the provider virtual network as a flat network:
tr_tr: ``[ml2_type_flat]`` kısmında, sağlayıcı sanal ağını bir düz ağ olarak yapılandırın:

source: In the ``[ml2_type_vxlan]`` section, configure the VXLAN network identifier range for self-service networks:
tr_tr: ``[ml2_type_vxlan]`` kısmında, kendine servis ağlar için VXLAN ağ tanımlama aralığını yapılandırın:

source: In the ``[neutron]`` section, configure access parameters, enable the metadata proxy, and configure the secret:
tr_tr: ``[neutron]`` kısmında, erişim parametrelerini yapılandırın, metaveri vekilini etkinleştirin, ve gizi yapılandırın:

source: In the ``[neutron]`` section, configure access parameters:
tr_tr: ``[neutron]`` kısmında, erişim parametrelerini yapılandırın:

source: In the ``[oslo_concurrency]`` section, configure the lock path:
tr_tr: ``[oslo_concurrency]`` kısmında, kilit yolunu yapılandırın:

source: In the ``[placement]`` section, configure the Placement API:
tr_tr: ``[placement]`` kısmında, Yerleştirme API'sini yapılandırın:

source: In the ``[securitygroup]`` section, enable :term:`ipset` to increase efficiency of security group rules:
tr_tr: ``[securitygroup]`` kısmında, güvenlik grubu kurallarının etkinliğini artırmak için :term:`ipset` etkinleştirin:

source: In the ``[securitygroup]`` section, enable security groups and configure the Linux bridge :term:`iptables` firewall driver:
tr_tr: ``[securitygroup]`` kısmında, güvenlik gruplarını etkinleştirin ve Linux köprüsü :term:`iptables` güvenlik duvarı sürücüsünü yapılandırın:

source: In the ``[spice]`` section, disable spice:
tr_tr: ``[spice]`` kısmında, spice'yi kapatın:

source: In the ``[token]`` section, configure the Fernet token provider:
tr_tr: ``[token]`` kısmında, Fernet jeton sağlayıcıyı yapılandırın:

source: In the ``[vnc]`` section, configure the VNC proxy to use the management interface IP address of the controller node:
tr_tr: ``[vnc]`` kısmında, VNC vekilini kontrol düğümünün yönetim arayüzünün IP adresini kullanacak şekilde yapılandırın:

source: In the ``[vnc]`` section, enable and configure remote console access:
tr_tr: ``[vnc]`` kısmında, uzak konsol erişimini etkinleştirin ve yapılandırın:

source: In the ``[vxlan]`` section, disable VXLAN overlay networks:
tr_tr: ``[vxlan]`` kısmında, VXLAN overlay ağlarını kapatın:

source: In the ``[vxlan]`` section, enable VXLAN overlay networks, configure the IP address of the physical network interface that handles overlay networks, and enable layer-2 population:
tr_tr: ``[vxlan]`` kısmında, VXLAN overlay ağlarını etkinleştirin, overlay ağlarını ele alan fiziksel ağ arayüzünün IP adresini yapılandırın, ve katman-2 doldurmayı etkinleştirin:

source: In the ``devices`` section, add a filter that accepts the ``/dev/sdb`` device and rejects all other devices:
tr_tr: ``aygıtlar`` kısmında ``/dev/sdb`` aygıtını kabul eden, anca diğer tüm aygıtları reddeden bir süzgeç ekleyin:

source: In the provider networks architecture, all instances attach directly to the provider network. In the self-service (private) networks architecture, instances can attach to a self-service or provider network. Self-service networks can reside entirely within OpenStack or provide some level of external network access using :term:`NAT <Network Address Translation (NAT)>` through the provider network.
tr_tr: Sağlayıcı ağlar mimarisinde, tüm sunucular doğrudan sağlayıcı ağa eklenir. Kendine-servis (özel) ağlar mimarisinde, sunucular kendi servislerine veya sağlayıcı ağına eklenebilir. Kendine-servis ağlar tamamen OpenStack içinde veya sağlayıcı ağ üstünden :term:`NAT <Network Address Translation (NAT)>` kullanarak harici ağ erişimi sağlayabilirler.

source: Increase security using methods such as firewalls, encryption, and service policies.
tr_tr: Güvenlik duvarları, şifreleme ve servis ilkeleri ile güvenliği artırın.

source: Initialize Fernet key repositories:
tr_tr: Fernet anahtar depolarını ilklendirin:

source: Install ``wget`` if your distribution does not include it.
tr_tr: Dağıtımınız içermiyorsa ``wget`` programını kurun.

source: Install and configure
tr_tr: Kur ve yapılandır

source: Install and configure a compute node
tr_tr: Bir hesaplama düğümü kurun ve yapılandırın

source: Install and configure a storage node
tr_tr: Bir depolama düğümü kurun ve yapılandırın

source: Install and configure components
tr_tr: Bileşenleri kur ve yapılandır

source: Install and configure compute node
tr_tr: Hesaplama düğümünü yükleyin ve yapılandırın

source: Install and configure controller node
tr_tr: Kontrol düğümünü kur ve yapılandır

source: Install and configure the Networking components on the *controller* node.
tr_tr: *Kontrol* düğümündeki Ağ bileşenlerini kur ve yapılandır.

source: Install and configure the backup service
tr_tr: Yedek servisini kur ve yapılandır

source: Install the LVM packages:
tr_tr: LVM paketlerini kurun:

source: Install the OpenStack client:
tr_tr: OpenStack istemcisini kur:

source: Install the components
tr_tr: Bileşenleri yükle

source: Install the package:
tr_tr: Paketi kur:

source: Install the packages:
tr_tr: Paketleri yükle:

source: Install the supporting utility packages:
tr_tr: Destekleyen yardımcı paketleri kurun:

source: Installation and configuration is documented in the `Application Catalog installation guide <https://docs.openstack.org/project-install-guide/application-catalog/draft/>`_.
tr_tr: Kurulum ve yapılandırma `Uygulama Kataloğu kurulum kılavuzunda <https://docs.openstack.org/project-install-guide/application-catalog/draft/>`_ belgelendirilmiştir.

source: Installation and configuration is documented in the `Bare Metal installation guide <https://docs.openstack.org/project-install-guide/baremetal/draft/>`_.
tr_tr: Kurulum ve yapılandırma `Saf Metal kurulum kılavuzunda <https://docs.openstack.org/project-install-guide/baremetal/draft/>`_ belgelendirilmiştir.

source: Installation and configuration is documented in the `Container Infrastructure Management installation guide <https://docs.openstack.org/project-install-guide/container-infrastructure-management/draft/>`_.
tr_tr: Kurulum ve yapılandırma `Kapsayıcı Altyapısı Yönetimi kurulum kılavuzunda <https://docs.openstack.org/project-install-guide/container-infrastructure-management/draft/>`_ belgelendirilmiştir.

source: Installation and configuration is documented in the `DNS installation guide <https://docs.openstack.org/project-install-guide/dns/draft/>`_.
tr_tr: Kurulum ve yapılandırma `DNS kurulum kılavuzunda <https://docs.openstack.org/project-install-guide/dns/draft/>`_ belgelendirilmiştir.

source: Installation and configuration is documented in the `Database installation guide <https://docs.openstack.org/project-install-guide/database/draft/>`_.
tr_tr: Kurulum ve yapılandırma `Veritabanı kurulum kılavuzunda <https://docs.openstack.org/project-install-guide/database/draft/>`_ belgelendirilmiştir.

source: Installation and configuration is documented in the `Key Manager installation guide <https://docs.openstack.org/project-install-guide/key-manager/draft/>`_.
tr_tr: Kurulum ve yapılandırma `Anahtar Yöneticisi kurulum kılavuzunda <https://docs.openstack.org/project-install-guide/key-manager/draft/>`_ belgelendirilmiştir.

source: Installation and configuration is documented in the `Messaging installation guide <https://docs.openstack.org/project-install-guide/messaging/draft/>`_.
tr_tr: Kurulum ve yapılandırma `Mesajlaşma kurulum kılavuzunda <https://docs.openstack.org/project-install-guide/messaging/draft/>`_ belgelendirilmiştir.

source: Installation and configuration is documented in the `Object Storage installation guide <https://docs.openstack.org/project-install-guide/object-storage/draft/>`_.
tr_tr: Kurulum ve yapılandırma `Nesne Depolama kurulum kılavuzunda <https://docs.openstack.org/project-install-guide/object-storage/draft/>`_ belgelendirilmiştir.

source: Installation and configuration is documented in the `Orchestration installation guide <https://docs.openstack.org/project-install-guide/orchestration/draft/>`_.
tr_tr: Kurulum ve yapılandırma `Orkestrasyon kurulum kılavuzunda <https://docs.openstack.org/project-install-guide/orchestration/draft/>`_ belgelendirilmiştir.

source: Installation and configuration is documented in the `Shared File Systems installation guide <https://docs.openstack.org/project-install-guide/shared-file-systems/draft/>`_.
tr_tr: Kurulum ve yapılandırma `Paylaşımlı Dosya Sistemi kurulum kılavuzunda <https://docs.openstack.org/project-install-guide/shared-file-systems/draft/>`_ belgelendirilmiştir.

source: Installation and configuration is documented in the `Telemetry Alarming installation guide <https://docs.openstack.org/project-install-guide/telemetry-alarming/draft/>`_.
tr_tr: Kurulum ve yapılandırma `Telemetri Alarm kurulum kılavuzunda <https://docs.openstack.org/project-install-guide/telemetry-alarming/draft/>`_ belgelendirilmiştir.

source: Installation and configuration is documented in the `Telemetry Data Collection installation guide <https://docs.openstack.org/project-install-guide/telemetry/draft/>`_.
tr_tr: Kurulum ve yapılandırma `Telemetri Veri Toplama kurulum kılavuzunda <https://docs.openstack.org/project-install-guide/telemetry/draft/>`_ belgelendirilmiştir.

source: Installation and configuration of additional OpenStack services is documented in separate, project-specific installation guides.
tr_tr: Ek OpenStack servislerinin kurulum ve yapılandırmaları, projeye-özel kurulum kılavuzlarında ayrıca anlatılmıştır.

source: Key Manager service (barbican)
tr_tr: Anahtar Yönetim servisi (barbican)

source: Later you can use the following command to install a package:
tr_tr: Daha sonra şu komutla bir paket yükleyebilirsiniz:

source: Launch an instance
tr_tr: Sunucu Başlat

source: Launch an instance on the provider network
tr_tr: Sağlayıcı ağında bir sunucu başlatın

source: Launch an instance on the self-service network
tr_tr: Kendin servis ağında bir sunucu başlat

source: Launch the instance
tr_tr: Sunucuyu başlat

source: Launch the instance:
tr_tr: Sunucuyu başlat:

source: List API endpoints in the Identity service to verify connectivity with the Identity service:
tr_tr: Kimlik servisinde API uç noktalarını listeleyerek Kimlik servisi ile bağlantıyı doğrula:

source: List agents to verify successful launch of the neutron agents:
tr_tr: Neutron aracılarının başarıyla başladığını onaylamak için aracıları listeleyin:

source: List available flavors:
tr_tr: Kullanılabilir nitelikleri listele:

source: List available images:
tr_tr: Kullanılabilir imajları listele:

source: List available networks:
tr_tr: Kullanılabilir ağları listele:

source: List available security groups:
tr_tr: Kullanılabilir güvenlik grupları:

source: List images in the Image service to verify connectivity with the Image service:
tr_tr: İmaj servisiyle bağlantıyı onaylamak için İmaj servisindeki imajları listeleyin:

source: List loaded extensions to verify successful launch of the ``neutron-server`` process:
tr_tr: ``neutron-server`` sürecinin başarıyla başladığından emin olmak için yüklenen eklentileri listeleyin:

source: List network namespaces. You should see one ``qrouter`` namespace and two ``qdhcp`` namespaces.
tr_tr: Ağ isim uzaylarını listele. Bir ``qrouter`` isim uzayı ve iki ``qdhcp`` isim uzayı görmelisiniz.

source: List ports on the router to determine the gateway IP address on the provider network:
tr_tr: Sağlayıcı ağ üzerindeki geçit IP adresini tanımlamak için yönlendiricideki bağlantı noktalarını listele:

source: List service components to verify successful launch and registration of each process:
tr_tr: Her sürecin başarıyla başlatılıp kaydedildiğini onaylamak için servis bileşenlerini listele:

source: List service components to verify successful launch of each process:
tr_tr: Her sürecin başarıyla başladığını doğrulamak için servis bileşenlerini listeleyin:

source: List volumes:
tr_tr: Birimleri listele:

source: Load the ``admin-openrc`` file to populate environment variables with the location of the Identity service and the ``admin`` project and user credentials:
tr_tr: Çevre değişkenlerini doldurmak için Kimlik servisi konumu ve ``admin`` proje ve kullanıcı kimlik bilgileriyle doldurmak için ``admin-openrc`` dosyasını yükleyin.

source: Management on 10.0.0.0/24 with gateway 10.0.0.1
tr_tr: Yönetici 10.0.0.0/24 üzerinde, ağ geçidi 10.0.0.1

source: Message queue
tr_tr: Mesaj kuyruğu

source: Messaging service (zaqar)
tr_tr: Mesajlaşma servisi (zaqar)

source: Most OpenStack services use an SQL database to store information. The database typically runs on the controller node. The procedures in this guide use MariaDB or MySQL depending on the distribution. OpenStack services also support other SQL databases including `PostgreSQL <https://www.postgresql.org/>`__.
tr_tr: Çoğu OpenStack servisi bilgi kaydetmek için bir SQL veritabanı kullanır. Veritabanı genellikle kontrol düğümünde çalışır. Bu kılavuzdaki yordamlar dağıtıma göre MariaDB veya MySQL kullanır. OpenStack servisleri `PostgreSQL <https://www.postgresql.org/>`__ gibi diğer SQL veritabanlarını da destekler.

source: Most cloud images support :term:`public key authentication` rather than conventional password authentication. Before launching an instance, you must add a public key to the Compute service.
tr_tr: Çoğu bulut imajı geleneksel parolayla yetkilendirme yerine :term:`açık anahtarla kimlik doğrulama` destekler. Bir sunucu başlatmadan önce, Hesaplama servisine bir anahtar eklemeniz gerekir.

source: Network Time Protocol (NTP)
tr_tr: Ağ Zaman Protokolü (NTP)

source: Network interface names vary by distribution. Traditionally, interfaces use ``eth`` followed by a sequential number. To cover all variations, this guide refers to the first interface as the interface with the lowest number and the second interface as the interface with the highest number.
tr_tr: Ağa arayüz isimleri dağıtıma göre değişir. Geleneksel olarak, arayüzler ``eth`` ardından sıra numarası gelecek şekildedir. Tüm çeşitleri kapsamak için, bu kılavuz ilk arayüze en düşük numaralı arayüz, ikinci arayüze en yüksek numaralı arayüz olarak işaret eder.

source: Network mask: 255.255.255.0 (or /24)
tr_tr: Ağ maskesi: 255.255.255.0 (veya /24)

source: Network mask: ``255.255.255.0`` (or ``/24``)
tr_tr: Ağ maskesi: ``255.255.255.0`` (veya ``/24``)

source: Networking
tr_tr: Ağ

source: Networking (neutron) concepts
tr_tr: Ağ (neutron) kavramları

source: Networking Option 1: Provider networks
tr_tr: Ağ Seçeneği 1: Sağlayıcı ağlar

source: Networking Option 2: Self-service networks
tr_tr: Ağ Seçeneği 2: Kendine servis ağları

source: Networking agents reside on the controller node instead of one or more dedicated network nodes.
tr_tr: Ağ aracıları bir ya da daha fazla adanmış ağ düğümleri üzerinde değil kontrol düğümünde çalışıyor.

source: Networking also supports *security groups*. Security groups enable administrators to define firewall rules in groups. A VM can belong to one or more security groups, and Networking applies the rules in those security groups to block or unblock ports, port ranges, or traffic types for that VM.
tr_tr: Ağ ayrıca *güvenlik gruplarını* destekler. Güvenlik grupları yöneticilerin gruplarda güvenlik duvarı kuralları tanımlamasını sağlar. Bir sanal makine bir ya da daha fazla güvenlik grubuna ait olabilir, ve Ağ bu güvenlik gruplarındaki kuralları bağlantıları engellemek ya da izin vermek için, bağlantı noktası aralıklarında, veeya trafik türüne göre uygulayabilir.

source: Networking provides networks, subnets, and routers as object abstractions. Each abstraction has functionality that mimics its physical counterpart: networks contain subnets, and routers route traffic between different subnets and networks.
tr_tr: Ağ, ağlar, alt ağlar, ve yönlendiricileri soyut nesneler olarak sağlar. Her soyutlama fiziksel çiftini taklit eden işlevselliğe sahiptir: ağlar alt ağlar içerir, yönlendiriciler farklı alt ağlar ve ağlar arasında trafik yönlendirir.

source: Networking service
tr_tr: Ağ servisi

source: Next steps
tr_tr: Sonraki adımlar

source: Non-privileged users typically cannot supply additional parameters to this command. The service automatically chooses parameters using information from the following files:
tr_tr: Yetkisiz kullanıcılar genellikle bu komuta ek parametre sağlayamazlar. Servis şu dosyalardaki bilgileri kullanarak parametreleri otomatik seçer:

source: Object Storage
tr_tr: Nesne Depolama

source: Object Storage services (swift)
tr_tr: Nesne Depolama servisleri (swift)

source: Obtain a :term:`Virtual Network Computing (VNC)` session URL for your instance and access it from a web browser:
tr_tr: Sunucunuz için bir :term:`Sanal Ağ Hesap (VNC)` oturumu URL'si elde edin ve web tarayıcıyla erişin:

source: On CentOS, the ``extras`` repository provides the RPM that enables the OpenStack repository. CentOS includes the ``extras`` repository by default, so you can simply install the package to enable the OpenStack repository.
tr_tr: CentOS'da, ``extras`` deposu OpenStack deposunu etkinleştiren RPM'i sağlar. CentOS öntanımlı olarak ``extras`` deposunu içerir, yani OpenStack deposunu etkinleştirmek için paketi kurmanız yeterlidir.

source: On RHEL, download and install the RDO repository RPM to enable the OpenStack repository.
tr_tr: RHEL'de, OpenStack deposunu etkinleştirmek için RDO depo RPM'ini indirin ve kurun.

source: On all nodes, adding the Debian 8 (Jessie) backport repository to the source list:
tr_tr: Tüm düğümlerde, Debian 8 (Jessie) backport deposu kaynak listesine ekleniyor:

source: On the controller node, source the ``admin`` credentials to gain access to admin-only CLI commands:
tr_tr: Kontrol düğümünde, salt-yönetici CLI komutları için erişimi almak için ``admin`` kimlik bilgilerini kaynak alın:

source: On the controller node, source the ``demo`` credentials to gain access to user-only CLI commands:
tr_tr: Kontrol düğümünde, salt-kullanıcı CLI komutlarına erişim elde etmek için ``demo`` kimlik bilgilerini kaynak edin:

source: One physical server can support multiple nodes, each with almost any number of network interfaces.
tr_tr: Bir fiziksel sunucu birden çok düğümü destekleyebilir, her birinin istenen sayıda ağ arayüzü olabilir.

source: Only instances can access Block Storage volumes. However, the underlying operating system manages the devices associated with the volumes. By default, the LVM volume scanning tool scans the ``/dev`` directory for block storage devices that contain volumes. If projects use LVM on their volumes, the scanning tool detects these volumes and attempts to cache them which can cause a variety of problems with both the underlying operating system and project volumes. You must reconfigure LVM to scan only the devices that contain the ``cinder-volumes`` volume group. Edit the ``/etc/lvm/lvm.conf`` file and complete the following actions:
tr_tr: Yalnızca sunucular Blok Depolama birimlerine erişebilirler. Ancak, altta yatan işletim sistemi birimlerle ilişkilendirilmiş aygıtları yönetir. Öntanımlı olarak, LVM birim tarama araçları ``/dev`` dizinini birim içeren depolama aygıtları için arar. Eğer projeler birimlerinde LVM kullanırlarsa, tarama aracı bu birimleri algılar ve önbelleklemeye çalışır, bu da hem altta yatan işletim sistemi hem de proje birimlerinde çeşitli sorunlar oluşturabilir. LVM'i yalnızca ``cinder-volumes`` birim grubunu içeren aygıtları tarayacak şekilde yeniden yapılandırmalısınız. ``/etc/lvm/lvm.conf`` dosyasını düzenleyin ve aşağıdaki eylemleri tamamlayın:

source: OpenStack Installation Tutorial for Debian
tr_tr: Debian için OpenStack Kurulum Öğreticisi

source: OpenStack Installation Tutorial for Red Hat Enterprise Linux and CentOS
tr_tr: Red Hat Enterprise Linux ve CentOS için OpenStack Kurulum Öğreticisi

source: OpenStack Installation Tutorial for Ubuntu
tr_tr: Ubuntu için OpenStack Kurulum Öğreticisi

source: OpenStack Installation Tutorial for openSUSE and SUSE Linux Enterprise
tr_tr: openSUSE ve SUSE Linux Enterprise için OpenStack Kurulum Öğreticisi
