Repository: px22222/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: tr_tr

source: The OpenStack system consists of several key services that are separately installed. These services work together depending on your cloud needs and include the Compute, Identity, Networking, Image, Block Storage, Object Storage, Telemetry, Orchestration, and Database services. You can install any of these projects separately and configure them stand-alone or as connected entities.
tr_tr: OpenStack sistemi ayrı ayrı kurulan çeşitli önemli servislerden oluşur. Bu servisler bulut ihtiyaçlarınıza göre beraber çalışır ve Hesaplama, Kimlik, Ağ, İmaj, Blok Depolama, Nesne Depolama, Telemetri Orkestrasyon, ve Veritabanı servisleridir. Bu projelerden hepsini ayrı ayrı kurabilir ve bağımsız ya da birlikte çalışan varlıklar olarak yapılandırabilirsiniz.

source: The OpenStack user can create virtual networks without the knowledge of underlying infrastructure on the data network. This can also include VLAN networks if the layer-2 plug-in is configured accordingly.
tr_tr: OpenStack kullanıcısı veri ağındaki altta yatan yapıyı bilmeden sanal ağlar oluşturabilir. Katman-2 eklentisi düzgün yapılandırıldıysa bu VLAN ağlarını da içerebilir.

source: The OpenStack user requires more information about the underlying network infrastructure to create a virtual network to exactly match the infrastructure.
tr_tr: OpenStack kullanıcısı mimariyle tamamen eşleşen bir sanal ağ oluşturmak için altta yatan ağ alt yapısıyla ilgili daha fazla bilgiye sahip olmalıdır.

source: The Orchestration service (heat) uses a `Heat Orchestration Template (HOT) <https://docs.openstack.org/developer/heat/template_guide/hot_guide.html>`_ to create and manage cloud resources.
tr_tr: Orkestrasyon servisi (heat) bir `Heat Orkestrasyon Şablonu (HOT) <https://docs.openstack.org/developer/heat/template_guide/hot_guide.html>`_ kullanarak bulut kaynaklarını oluşturur ve yönetir.

source: The Shared File Systems service (manila) provides coordinated access to shared or distributed file systems.
tr_tr: Paylaşımlı Dosya Sistemleri servisi (manila) paylaşımlı ya da dağıtık dosya sistemlerine eşgüdümlü erişim sağlar.

source: The Telemetry Alarming services trigger alarms when the collected metering or event data break the defined rules.
tr_tr: Telemetri Alarm servisleri toplanan kontrol veya olay verisi tanımlanan kuralları bozduğunda alarmlar gönderir.

source: The Telemetry Data Collection services provide the following functions:
tr_tr: Telemetri Veri Toplama servisi şu işlevleri sağlar:

source: The Training Labs scripts provide an automated way of deploying the cluster described in this Installation Guide into VirtualBox or KVM VMs. You will need a desktop computer or a laptop with at least 8 GB memory and 20 GB free storage running Linux, MaOS, or Windows. Please see the `OpenStack Training Labs <https://docs.openstack.org/training_labs/>`_.
tr_tr: Training Labs betikleri bu Kurulum Kılavuzunda tanıtılan kümenin VirtualBox veya KVM sanal makinelerine otomatik şekilde kurulumunu sağlar. Bir masaüstü veya dizüstü bilgisayara ve en az 8 GB hafıza ve 20 GB boş depolama alanına, Linux, MacOS, veya Windows işletim sistemine ihtiyacınız olacak. Bknz `OpenStack Training Labs <https://docs.openstack.org/training_labs/>`_.

source: The ``--external`` option defines the virtual network to be external. If you wish to create an internal network, you can use ``--internal`` instead. Default value is ``internal``.
tr_tr: ``--external`` seçeneği harici olacak sanal ağı tanımlar. Dahili bir ağ oluşturmak isterseniz ``--internal`` kullanabilirsiniz. Öntanımlı değer ``--internal``dir.

source: The ``--provider-physical-network provider`` and ``--provider-network-type flat`` options connect the flat virtual network to the flat (native/untagged) physical network on the ``eth1`` interface on the host using information from the following files:
tr_tr: ``--provider-physical-network provider`` ve ``--provider-network-type flat`` seçenekleri aşağıdaki satırlardaki bilgileri kullanarak ``eth1`` arayüzünde düz sanal ağı düz fiziksel ağa (yerli/etiketsiz) bağlar:

source: The ``--share`` option allows all projects to use the virtual network.
tr_tr: ``--share`` seçeneği tüm projelerin sanal ağı kullanmasına izin verir.

source: The ``admin`` or other privileged user must create this network because it connects directly to the physical network infrastructure.
tr_tr: ``admin`` veya diğer yetkili kullanıcı bu ağı oluşturmalı çünkü doğrudan fiziksel ağ alt yapısına bağlanıyor.

source: The ``demo`` or other unprivileged user can create this network because it provides connectivity to instances within the ``demo`` project only.
tr_tr: ``demo`` ya da diğer yetkisiz kullanıcı bu ağı oluşturabilir çünkü yalnızca ``demo`` projeosindeki sunuculara bağlantı sağlıyor.

source: The ``systemctl restart`` command starts each service if not currently running.
tr_tr: ``systemctl restart`` komutu çalışmıyorlarsa her servisi başlatır.

source: The automatic configuration process generates a self-signed SSL certificate. Consider obtaining an official certificate for production environments.
tr_tr: Otomatik yapılandırma süreci kendince imzalanmış SSL sertifikası üretir. Üretim ortamları için resmi bir sertifika elde etmeyi düşünün.

source: The compute node handles connectivity and :term:`security groups <security group>` for instances.
tr_tr: Hesaplama düğümü sunucular için bağlanılırlığı ve :term:`güvenlik gruplarını <security group>` ele alır.

source: The compute node runs the :term:`hypervisor` portion of Compute that operates instances. By default, Compute uses the :term:`KVM <kernel-based VM (KVM)>` hypervisor. The compute node also runs a Networking service agent that connects instances to virtual networks and provides firewalling services to instances via :term:`security groups <security group>`.
tr_tr: Hesaplama düğümü sunucuları işleten Hesaplamanın :term:`hipervizör` kısmını çalıştırır. Öntanımlı olarak, Hesaplama :term:`KVM <kernel-based VM (KVM)>` hipervizörünü kullanır. Hesaplama düğümü ayrıca sunucuları sanal ağlara bağlayan ve sunuculara :term:`güvenlik grupları <security group>` vasıtasıyla güvenlik duvarı servislerini sağlayan Ağ servisini çalıştırır.

source: The controller node requires a minimum of two network interfaces.
tr_tr: Kontrol düğümü en az iki ağ arayüzü gerektirir.

source: The controller node runs the Identity service, Image service, management portions of Compute, management portion of Networking, various Networking agents, and the Dashboard. It also includes supporting services such as an SQL database, :term:`message queue`, and :term:`NTP <Network Time Protocol (NTP)>`.
tr_tr: Kontrol düğümü Kimlik servisini, İmaj servisini, Hesaplamanın yönetim kısımlarını, Ağın yönetim kısımlarını, çeşitli Ağ aracılarını, ve Kontrol Panelini çalıştırır. Ayrıca SQL veritabanı :term:`mesaj kuyruğu`, ve :term:`NTP <Network Time Protocol (NTP)>` gibi destekleyici servisleri de içerir.

source: The example architecture requires at least two nodes (hosts) to launch a basic :term:`virtual machine <virtual machine (VM)>` or instance. Optional services such as Block Storage and Object Storage require additional nodes.
tr_tr: Örnek mimari basit bir :term:`sanal makine <virtual machine (VM)>` veya sunucu başlatmak için en az iki düğüme (sunucu) ihtiyaç duyar. Blok Depolama ve Nesne Depolama gibi isteğe bağlı servisler ek düğümler gerektirir.

source: The example architecture used in this guide is a minimum configuration, and is not intended for production system installations. It is designed to provide a minimum proof-of-concept for the purpose of learning about OpenStack. For information on creating architectures for specific use cases, or how to determine which architecture is required, see the `Architecture Design Guide <https://docs.openstack.org/arch-design/>`_.
tr_tr: Bu kılavuzda kullanılan örnek mimari asgari yapılandırmadadır, ve üretim sistemi kurulumları için hazırlanmamıştır. OpenStack öğrenmek için asgari kavram ispatı sağlamak için tasarlanmıştır. Değişik kullanım durumlarına göre mimariler oluşturmakla, veya hangi mimarinin gerektiğini tanımlamakla ilgili daha fazla bilgi için, `Mimari Tasarım Kılavuzuna <https://docs.openstack.org/arch-design/>`_ göz atın.

source: The example architectures assume use of the following networks:
tr_tr: Örnek mimariler şu ağların kullanıldığını var sayar:

source: The following instructions and diagrams use example IP address ranges. You must adjust them for your particular environment.
tr_tr: Aşağıdaki yönergeler ve çizimler örnek IP adres aralıklarını kullanır. Bunları kendi ortamınıza göre ayarlamalısınız.

source: The following minimum requirements should support a proof-of-concept environment with core services and several :term:`CirrOS` instances:
tr_tr: Aşağıdaki asgari gereksinimler temel servisler ve bir çok :term:`CirrOS` sunucu içeren kavram ispatı bir ortamı desteklemeli:

source: The following steps apply to RHEL only. CentOS does not require these steps.
tr_tr: Aşağıdaki adımlar yalnızca RHEL için geçerlidir. CentOS bu adımlara ihtiyaç duymaz.

source: The following table provides a list of services that require passwords and their associated references in the guide.
tr_tr: Aşağıdaki tablo parola gerektiren servislerin listesini ve kılavuzdaki ilişkili başvurularını sağlar.

source: The message queue runs on the controller node.
tr_tr: Mesaj kuyruğu kontrol düğümünde çalışır.

source: The only core service required by the dashboard is the Identity service. You can use the dashboard in combination with other services, such as Image service, Compute, and Networking. You can also use the dashboard in environments with stand-alone services such as Object Storage.
tr_tr: Kontrol paneli için gereken tek temel servis Kimlik servisidir. Kontrol panelini diğer servislerle birlikte kullanabilirsiniz, örneğin İmaj servisi, Hesaplama, ve Ağ. Ayrıca kontrol panelini Nesne Depolama gibi bağımsız servisleri olan ortamlarda da kullanabilirsiniz.

source: The openSUSE distribution uses the concept of patterns to represent collections of packages. If you selected 'Minimal Server Selection (Text Mode)' during the initial installation, you may be presented with a dependency conflict when you attempt to install the OpenStack packages. To avoid this, remove the minimal\_base-conflicts package:
tr_tr: openSUSE dağıtımı paket koleksiyonlarını temsil etmesi için kalıp kavramını kullanır. İlk kurulumda 'Asgari Sunucu Seçimi (Metin Kipi)' seçtiyseniz, OpenStack paketlerini kurarken bağımlılık çakışması yaşayabilirsiniz. Bunu önlemek için, minimal\_base-conflicts paketini kaldırın:

source: The optional Block Storage node contains the disks that the Block Storage and Shared File System services provision for instances.
tr_tr: İsteğe bağlı Blok Depolama düğümü Blok Depolama ve Paylaşımlı Dosya Sistemi servislerinin sunucular için hazırladığı diskleri içerir.

source: The optional Object Storage node contain the disks that the Object Storage service uses for storing accounts, containers, and objects.
tr_tr: İsteğe bağlı Nesne Depolama düğümü Nesne Depolama servisinin hesaplar, kapsayıcılar, ve nesneler için kullandığı diskleri içerir.

source: The output should indicate four agents on the controller node and one agent on each compute node.
tr_tr: Çıktı kontrol düğümünde dört aracı ve her bir hesaplama düğümünde bir aracı göstermeli.

source: The output should indicate three agents on the controller node and one agent on each compute node.
tr_tr: Çıktı kontrol düğümünde üç aracı, hesaplama düğümünde bir aracı göstermeli.

source: The packages are signed by GPG key ``D85F9316``. You should verify the fingerprint of the imported GPG key before using it.
tr_tr: Paketler ``D85F9316`` GPG anahtarıyla imzalanmıştır. Kullanmadan önce içe aktarılan GPG anahtarının parmak izini doğrulamalısınız.

source: The previous section used a combination of environment variables and command options to interact with the Identity service via the ``openstack`` client. To increase efficiency of client operations, OpenStack supports simple client environment scripts also known as OpenRC files. These scripts typically contain common options for all clients, but also support unique options. For more information, see the `OpenStack End User Guide <https://docs.openstack.org/user-guide/common/ cli_set_environment_variables_using_openstack_rc.html>`_.
tr_tr: Önceki kısım Kimlik servisiyle ``openstack`` istemcisi aracılığıyla etkileşim kurmak için ortam değişkenleri ve komut seçeneklerinin bir karışımını kullandı. İstemci işlemlerini daha etkin kullanmak için, OpenStack OpenRC dosyaları olarak da bilinen basit istemci ortam betiklerini destekler. Bu betikler genellikle tüm istemciler için genel seçenekleri içerir, ayrıca benzersiz seçenekleri de destekler. Daha fazla bilgi için bknz. `OpenStack Son Kullanıcı Kılavuzu <https://docs.openstack.org/user-guide/common/ cli_set_environment_variables_using_openstack_rc.html>`_.

source: The provider interface uses a special configuration without an IP address assigned to it. Configure the second interface as the provider interface:
tr_tr: Sağlayıcı arayüzü kendisine atanmış bir IP adresi olmadan özel bir yapılandırmayı kullanır. İkinci arayüzü sağlayıcı arayüzü olarak yapılandırın:

source: The provider network must include the ``router:external`` option to enable self-service routers to use it for connectivity to external networks such as the Internet. The ``admin`` or other privileged user must include this option during network creation or add it later. In this case, the ``router:external`` option was set by using the ``--external`` parameter when creating the ``provider`` network.
tr_tr: Sağlayıcı ağ kendine servis yönlendiricilerin internet gibi harici ağlara bağlanmak için kullanabilmeleri için ``router:external`` seçeneğini içermelidirler. ``admin`` ya da diğer yetkili kullanıcı bu seçeneği ağ oluştururken ya da daha sonra eklemelidir. Bu durumda, ``router:external`` seçeneği ``sağlayıcı`` ağ oluşturulurken ``--external`` kullanılarak ayarlanmıştı.

source: The provider network uses 203.0.113.0/24 with a gateway on 203.0.113.1. A DHCP server assigns each instance an IP address from 203.0.113.101 to 203.0.113.250. All instances use 8.8.4.4 as a DNS resolver.
tr_tr: Sağlayıcı ağ 203.0.113.1 üzerinde geçit olmak üzere 203.0.113.0/24 kullanır. Bir DHCP sunucu her bir sunucuya 203.0.113.101 den 203.0.113.250 aralığına kadar bir IP adresi atar. Tüm sunuclar DNS çözücü olarak 8.8.4.4 kullanır.

source: The provider networks option deploys the OpenStack Networking service in the simplest way possible with primarily layer-2 (bridging/switching) services and VLAN segmentation of networks. Essentially, it bridges virtual networks to physical networks and relies on physical network infrastructure for layer-3 (routing) services. Additionally, a :term:`DHCP<Dynamic Host Configuration Protocol (DHCP)>` service provides IP address information to instances.
tr_tr: Sağlayıcı ağlar seçeneği OpenStack Ağ servisini en basit yöntem olan katman-2 (köprüleme/anahtarlama) servisleri ve ağların VLAN dilimlendirilmesiyle kurar. Temelde, sanal ağları fiziksel ağlara köprüler ve katman-3 (yönlendirme) servisleri için fiziksel ağa güvenir. Ek olarak, :term:`DHCP<Dynamic Host Configuration Protocol (DHCP)>` servisi sunuculara IP adresi bilgisi sağlar.

source: The self-service network uses 172.16.1.0/24 with a gateway on 172.16.1.1. A DHCP server assigns each instance an IP address from 172.16.1.2 to 172.16.1.254. All instances use 8.8.4.4 as a DNS resolver.
tr_tr: Kendine servis ağı 172.16.1.1 ağ geçitli 172.16.1.0/24 kullanır. Bir DHCP sunucu tüm sunuculara 172.16.1.2 172.16.1.254 aralığında IP adresi atar. Tüm sunucular DNS çözmek için 8.8.4.4 adresini kullanır.

source: The self-service networks option augments the provider networks option with layer-3 (routing) services that enable :term:`self-service` networks using overlay segmentation methods such as :term:`VXLAN <Virtual Extensible LAN (VXLAN)>`. Essentially, it routes virtual networks to physical networks using :term:`NAT<Network Address Translation (NAT)>`. Additionally, this option provides the foundation for advanced services such as LBaaS and FWaaS.
tr_tr: Kendine servis ağları seçeneği, sağlayıcı ağ seçeneğini katman-3 (yönlendirme) servisleriyle harmanlayarak :term:`VXLAN <Virtual Extensible LAN (VXLAN)>` gibi overlay dilimlendirme yöntemleri kullanarak :term:`kendine servis` ağları etkinleştirir.

source: The server component listens on all IP addresses and the proxy component only listens on the management interface IP address of the compute node. The base URL indicates the location where you can use a web browser to access remote consoles of instances on this compute node.
tr_tr: Sunucu bileşeni tüm IP adreslerinden dinleme yapar ve vekil bileşeni yalnızca hesaplama düğümünün yönetim arayüzünün IP adresinden dinleme yapar. Taban URL bu hesaplama düğümünde bir web tarayıcı kullanarak sunucuların uzak konsollarına erişeceğiniz konumu gösterir.

source: The service provisions logical volumes on this device using the :term:`LVM <Logical Volume Manager (LVM)>` driver and provides them to instances via :term:`iSCSI <iSCSI Qualified Name (IQN)>` transport. You can follow these instructions with minor modifications to horizontally scale your environment with additional storage nodes.
tr_tr: Servis bu aygıttaki mantıksal birimleri :term:`LVM <Logical Volume Manager (LVM)>` sürücüsü ile hazırlar ve sunuculara :term:`iSCSI <iSCSI Qualified Name (IQN)>` aktarımıyla sağlar. Ortamınızı ek depolama düğümleriyle ölçeklendirmek için bu yönergeleri küçük değişikliklerle takip edebilirsiniz.

source: The set up of OpenStack packages described here needs to be done on all nodes: controller, compute, and Block Storage nodes.
tr_tr: Burda tarif edilen OpenStack paketleri kurulumları tüm düğümlerde yapılmalıdır: kontrol, hesaplama, ve Blok Depolama düğümlerinde.

source: The smallest default flavor consumes 512 MB memory per instance. For environments with compute nodes containing less than 4 GB memory, we recommend creating the ``m1.nano`` flavor that only requires 64 MB per instance. Only use this flavor with the CirrOS image for testing purposes.
tr_tr: Varsayılan en küçük nitelik sunucu başına 512 MB hafıza tüketir. 4 GB hafızadan daha azını içeren hesaplama düğümlerine sahip ortamlar için, sunucu başına yalnızca 64 MB gerektiren ``m1.nano`` niteliği oluşturmanızı öneriyoruz. Bu niteliği yalnızca CirrOS imajıyla deneme amaçlı kullanın.

source: The status changes from ``BUILD`` to ``ACTIVE`` when the build process successfully completes.
tr_tr: İnşa süreci başarıyla tamamlandığında durum ``İNŞA`` dan ``ETKİN`` e değişir.

source: There are two modes of installation. One using ``/horizon`` as the URL, keeping your default vhost and only adding an Alias directive: this is the default. The other mode will remove the default Apache vhost and install the dashboard on the webroot. It was the only available option before the Liberty release. If you prefer to set the Apache configuration manually, install the ``openstack-dashboard`` package instead of ``openstack-dashboard-apache``.
tr_tr: Kurulumun iki kipi vardır. Biri URL olarak``/horizon`` kullanır, öntanımlı vhost'unuzu korur ve yalnızca Alias yönergesi ekler: bu öntanımlıdır. Diğer kip öntanımlı Apache vhost'unu kaldırır ve kontrol panelini web köküne kurar. Liberty dağıtımından önce bu tek seçenekti. Apache yapılandırmasını elle yapmak isterseniz, ``openstack-dashboard-apache`` paketi yerine ``openstack-dashboard`` paketini kurun.

source: This chapter explains how to install and configure the Networking service (neutron) using the :ref:`provider networks <network1>` or :ref:`self-service networks <network2>` option.
tr_tr: Bu bölüm :ref:`sağlayıcı ağlar <network1>` veya :ref:`kendine servis ağlar <network2>` kullanarak Ağ servisini (neutron) nasıl kurup yapılandırabileceğinizi açıklar.

source: This command provides no output.
tr_tr: Bu komut çıktı sağlamıyor.

source: This command uses the password for the ``admin`` user.
tr_tr: Bu komut ``admin`` kullanıcısı için parolayı kullanır.

source: This command uses the password for the ``demo`` user and API port 5000 which only allows regular (non-admin) access to the Identity service API.
tr_tr: Bu komut ``demo`` kullanıcısı için olan parolayı ve Kimlik servis API'sine yalnızca sıradan (yönetici-olmayan) erişime izin veren API bağlantı noktası 5000 'i kullanır.

source: This example architecture differs from a minimal production architecture as follows:
tr_tr: Bu örnek mimari asgari bir üretim mimarisinden şu şekilde ayrılıyor:

source: This example deployment uses an Apache web server.
tr_tr: Bu örnek kurulum Apache web sunucu kullanır.

source: This guide covers step-by-step deployment of the major OpenStack services using a functional example architecture suitable for new users of OpenStack with sufficient Linux experience. This guide is not intended to be used for production system installations, but to create a minimum proof-of-concept for the purpose of learning about OpenStack.
tr_tr: Bu kılavuz işlevsel örnek bir mimari kullanarak temel OpenStack servislerinin adım adım kurulumunu yeterli Linux deneyimine sahip yeni OpenStack kullanıcıları için uygun şekilde kapsar. Bu kılavuz üretim sistemi kurulumlarında kullanılmak üzere değil, OpenStack öğrenmek için asgari kavram ispatı amacıyla hazırlanmıştır.

source: This guide documents the OpenStack Ocata release.
tr_tr: Bu kılavuz OpenStack Ocata dağıtımını belgeler.

source: This guide includes host entries for optional services in order to reduce complexity should you choose to deploy them.
tr_tr: Bu kılavuz eğer kurmaya karar verirseniz karmaşıklığı azaltması için isteğe bağlı servisler için sunucu girdileri içerir.

source: This guide is a work-in-progress and is subject to updates frequently. Pre-release packages have been used for testing, and some instructions may not work with final versions. Please help us make this guide better by reporting any errors you encounter.
tr_tr: Bu kılavuzun üzerinde hala çalışılıyor ve sıklıkla değişebilir. Dağıtım öncesi paketler deneme amaçlı kullanılmıştır, ve bazı yönergeler son sürümlerde çalışmayabilir. Lütfen karşılaştığınız hataları raporlayarak bu kılavuzu daha iyi hale getirmemize yardımcı olun.

source: This guide uses a service project that contains a unique user for each service that you add to your environment. Create the ``service`` project:
tr_tr: Bu kılavuz ortamınıza eklediğiniz her servis için benzersiz bir kullanıcı içeren bir servis projesi kullanır. ``servis`` projesini oluşturun:

source: This guide uses installation with debconf set to non-interactive mode. That is, there will be no debconf prompt. To configure a computer to use this mode, run the following command:
tr_tr: Bu kılavuz debconf etkileşimsiz kipte olarak kurulum yapar. Anlamı, debconf sorgularının olmayacağıdır. Bir bilgisayarı bu kipte yapılandırmak için, şu komutu çalıştırın:

source: This guide uses the Apache HTTP server with ``mod_wsgi`` to serve Identity service requests on ports 5000 and 35357. By default, the keystone service still listens on these ports. The package handles all of the Apache configuration for you (including the activation of the ``mod_wsgi`` apache2 module and keystone configuration in Apache).
tr_tr: Bu kılavuz Kimlik servis isteklerini 5000 ve 35357 bağlantı noktalarından sunması için ``mod_wsgi`` ile Apache HTTP sunucu kullanır. Öntanımlı olarak, keystone servisi hala bu bağlantı noktalarından dinleme yapar. Paket tüm Apache yapılandırmasını sizin için ele alır (``mod_wsgi`` Apachebirimi ve Apache'deki keystone yapılandırması dahil).
