Repository: px22222/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: tr_tr

source: This guide uses the Apache HTTP server with ``mod_wsgi`` to serve Identity service requests on ports 5000 and 35357. By default, the keystone service still listens on these ports. Therefore, this guide manually disables the keystone service.
tr_tr: Bu kılavuz Kimlik servis isteklerini 5000 ve 35357 bağlantı noktalarından sunması için ``mod_wsgi`` ile Apache HTTP sunucu kullanır. Öntanımlı olarak, keystone servisi hala bu bağlantı noktalarından dinleme yapar. Dolayısıyla, bu kılavuz elle keystone servisini kapatır.

source: This guide walks through an installation by using packages available through Debian 8 (code name: Jessie).
tr_tr: Bu kılavuz Debian 8 (kod adı: Jessie) üzerinde kullanılabilir paketlerle yapılan bir kurulumu gösterir.

source: This guide will show you how to install OpenStack by using packages available on Red Hat Enterprise Linux 7 and its derivatives through the RDO repository.
tr_tr: Bu kılavuz Red Hat Enterprise Linux 7 ve ondan türeyen dağıtımlar üzerinde RDO deposu aracılığıyla mevcut paketleri kullanarak nasıl OpenStack kuracağınızı gösterir.

source: This guide will show you how to install OpenStack by using packages on openSUSE Leap 42.2 and SUSE Linux Enterprise Server 12 - for both SP1 and SP2 - through the Open Build Service Cloud repository.
tr_tr: Bu kılavuz openSUSE Leap 42.2 ve SUSE Linux Enterprise Sunucu 12 üzerinde - hem SP1 hem SP2 için Açık İnşa Servisi Bulut deposu aracılığıyla OpenStack'i nasıl kuracağınızı gösterir.

source: This guide will walk through an installation by using packages available through Canonical's Ubuntu Cloud archive repository for Ubuntu 16.04 (LTS).
tr_tr: Bu kılavuz Ubuntu 16.05 (LTS) için Canonical'in Ubuntu Bulut arşivi deposundaki paketlerini kullanarak yapılan bir kurulumu gösterecek.

source: This instance uses the ``cirros`` image.
tr_tr: Bu sunucu ``cirros`` imajı kullanır.

source: This instance uses the ``default`` security group.
tr_tr: Sunucu ``default`` güvenlik grubunu kullanıyor.

source: This instance uses the ``provider`` provider network. However, you must reference this network using the ID instead of the name.
tr_tr: Bu sunucu ``provider`` sağlayıcı ağını kullanır. Ancak, bu ağa ismi yerine kimliğini kullanarak başvurmalısınız.

source: This instance uses the ``selfservice`` self-service network. However, you must reference this network using the ID instead of the name.
tr_tr: Bu sunucu ``serlfservice`` kendine servis ağını kullanır. Ancak, bu ağa ismi yerine kimliğiyle başvurmalısınız.

source: This network requires a gateway to provide Internet access to all nodes for administrative purposes such as package installation, security updates, :term:`DNS <Domain Name System (DNS)>`, and :term:`NTP <Network Time Protocol (NTP)>`.
tr_tr: Bu ağ, paket yönetimi, güvenlik güncellemeleri, :term:`DNS <Domain Name System (DNS)>`, ve :term:`NTP <Network Time Protocol (NTP)>` gibi yönetim işleri için tüm düğümlere internet erişimi sağlayan bir geçide ihtiyaç duyar.

source: This network requires a gateway to provide Internet access to instances in your OpenStack environment.
tr_tr: Bu ağ OpenStack ortamınızdaki sunuculara internet erişimi sağlamak için bir ağ geçidine ihtiyaç duyar.

source: This option lacks support for self-service (private) networks, layer-3 (routing) services, and advanced services such as :term:`LBaaS <Load-Balancer-as-a-Service (LBaaS)>` and :term:`FWaaS<FireWall-as-a-Service (FWaaS)>`. Consider the self-service networks option below if you desire these features.
tr_tr: Bu seçenek kendine servis (özel) ağları, katman-3 (yönlendirme) servislerini, ve :term:`LBaaS <Load-Balancer-as-a-Service (LBaaS)>` ve :term:`FWaaS<FireWall-as-a-Service (FWaaS)>` gibi gelişmiş servisleri desteklemez. Bu özellikleri istiyorsanız aşağıdaki kendine servis ağlarını dikkate alın.

source: This output should indicate three service components enabled on the controller node and one service component enabled on the compute node.
tr_tr: Bu çıktı kontrol düğümünde etkin üç servis bileşeni ve hesaplama düğümünde etkin bir servis bileşeni gösteriyor olmalı.

source: This section assumes proper installation, configuration, and operation of the Identity service using the Apache HTTP server and Memcached service as described in the :ref:`Install and configure the Identity service <keystone-install>` section.
tr_tr: Bu kısım :ref:`Kimlik servisinin kurulumu ve yapılandırması <keystone-install>` kısmında tanımlandığı gibi Kimlik servisinin Apache HTTP sunucu ve Memcached servisi kullanılarak düzgün kurulmuş, yapılandırılmış ve işliyor olduğunu var sayar.

source: This section assumes that you are following the instructions in this guide step-by-step to configure the first compute node. If you want to configure additional compute nodes, prepare them in a similar fashion to the first compute node in the :ref:`example architectures <overview-example-architectures>` section. Each additional compute node requires a unique IP address.
tr_tr: Bu kısım ilk hesaplama düğümünüzü yapılandırmak için bu kılavuzdaki yönergeleri adım adım takip ettiğinizi varsayar. Ek hesaplama düğümleri yapılandırmak isterseniz, :ref:`örnek mimariler <overview-example-architectures>` kısmındaki ilk hesaplama düğümüne benzer şekilde hazırlayın. Her ek hesaplama düğümü benzersiz bir IP adresi gerektirir.

source: This section creates the necessary virtual networks to support launching instances. Networking option 1 includes one provider (external) network with one instance that uses it. Networking option 2 includes one provider network with one instance that uses it and one self-service (private) network with one instance that uses it. The instructions in this section use command-line interface (CLI) tools on the controller node. However, you can follow the instructions on any host that the tools are installed. For more information on the CLI tools, see the `OpenStack End User Guide <https://docs.openstack.org/user-guide/cli-launch-instances.html>`__. To use the dashboard, see the `OpenStack End User Guide <https://docs.openstack.org/user-guide/dashboard.html>`__.
tr_tr: Bu kısım sunucu başlatmayı desteklemek için gerekli sanal ağları oluşturur. Ağ seçeneği 1 kendisini kullanan bir sunucuyla bir sağlayıcı (harici) ağ içerir. Ağ seçeneği 2 kendisini kullanan bir sunucuyla bir sağlayıcı ağ ve kendisini kullanan bir sunucuyla bir kendine servis (özel) ağ oluşturur. Bu kısımdaki yönergeler kontrol düğümünde komut satırı arayüzü (CLI) kullanır. Ancak yönergeleri araçların kurulu olduğu herhangi bir sunucuda takip edebilirsiniz. CLI araçları hakkında daha fazla bilgi için, bknz `OpenStack Son Kullanıcı Kılavuzu <https://docs.openstack.org/user-guide/cli-launch-instances.html>`__. Kontrol panelini kullanmak için, bknz `OpenStack Son Kullanıcı Kılavuzu <https://docs.openstack.org/user-guide/dashboard.html>`__.

source: This section describes how to install and configure storage nodes for the Block Storage service. For simplicity, this configuration references one storage node with an empty local block storage device. The instructions use ``/dev/sdb``, but you can substitute a different value for your particular node.
tr_tr: Bu kısım Blok Depolama servisi için depolama düğümlerinin nasıl kurulup yapılandırılacağını anlatır. Basitlik için, bu yapılandırma boş yerel blok depolama aygıtına sahip bir depolama düğümüne referans verir. Yönergelerde ``/dev/sdb`` olarak geçiyor, ama düğümünüz için değişik bir değer ile değiştirebilirsiniz.

source: This section describes how to install and configure the Block Storage service, code-named cinder, on the controller node. This service requires at least one additional storage node that provides volumes to instances.
tr_tr: Bu kısım cinder kod adlı Blok Depolama servisini kontrol düğümünde nasıl kurup yapılandıracağınızı anlatır. Bu servis sunuculara birim sağlayan en az bir ek depolama düğümü gerektirir.

source: This section describes how to install and configure the Compute service on a compute node. The service supports several :term:`hypervisors <hypervisor>` to deploy :term:`instances <instance>` or :term:`VMs <virtual machine (VM)>`. For simplicity, this configuration uses the :term:`QEMU <Quick EMUlator (QEMU)>` hypervisor with the :term:`KVM <kernel-based VM (KVM)>` extension on compute nodes that support hardware acceleration for virtual machines. On legacy hardware, this configuration uses the generic QEMU hypervisor. You can follow these instructions with minor modifications to horizontally scale your environment with additional compute nodes.
tr_tr: Bu bölüm bir hesaplama düğümüne Hesaplama servisini nasıl kurup yapılandıracağınızı anlatır. Servis :term:`sunucular <instance>` ya da :term:`sanal makineler <virtual machine (VM)>` kurmak için çeşitli :term:`hipervizörler <hypervisor>` destekler. Basit olması için, bu yapılandırma sanal makineler için donanım hızlandırmaya sahip hesaplama düğümlerinde :term:`KVM <kernel-based VM (KVM)>` eklentisine sahip :term:`QEMU <Quick EMUlator (QEMU)>` hipervizörünü kullanır. Eski donanumda, bu yapılandırma genel QEMU hipervizörünü kullanır. Bu yönergeleri küçük değişikliklerle takip ederek ortamınızı ek hesaplama düğümleriyle yatay ölçeklendirebilirsiniz.

source: This section describes how to install and configure the Compute service, code-named nova, on the controller node.
tr_tr: Bu kısım kod adı nova olan Hesaplama servisini kontrol düğümünde nasıl kurup yapılandıracağınızı tanımlar.

source: This section describes how to install and configure the Image service, code-named glance, on the controller node. For simplicity, this configuration stores images on the local file system.
tr_tr: Bu kısım kod adı glance olan İmaj servisinin kontrol düğümünde nasıl kurulup yapılandırılacağını tanımlar. Basitlik için, bu yapılandırma imajları yerel dosya sisteminde depolar.

source: This section describes how to install and configure the OpenStack Identity service, code-named keystone, on the controller node. For scalability purposes, this configuration deploys Fernet tokens and the Apache HTTP server to handle requests.
tr_tr: Bu kısım kod-adı keystone olan OpenStack kimlik servisinin kontrol düğümünde kurulup yapılandırılmasını tanımlar. Ölçeklenebilir olması için, bu yapılandırma istekleri ele alması için Fernet jetonları ve Apache HTTP sunucu kurar.

source: This section describes how to install and configure the dashboard on the controller node.
tr_tr: Bu kısım kontrol panelini kontrol düğümünde nasıl kurup yapılandıracağınızı tanımlar.

source: This section explains how to configure the controller node and one compute node using the example architecture.
tr_tr: Bu kısım örnek mimari kullanarak kontrol düğümünü ve bir hesaplama düğümünü nasıl yapılandıracağınızı açıklar.

source: This service requires two nodes. Each node requires a minimum of one network interface. You can deploy more than two object storage nodes.
tr_tr: Bu servis iki düğüm gerektiriyor. Her düğüm en az bir ağ arayüzü gerektirir. İkiden fazla nesne depolama düğümü kurabilirsiniz.

source: To create the database, complete these steps:
tr_tr: Veritabanı oluşturmak için aşağıdaki adımları tamamlayın:

source: To create the databases, complete these steps:
tr_tr: Veritabanlarını oluşturmak için, şu adımları tamamlayın:

source: To create the service credentials, complete these steps:
tr_tr: Servis kimlik bilgilerini oluşturmak için, şu adımları tamamlayın:

source: To ease the installation process, this guide only covers password security where applicable. You can create secure passwords manually, but the database connection string in services configuration file cannot accept special characters like "@". We recommend you generate them using a tool such as `pwgen <https://sourceforge.net/projects/pwgen/>`_, or by running the following command:
tr_tr: Kurulum sürecini kolaylaştırmak için, bu kılavuz parola güvenliğini uygulanabilir yerlerde ele alır. Güvenli parolaları elle oluşturabilirsiniz, ama servis yapılandırmasındaki veritabanı bağlantı satırı "@" gibi özel karakterler alamaz. Bunları `pwgen <https://sourceforge.net/projects/pwgen/>`_ gibi özel araçlarla, ya da aşağıdaki komutu çalıştırarak üretmenizi tavsiye ederiz:

source: To enable other nodes to connect to the chrony daemon on the controller node, add this key to the ``/etc/chrony.conf`` file:
tr_tr: Diğer düğümlerin kontrol düğümündeki chrony servisine bağlanabilmesi için, ``/etc/chrony.conf`` dosyasına bu anahtarı ekleyin:

source: To enable other nodes to connect to the chrony daemon on the controller node, add this key to the ``/etc/chrony/chrony.conf`` file:
tr_tr: Diğer düğümlerin kontrol düğümündeki chrony servisine bağlanmasını etkinleştirmek için ``/etc/chrony/chrony.conf`` dosyasına şu anahtarı ekleyin:

source: To launch an instance, you must at least specify the flavor, image name, network, security group, key, and instance name.
tr_tr: Bir sunucu başlatmak için, en azından nitelik, imaj ismi, ağ, güvenlik grubu, anahtar, ve sunucu ismi belirtmelisiniz.

source: To minimize clutter and provide more resources for OpenStack, we recommend a minimal installation of your Linux distribution. Also, you must install a 64-bit version of your distribution on each node.
tr_tr: OpenStack için daha fazla kaynak ayırma ve dağınıklığı en aza indirmek için, Linux dağıtımınızın asgari kurulumunu öneriyoruz. Ayrıca her düğümde dağıtımınızın 64-bit sürümünü kurmalısınız.

source: To run clients as a specific project and user, you can simply load the associated client environment script prior to running them. For example:
tr_tr: İstemcileri belirli bir proje ve kullanıcı olarak çalıştırmak için, çalıştırmadan önce basitçe ilişkili istemci ortam betiklerini yükleyebilirsiniz. Örneğin:

source: To use the VNC client with the dashboard, the browser must support HTML5 Canvas and HTML5 WebSockets.
tr_tr: Kontrol paneliyle VNC istemcisini kullanmak için, tarayıcı HTML5 Canvas ve HTML5 WebSockets desteklemelidir.

source: Unless you intend to use the exact configuration provided in this example architecture, you must modify the networks in this procedure to match your environment. Each node must resolve the other nodes by name in addition to IP address. For example, the ``controller`` name must resolve to ``10.0.0.11``, the IP address of the management interface on the controller node.
tr_tr: Bu örnek mimaride kullanılan yapılandırmayı olduğu gibi kullanmayı planlamıyorsanız, bu yordamlardaki ağları kendi ortamınıza uyacak şekilde değiştirmelisiniz. Her düğüm diğer düğümleri isimle ve IP adresiyle çözebilmelidir. Örneğin, ``controller`` ismi ``10.0.0.11`` adresine çözülmelidir, kontrol düğümündeki yönetim arayüzünün IP adresine.

source: Unset the temporary ``OS_AUTH_URL`` and ``OS_PASSWORD`` environment variable:
tr_tr: Geçici ``OS_AUTH_URL`` ve ``OS_PASSWORD`` çevre değişkenlerini kaldırın:

source: Upgrade the packages on all nodes:
tr_tr: Tüm düğümlerdeki paketleri yükselt:

source: Upload the image to the Image service using the :term:`QCOW2 <QEMU Copy On Write 2 (QCOW2)>` disk format, :term:`bare` container format, and public visibility so all projects can access it:
tr_tr: İmajı İmaj servisine :term:`QCOW2 <QEMU Copy On Write 2 (QCOW2)>` disk biçimini, :term:`saf` kapsayıcı biçiminde ve tüm projelerin görebilmesi için açık görünürlükte yükleyin:

source: Use the database access client to connect to the database server as the ``root`` user:
tr_tr: Veritabanı sunucusuna ``root`` kullanıcısı ile bağlanmak için veritabanı erişim istemcisini kullanın:

source: Use the verification section for the networking option that you chose to deploy.
tr_tr: Kurmayı seçtiğiniz ağ seçeneği için doğrulama kısmını kullanın.

source: Using the scripts
tr_tr: Betikleri kullanarak

source: Verify access to the internet:
tr_tr: İnternet erişimini doğrula:

source: Verify access to the provider physical network gateway:
tr_tr: Sağlayıcı fiziksel ağ geçidine erişimi doğrula:

source: Verify access to the self-service network gateway:
tr_tr: Kendine servis ağ geçidine erişimi onaylayın:

source: Verify addition of the key pair:
tr_tr: Anahtar çiftinin eklenmesini doğrulayın:

source: Verify connectivity
tr_tr: Bağlantıyı doğrulayın

source: Verify connectivity to the instance from the controller node or any host on the provider physical network:
tr_tr: Kontrol düğümünden ya da sağlayıcı fiziksel ağındaki herhangi bir istemciden sunucuya bağlantıyı onayla:

source: Verify connectivity to the instance via floating IP address from the controller node or any host on the provider physical network:
tr_tr: Sunucuya kontrol düğümünden ya da sağlayıcı fiziksel ağındaki herhangi bir istemciden değişken IP adresi aracılığıyla bağlantıyı doğrulayın:

source: Verify nova cell0 and cell1 are registered correctly:
tr_tr: Nova cell0 ve cell1'in düzgün kaydolduğunu onayla:

source: Verify operation
tr_tr: İşlemi onayla

source: Verify operation of the Block Storage service.
tr_tr: Blok Depolama servisinin işleyişini onaylayın.

source: Verify operation of the Compute service.
tr_tr: Hesaplama servisinin işleyişini onayla.

source: Verify operation of the Identity service before installing other services.
tr_tr: Diğer servisleri yüklemeden önce Kimlik servisinin işleyişini onaylayın.

source: Verify operation of the Image service using `CirrOS <http://launchpad.net/cirros>`__, a small Linux image that helps you test your OpenStack deployment.
tr_tr: İmaj servisinin işleyişini OpenStack kurulumunuzu test etmenizde yardımcı olan küçük bir Linux imajı `CirrOS <http://launchpad.net/cirros>`__ kullanarak onaylayın.

source: Verify operation of the dashboard.
tr_tr: Kontrol panelin işlerliğini onaylayın.

source: We recommend disabling EPEL when using RDO packages due to updates in EPEL breaking backwards compatibility. Or, preferably pin package versions using the ``yum-versionlock`` plugin.
tr_tr: RDO paketlerini kullanırken EPEL'i kapatmanızı öneriyoruz, çünkü EPEL güncellemeleri geriye dönük uyumluluğu kırabiliyor. Ya da isteğe bağlı olarak paket sürümlerini ``yum-versionlock`` eklentisi ile sabitleyebilirsiniz.

source: We recommend that you verify NTP synchronization before proceeding further. Some nodes, particularly those that reference the controller node, can take several minutes to synchronize.
tr_tr: Daha fazla ilerlemeden NTP eşzamanlamasını doğrulamanızı öneririz. Bazı düğümler, özellik kontrol düğümüne başvuranlar, eşzamanlama için dakikalarca bekleyebilirler.

source: We recommend that you verify network connectivity to the Internet and among the nodes before proceeding further.
tr_tr: Daha ileri gitmeden ağın internet bağlantısını ve diğer düğümlere bağlantısını doğrulamanızı öneririz.

source: We recommend that you verify operation and fix any issues before proceeding. The following steps use the IP address ranges from the network and subnet creation examples.
tr_tr: Devam etmeden önce işlerliği onaylamanızı ve herhangi bir sorun varsa çözmenizi öneriyoruz. Aşağıdaki adımlar ağ ve alt ağ oluşturma örneklerindeki IP adres aralıklarını kullanır.

source: When using RHEL, it is assumed that you have registered your system using Red Hat Subscription Management and that you have the ``rhel-7-server-rpms`` repository enabled by default.
tr_tr: RHEL kullanırken, sisteminizi Red Hat Abonelik Yönetimine kaydettiğiniz ve öntanımlı olarak ``rhel-7-server-rpms`` deposunun etkin olduğu varsayılır.

source: When you add new compute nodes, you must run ``nova-manage cell_v2 discover_hosts`` on the controller node to register those new compute nodes. Alternatively, you can set an appropriate interval in ``/etc/nova/nova.conf``:
tr_tr: Yeni hesaplama düğümleri eklediğinizde, kontrol düğümünde ``nova-manage cell_v2 discover_hosts`` çalıştırarak yeni hesaplama düğümlerini kaydetmelisiniz. Alternatif olarak, ``/etc/nova/nova.conf`` dosyasında uygun bir aralık ayarlayabilirsiniz:

source: You can also reference a flavor by ID.
tr_tr: Niteliğe kimliğiyle de başvurabilirsiniz.

source: You can deploy more than one block storage node. Each node requires a minimum of one network interface.
tr_tr: Birden fazla blok depolama düğümü kurabilirsiniz. Her düğüm en az bir ağ arayüzü gerektirir.

source: You can deploy more than one compute node. Each node requires a minimum of two network interfaces.
tr_tr: Birden fazla hesaplama düğümü kurabilirsiniz. Her düğüm en az iki ağ arayüzü gerektirir.

source: You can deploy the Networking service using one of two architectures represented by options 1 and 2.
tr_tr: Ağ servisini seçenek 1 ve 2 olarak tanıtılan iki mimariden birini kullanarak kurabilirsiniz.

source: You can modify these ranges and gateways to work with your particular network infrastructure.
tr_tr: Bu aralıkları ve geçitleri ağ alt yapınızla çalışacak şekilde değiştirebilirsiniz.

source: You can perform further testing of your networking using the `neutron-sanity-check command line client <https://docs.openstack.org/cli-reference/neutron-sanity-check.html>`_.
tr_tr: Ağınızı `neutron-sanity-check komut satırı istemcisi <https://docs.openstack.org/cli-reference/neutron-sanity-check.html>`_ ile daha fazla test edebilirsiniz.

source: You can repeat this procedure to create additional projects and users.
tr_tr: Bu yordamı ek projeler ve kullanıcılar oluşturmak için tekrarlayabilirsiniz.

source: You must :ref:`create the provider network <launch-instance-networks-provider>` before the self-service network.
tr_tr: Kendine servis ağından önce :ref:`sağlayıcı ağı oluşturmalısınız <launch-instance-networks-provider>`.

source: You must :ref:`install and configure a storage node <cinder-storage>` prior to installing and configuring the backup service.
tr_tr: Yedek servisini kurmadan ve yapılandırmadan önce :ref:`bir depolama düğümü kurmalı ve yapılandırmalısınız <cinder-storage>`.

source: You must create a file system on the device and mount it to use the volume.
tr_tr: Birimi kullanabilmek için aygıtta bir dosya sistemi oluşturmalı ve bağlamalısınız.

source: You must use an account with administrative privileges to configure each node. Either run the commands as the ``root`` user or configure the ``sudo`` utility.
tr_tr: Her düğümü yapılandırmak için yönetici ayrıcalıklarına sahip bir hesap kullanmalısınız. Ya komutları ``root`` kullanıcı olarak çalıştırın ya da ``sudo`` aracını yapılandırın.

source: You should install Chrony, an implementation of :term:`NTP <Network Time Protocol (NTP)>`, to properly synchronize services among nodes. We recommend that you configure the controller node to reference more accurate (lower stratum) servers and other nodes to reference the controller node.
tr_tr: Düğümler arasında servisleri düzgün eşzamanlayabilmek için bir :term:`NTP <Network Time Protocol (NTP)>` uygulaması olan Chrony'i kurmalısınız. Kontrol düğümünü daha kesin (düşük katmanlı) sunuculara bakacak şekilde yapılandırıp diğer düğümleri kontrol düğümüne başvuracak şekilde yapılandırmanızı öneririz.

source: Your OpenStack environment now includes Block Storage. You can :doc:`launch an instance <launch-instance>` or add more services to your environment in the following chapters.
tr_tr: OpenStack ortamınız artık Blok Depolama içeriyor. İlerleyen bölümlerde :doc:`bir sunucu başlatabilir <launch-instance>` veya ortamınıza başka servisler ekleyebilirsiniz.

source: Your OpenStack environment now includes the core components necessary to launch a basic instance. You can :ref:`launch-instance` or add more OpenStack services to your environment.
tr_tr: OpenStack ortamınız artık temel bir sunucu açmak için gerekli çekirdek bileşenleri içeriyor. :ref:`sunucu-başlatabilir` ya da ortamınıza daha fazla OpenStack servisleri ekleyebilirsiniz.
