Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: **Assumptions.** Assume that you have created a regular backup for the following database instance:
id: **Assumptions.** Asumsikan bahwa Anda telah membuat cadangan reguler untuk database name berikut:

source: **Backup the database instance**
id: **Backup the database instance** (cadangan instance database)

source: **Change the database configuration using a configuration group**
id: **Change the database configuration using a configuration group** (mengubah konfigurasi database menggunakan kelompok konfigurasi)

source: **Clean up**
id: **Clean up** (Membersihkan)

source: **Compute host requirements**
id: **Compute host requirements** (Persyaratan host Compute)

source: **Conclusion.** Using a configuration group to set a single option on a single database is obviously a trivial example. However, configuration groups can provide major efficiencies when you consider that:
id: **Conclusion** (kesimpulan) Menggunakan kelompok konfigurasi untuk menetapkan opsi tunggal pada database tunggal jelas contoh sepele. Namun, kelompok konfigurasi dapat memberikan efisiensi besar ketika Anda mempertimbangkan bahwa:

source: **Create a cluster**
id: **Create a cluster** (buat kluster)

source: **Create a configuration group**
id: **Create a configuration group** (buat kelompok konfigurasi)

source: **Create database instance.** Once you have configured a default datastore and verified that you have an appropriate flavor, you can create a database instance.
id: **Create database instance.** (buat instance database). Setelah Anda mengkonfigurasi datastore default dan memverifikasi bahwa Anda memiliki flavor yang tepat, Anda dapat membuat sebuah instance database.

source: **Create the module file and trove module**
id: ** Buat file modul dan modul trove **

source: **Create the replica**
id: **Create the replica** (buat replika)

source: **Create your first incremental backup**
id: **Create your first incremental backup** (Buat backup inkremental pertama Anda)

source: **Create your second incremental backup**
id: **Create your second incremental backup** (Buat inkremental backup kedua Anda)

source: **Delete a cluster**
id: **Delete a cluster** (hapus cluster)

source: **Destination port on virtual machine**. Define a port range. To open a single port only, enter the same value twice. ICMP does not support ports; instead, you enter values to define the codes and types of ICMP traffic to be allowed.
id: **Destination port on virtual machine**. Mendefinisikan berbagai port. Untuk membuka port tunggal saja, masukkan nilai yang sama dua kali. ICMP tidak mendukung port; sebaliknya, Anda memasukkan nilai untuk menentukan kode dan tipe traffic ICMP yang akan diizinkan.

source: **Detach the replica**
id: **Detach the replica** (lepaskan replika)

source: **Determine which flavor to use for your database**
id: **Determine which flavor to use for your database** (menentukan flavor digunakan untuk database Anda)

source: **Display cluster information**
id: **Display cluster information** (tampilan informasi klaster)

source: **Examine your existing configuration**
id: **Examine your existing configuration** (periksa konfigurasi yang ada)

source: **Get the IP address of the database instance**
id: **Get the IP address of the database instance** (dapatkan alamat IP dari database instance)

source: **Get the instance ID**
id: **Get the instance ID** (dapatkan ID instance)

source: **Guidelines**
id: **Guidelines** (pedoman)

source: **Image requirements**
id: **Image requirements** (persyaratan image)

source: **Instance name.** This name consists of the replication set name followed by the string -*n*, where *n* is 1 for the first instance in a replication set, 2 for the second instance, and so on. In this example, the instance names are ``cluster1-rs1-1``, ``cluster1-rs1-2``, and ``cluster1-rs1-3``.
id: **Instance name.** Nama ini terdiri dari nama set replikasi diikuti oleh string -*n*, dimana *n* adalah 1 untuk instance pertama dalam set replikasi, 2 untuk instance kedua, dan seterusnya. Dalam contoh ini, nama instance adalah ``cluster1-rs1-1``, ``cluster1-rs1-2``, dan ``cluster1-rs1-3``.

source: **List available options**
id: **List available options** (daftar pilihan yang tersedia)

source: **List cluster instances**
id: **List cluster instances** (daftar instance kluster)

source: **List clusters**
id: **List clusters** (dafter kluste)

source: **Maintenance.** There are also a number of useful maintenance features for working with configuration groups. You can:
id: **Maintenance.** (pemeliharaan) Ada juga sejumlah fitur pemeliharaan berguna untuk bekerja dengan kelompok konfigurasi. Kamu bisa:

source: **MySQL example.** This example creates a flavor that you can use with a MySQL database. This example has the following attributes:
id: **MySQL example.** Contoh ini menciptakan flavor yang dapat Anda gunakan dengan database MySQL. Contoh ini memiliki atribut sebagai berikut:

source: **Naming conventions for replication sets and instances.** Note that the ``Name`` column displays an instance name that includes the replication set name. The replication set names and instance names are automatically generated, following these rules:
id: **Naming conventions for replication sets and instances.** Perhatikan bahwa kolom ``Name`` menampilkan nama instance yang mencakup nama set replikasi. Nama set replikasi dan nama instance secara otomatis akan dihasilkan, berikut aturan-aturan ini:

source: **Notify users**
id: **Notify users** (Beritahu pengguna)

source: **Prerequisites.** Before you create a database instance, you need to configure a default datastore and make sure you have an appropriate flavor for the type of database instance you want.
id: **Prerequisites.** (prasyarat) Sebelum Anda membuat sebuah instance database, Anda perlu mengkonfigurasi datastore default dan pastikan Anda memiliki flavor yang sesuai untuk tipe instance database yang Anda inginkan.

source: **Protocol**. Choose TCP for SSH, ICMP for pings, or UDP.
id: **Protocol**. Pilih TCP untuk SSH, ICMP untuk ping, atau UDP.

source: **Re-examine the database configuration**
id: **Re-examine the database configuration** (pemeriksaan kembali konfigurasi database)

source: **Replication set name.** This name consists of the cluster name, followed by the string -rs\ *n*, where *n* is 1 for the first replication set you create, 2 for the second replication set, and so on. In this example, the cluster name is ``cluster1``, and there is only one replication set, so the replication set name is ``cluster1-rs1``.
id: **Replication set name.** Nama ini terdiri dari nama cluster, diikuti oleh string -rs\ *n*, dimana *n* adalah 1 untuk set replikasi pertama dimana Anda buat, 2 untuk set replikasi kedua, dan seterusnya. Dalam contoh ini, nama cluster ``cluster1``, dan hanya ada satu set replikasi, sehingga nama set replikasi adalah ``cluster1-rs1``.

source: **Restore a database instance**
id: **Restore a database instance** (Kembalikan instance database)

source: **Restore using incremental backups**
id: **Restore using incremental backups** (Restore menggunakan inkremental backup)

source: **Show and list modules**
id: ** Tampilkan dan daftar modul **

source: **Source of traffic**. Enable traffic to instances from either IP addresses inside the cloud from other group members or from all IP addresses.
id: **Source of traffic**. Aktifkan lalu lintas (traffic) ke instance dari alamat IP di dalam cloud dari anggota kelompok lain atau dari semua alamat IP.

source: **Verify backup**
id: **Verify backup** (Verifikasi cadangan)

source: **Verify replication status**
id: **Verify replication status** (pastikan status replikasi)

source: **Your application connects to this IP address.** The :command:`trove cluster-show` command displays the IP address of the query router. This is the IP address your application uses to retrieve data from the database.
id: **Your application connects to this IP address.** Perintah :command:`trove cluster-show` akan menampilkan alamat IP dari router kueri. Ini adalah alamat IP aplikasi Anda berguna untuk mengambil data dari database.

source: **avg**. The average of sample volumes over each period.
id: **avg**. Rata-rata volume sampel lebih dari setiap periode.

source: **count**. The number of samples in each period.
id: **count**. Jumlah sampel di setiap periode.

source: **max**. The maximum number of sample volumes in each period.
id: **max**. Jumlah maksimum volume sampel di setiap periode.

source: **min**. The minimum number of sample volumes in each period.
id: **min**. Jumlah minimum volume sampel di setiap periode.

source: **sum**. The sum of sample volumes over each period.
id: **sum**. Jumlah volume sampel lebih dari setiap periode.

source: *DATASTORE_NAME*. The name of the associated data store.
id: *DATASTORE_NAME*. Nama penyimpanan data yang terkait.

source: *NAME*. The name you want to use for this group.
id: *NAME*. Nama Anda ingin gunakan untuk kelompok ini.

source: *VALUES*. The list of key-value pairs.
id: *VALUES*. Daftar pasangan kunci-nilai (key-value pair).

source: :guilabel:`API Access`: View API endpoints.
id: :guilabel:`API Access`: Melihat endpoint API.

source: :guilabel:`Access & Security`: Use the following tabs to complete these tasks:
id: :guilabel:`Access & Security`: Gunakan tab berikut untuk menyelesaikan tugas ini:

source: :guilabel:`Access Level`: Choose read-write or read-only.
id: :guilabel:`Access Level`: Pilih baca-tulis atau hanya untuk dibaca.

source: :guilabel:`Access To`: Fill in Access To field.
id: :guilabel:`Access To`: Isi Access To field.

source: :guilabel:`Access Type`: Choose ip, user, or cert.
id: :guilabel:`Access Type`: Pilih ip, pengguna, atau cert.

source: :guilabel:`Admin State`: The state to start the network in.
id: :guilabel:`Admin State`: Kondisi untuk memulai jaringan masuk.

source: :guilabel:`Allocation Pools`: Specify IP address pools.
id: :guilabel:`Allocation Pools`: Tentukan kolam alamat IP.

source: :guilabel:`Availability Zone`: Select the Availability Zone from the list. By default, this value is set to the availability zone given by the cloud provider (for example, ``us-west`` or ``apac-south``). For some cases, it could be ``nova``.
id: :guilabel:`Availability Zone`: Pilih Zona Ketersediaan dari daftar. Secara default, nilai ini diatur ke zona ketersediaan diberikan oleh penyedia cloud (for example, ``us-west`` atau ``apac-south``). Untuk beberapa kasus, hal itu bisa menjadi ``nova``.

source: :guilabel:`Binding Host`: The ID of the host where the port is allocated.
id: :guilabel:`Binding Host`: ID dari host dimana port dialokasikan.

source: :guilabel:`Binding VNIC Type`: Select the VNIC type that is bound to the neutron port.
id: :guilabel:`Binding VNIC Type`: Pilih tipe VNIC yang terikat ke port neutron.

source: :guilabel:`Block Storage Services`: View a list of all Block Storage services.
id: :guilabel:`Block Storage Services`: Melihat daftar semua layanan Block Storage.

source: :guilabel:`Change Password`: Change the password of the user.
id: :guilabel:`Change Password`: Mengubah password pengguna.

source: :guilabel:`Compute Services`: View a list of all Compute services.
id: :guilabel:`Compute Services`: Melihat daftar semua layanan Compute.

source: :guilabel:`Configuration` tab
id: Tab :guilabel:`Configuration`

source: :guilabel:`Confirm Password`: Enter the password again to confirm.
id: :guilabel:`Confirm Password`: Masukkan password lagi untuk konfirmasi.

source: :guilabel:`Containers`: Create and manage containers and objects.
id: :guilabel:`Containers`: Membuat dan mengelola wadah (container) dan objek.

source: :guilabel:`Create Subnet`: Select this check box to create a subnet
id: :guilabel:`Create Subnet`: Pilih (select) check box ini untuk membuat subnet

source: :guilabel:`DNS IP`: Enter the DNS IP address.
id: :guilabel:`DNS IP`: Masukkan alamat IP DNS.

source: :guilabel:`DNS Name Servers`: Specify a name for the DNS server.
id: :guilabel:`DNS Name Servers`: Tentukan nama untuk server DNS.

source: :guilabel:`Database Name`: Specify a name for the database instance.
id: :guilabel:`Database Name`: Tentukan nama untuk instance database.

source: :guilabel:`Defaults`: View default quota values. Quotas are hard-coded in OpenStack Compute and define the maximum allowable size and number of resources.
id: :guilabel:`Defaults`: Melihat nilai kuota default. Kuota adalah hard-coded di OpenStack Compute dan menentukan ukuran maksimum dan jumlah sumber daya.

source: :guilabel:`Description`: Enter a new description.
id: :guilabel:`Description`: Masukkan deskripsi baru.

source: :guilabel:`Description`: Optionally, provide a brief description for the security service.
id: :guilabel:`Description`: Secara opsional, berikan penjelasan singkat untuk layanan keamanan.

source: :guilabel:`Description`: Optionally, provide a brief description for the share network.
id: :guilabel:`Description`: secara opsional, berikan penjelasan singkat untuk jaringan bersama.

source: :guilabel:`Description`: Optionally, provide a brief description for the share.
id: :guilabel:`Description`: Secara opsional, memberikan penjelasan singkat untuk berbagi.

source: :guilabel:`Description`: Optionally, provide a brief description for the volume.
id: :guilabel:`Description`: Secara opsional, berikan penjelasan singkat untuk volume.

source: :guilabel:`Destination Container`: Choose the destination container from the list.
id: :guilabel:`Destination Container`: Pilih kontainer tujuan dari daftar.

source: :guilabel:`Destination object name`: Enter a name for the object in the new container.
id: :guilabel:`Destination object name`: Masukkan nama untuk objek dalam wadah (container) baru.

source: :guilabel:`Details` tab
id: Tab :guilabel:`Details`

source: :guilabel:`Device ID`: Device ID attached to the port.
id: :guilabel:`Device ID`: Device ID terhubung port.

source: :guilabel:`Device Owner`: Device owner attached to the port.
id: :guilabel:`Device Owner`: Pemilik perangkat yang terpasang ke port.

source: :guilabel:`Disable Gateway`: Select this check box to disable a gateway IP address.
id: :guilabel:`Disable Gateway`: Pilih check box ini untuk menonaktifkan alamat IP gateway.

source: :guilabel:`Domain`: Enter the domain name.
id: :guilabel:`Domain`: Masukkan nama domain.

source: :guilabel:`Enable DHCP`: Select this check box to enable DHCP.
id: :guilabel:`Enable DHCP`: Pilih check box ini untuk mengaktifkan DHCP.

source: :guilabel:`Firewall Policies`: Add and manage firewall policies.
id: :guilabel:`Firewall Policies`: Menambahkan dan mengelola kebijakan firewall.

source: :guilabel:`Firewall Rules`: Add and manage firewall rules.
id: :guilabel:`Firewall Rules`: Menambahkan dan mengelola aturan firewall.

source: :guilabel:`Firewalls`: Create and manage firewalls.
id: :guilabel:`Firewalls`: Membuat dan mengelola firewall.

source: :guilabel:`Flavor` tab
id: Tab :guilabel:`Flavor`

source: :guilabel:`Flavor`: Select an appropriate flavor for the instance.
id: :guilabel:`Flavor`: Pilih flavor yang sesuai instance.

source: :guilabel:`Flavors`: View, create, edit, view extra specifications for, and delete flavors. A flavor is the size of an instance.
id: :guilabel:`Flavors`: Melihat, membuat, mengedit, melihat spesifikasi tambahan, dan menghapus flavor. Flavor adalah ukuran sebuah instance.

source: :guilabel:`Floating IPs`: Allocate an IP address to or release it from a project.
id: :guilabel:`Floating IPs`: Mengalokasikan alamat IP atau melepaskannya dari proyek.

source: :guilabel:`Gateway IP`: Specify an IP address for a specific gateway. This parameter is optional.
id: :guilabel:`Gateway IP`: Menentukan alamat IP untuk gateway tertentu. Parameter ini bersifat opsional.

source: :guilabel:`Host Aggregates`: View, create, and edit host aggregates. View the list of availability zones.
id: :guilabel:`Host Aggregates`: Melihat, membuat, dan mengedit agregat host. Lihat daftar zona ketersediaan.

source: :guilabel:`Host Routes`: Specify the IP address of host routes.
id: :guilabel:`Host Routes`: Tentukan alamat IP dari rute host.

source: :guilabel:`Host`: Optionally, allow the user to connect only from this host. If you do not specify a host, this user will be allowed to connect from anywhere.
id: :guilabel:`Host`: Secara opsional, memungkinkan pengguna untuk menghubungkan hanya dari host ini. Jika Anda tidak menentukan host, pengguna ini akan diizinkan untuk terhubung dari mana saja.

source: :guilabel:`Hypervisors`: View the hypervisor summary.
id: :guilabel:`Hypervisors`: Melihat ringkasan hypervisor.

source: :guilabel:`IP Version`: Select IPv4 or IPv6.
id: :guilabel:`IP Version`: Pilih IPv4 atau IPv6.

source: :guilabel:`Image File` or :guilabel:`Image Location`
id: :guilabel:`Image File` atau :guilabel:`Image Location`

source: :guilabel:`Images`: View images and instance snapshots created by project users, plus any images that are publicly available. Create, edit, and delete images, and launch instances from images and snapshots.
id: :guilabel:`Images`: Melihat foto dan snapshot instance yang dibuat oleh pengguna proyek, ditambah image yang tersedia untuk umum. Membuat, mengedit, dan menghapus image, dan meluncurkan instance dari image dan snapshot.

source: :guilabel:`Images`: View, create, edit properties for, and delete custom images.
id: :guilabel:`Images`: Melihat, membuat, mengedit properti untuk, dan menghapus image kustom.

source: :guilabel:`Initial Admin User`: Create an initial admin user. This user will have access to all the databases you create.
id: :guilabel:`Initial Admin User`: Buat user admin awal. Pengguna ini akan memiliki akses ke semua database yang Anda buat.

source: :guilabel:`Initialize Databases`: Initial Database
id: :guilabel:`Initialize Databases`: Database awal

source: :guilabel:`Instances`: View, launch, create a snapshot from, stop, pause, or reboot instances, or connect to them through VNC.
id: :guilabel:`Instances`: Melihat, meluncurkan, membuat snapshot dari, menghentikan, pause, atau reboot instance, atau menghubungkan ke mereka melalui VNC.

source: :guilabel:`Instances`: View, pause, resume, suspend, migrate, soft or hard reboot, and delete running instances that belong to users of some, but not all, projects. Also, view the log for an instance or access an instance through VNC.
id: :guilabel:`Instances`: Melihat, melakukan jeda, melanjutkan, menangguhkan, bermigrasi, reboot lembut atau keras, dan menghapus menjalankan instance milik pengguna dari beberapa, tapi tidak semua, proyek. Juga, melihat log untuk sebuah instance atau mengakses instance melalui VNC.

source: :guilabel:`Key Pair` tab
id: Tab :guilabel:`Key Pair`

source: :guilabel:`Key Pairs`: View, create, edit, import, and delete key pairs.
id: :guilabel:`Key Pairs`: MeLihat, membuat, mengedit, impor, dan menghapus pasangan kunci (key pair).

source: :guilabel:`Load Balancers`: Create and manage load balancers.
id: :guilabel:`Load Balancers`: Membuat dan mengelola penyeimbang beban (load balancer).

source: :guilabel:`Members`: Add and manage members.
id: :guilabel:`Members`: Menambahkan dan mengelola anggota.

source: :guilabel:`Metadata Definitions`: Import namespace and view the metadata information.
id: :guilabel:`Metadata Definitions`: Impor namespace dan melihat informasi metadata.

source: :guilabel:`Metadata` tab
id: Tab :guilabel:`Metadata`

source: :guilabel:`Metadata`: Enter metadata for the share creation if needed.
id: :guilabel:`Metadata`: Masukkan metadata untuk pembuatan share jika diperlukan.

source: :guilabel:`Metadata`: To add share metadata, use key=value. To unset metadata, use key.
id: :guilabel:`Metadata`: Untuk menambahkan metadata share, menggunakan key=value. Untuk metadata tanpa pengaturan (unset), gunakan kunci.

source: :guilabel:`Monitors`: Add and manage monitors.
id: :guilabel:`Monitors`: Menambahkan dan mengelola monitor.

source: :guilabel:`Name`: Enter a new security service name.
id: :guilabel:`Name`: Masukkan nama layanan keamanan baru.

source: :guilabel:`Name`: Enter a new share network name.
id: :guilabel:`Name`: Masukkan nama jaringan bersama baru.

source: :guilabel:`Name`: Specify a name for the security service.
id: :guilabel:`Name`: Tentukan nama untuk layanan keamanan.

source: :guilabel:`Name`: Specify a name for the share network.
id: :guilabel:`Name`: Tentukan nama untuk jaringan bersama.

source: :guilabel:`Name`: Specify name to identify the port.
id: :guilabel:`Name`: Tentukan nama untuk mengidentifikasi port.

source: :guilabel:`Network Address`: Specify the IP address for the subnet.
id: :guilabel:`Network Address`: Tentukan alamat IP untuk subnet.

source: :guilabel:`Network Agents`: View the network agents.
id: :guilabel:`Network Agents`: Lihat agen jaringan.

source: :guilabel:`Network Name`: Specify a name to identify the network.
id: :guilabel:`Network Name`: Tentukan nama untuk mengidentifikasi jaringan.

source: :guilabel:`Network Ports` tab
id: Tab :guilabel:`Network Ports`

source: :guilabel:`Network Topology`: View the network topology.
id: :guilabel:`Network Topology`: Melihat topologi jaringan.

source: :guilabel:`Network` tab
id: Tab :guilabel:`Network`

source: :guilabel:`Networks` tab
id: Tab :guilabel:`Networks`

source: :guilabel:`Networks`: Create and manage public and private networks.
id: :guilabel:`Networks`: Membuat dan mengelola jaringan publik dan private.

source: :guilabel:`Networks`: View, create, edit properties for, and delete networks.
id: :guilabel:`Networks`: Melihat, membuat, mengedit properti untuk, dan menghapus jaringan.

source: :guilabel:`Neutron Net`: Choose a neutron network.
id: :guilabel:`Neutron Net`: Pilih jaringan neutron.

source: :guilabel:`Neutron Subnet`: Choose a neutron subnet.
id: :guilabel:`Neutron Subnet`: Pilih subnet neutron.

source: :guilabel:`New Size (GB)`: Enter new size.
id: :guilabel:`New Size (GB)`: Masukkan ukuran baru.

source: :guilabel:`Orchestration Services`: View a list of all Orchestration services.
id: :guilabel:`Orchestration Services`: Melihat daftar semua layanan Orchestration.

source: :guilabel:`Overview`: View basic reports.
id: :guilabel:`Overview`: Melihat laporan dasar.

source: :guilabel:`Overview`: View reports for the project.
id: :guilabel:`Overview`: Lihat laporan untuk proyek tersebut.

source: :guilabel:`Password`: Enter the password.
id: :guilabel:`Password`: Masukkan password.

source: :guilabel:`Password`: Specify a password associated with the initial admin user you just named.
id: :guilabel:`Password`: Tentukan password yang terkait dengan user admin awal yang Anda baru namakan.

source: :guilabel:`Path`: Specify a path in which the new copy should be stored inside of the selected container.
id: :guilabel:`Path`: Menentukan jalur dimana salinan baru harus disimpan dalam wadah (container) yang dipilih.

source: :guilabel:`Pools`: Add and manage pools.
id: :guilabel:`Pools`: Menambahkan dan mengelola kolam (pool).

source: :guilabel:`Projects`: View, create, assign users to, remove users from, and delete projects.
id: :guilabel:`Projects`: Melihat, membuat, menetapkan pengguna untuk, menghapus pengguna dari, dan menghapus proyek.

source: :guilabel:`Resource Types`: Show a list of all the supported resource types for HOT templates.
id: :guilabel:`Resource Types`: Menampilkan daftar semua jenis sumber daya yang didukung untuk template HOT.

source: :guilabel:`Resource Usage`: Use the following tabs to view the following usages:
id: :guilabel:`Resource Usage`: Gunakan tab berikut untuk melihat penggunaan berikut:

source: :guilabel:`Routers`: Create and manage routers.
id: :guilabel:`Routers`: Membuat dan mengelola router.
