Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: When the ``PUT`` operation sees the ``?multipart-manifest=put`` query parameter, it reads the request body and verifies that each segment object exists and that the sizes and ETags match. If there is a mismatch, the ``PUT`` operation fails.
id: Ketika operasi ``PUT`` melihat parameter query ``?multipart-manifest = put``, itu membaca request body dan memverifikasi bahwa setiap objek segmen ada, dan bahwa ukuran dan ETag cocok. Jika ada ketidakcocokan, operasi ``PUT`` gagal.

source: When the latest module was created, the ``--include_clustered`` was not used. Use the :command:`trove module-reapply` command:
id: Saat modul terbaru dibuat, ``--include_clustered`` tidak digunakan. Gunakan perintah :command:`trove module-reapply`:

source: When the resize completes, the status becomes VERIFY\_RESIZE.
id: Ketika mengubah ukuran selesai, status menjadi VERIFY\_RESIZE.

source: When using SPICE to view the console of an instance, a browser plugin can be used directly on the instance page, or the :command:`openstack console url show` command can be used with it, as well, by returning a token-authenticated address, as in the example above.
id: Bila menggunakan SPICE untuk melihat konsol instance, sebuah plugin browser dapat digunakan langsung pada halaman instance, atau perintah :command:`openstack console url show` dapat digunakan dengan itu, juga, dengan kembali (returning) alamat token-authenticated, seperti dalam contoh di atas.

source: When using the SDK, you must authenticate against an OpenStack endpoint before you can use OpenStack services. Because all projects use Keystone for authentication, the process is the same no matter which service or library you have decided to use. Each library also has more advanced and complicated ways to do things, should those be needed.
id: Bila menggunakan SDK, Anda harus mengotentikasi terhadap titik akhir (endpoint) OpenStack sebelum Anda dapat menggunakan layanan OpenStack. Karena semua proyek menggunakan Keystone untuk otentikasi, proses berjalan sama tidak peduli dengan layanan atau perpustakaan dimana Anda telah memutuskan untuk menggunakan. Setiap perpustakaan juga memiliki cara yang lebih canggih dan rumit untuk melakukan hal-hal, bila mereka itu dibutuhkan.

source: When working with images in the SDK, you will call ``novaclient`` methods.
id: Ketika bekerja dengan image di SDK, Anda akan memanggil metode ``novaclient``.

source: When working with images in the SDK, you will call both ``glance`` and ``nova`` methods.
id: Ketika bekerja dengan image di SDK, Anda akan memanggil metode ``glance`` dan ``nova``.

source: When you create a bare-metal node, your PM address, user name, and password should match the information in your hardware's BIOS/IPMI configuration.
id: Bila Anda membuat node bare-metal, alamat PM Anda, nama pengguna, dan password harus sesuai dengan informasi dalam konfigurasi BIOS/IPMI hardware Anda.

source: When you create a database instance, you must specify a nova flavor. The flavor indicates various characteristics of the instance, such as RAM and root volume size. You will need to create or obtain new nova flavors that work for databases.
id: Ketika Anda membuat sebuah instance database, Anda harus menentukan flavor nova. Flavor menunjukkan berbagai karakteristik instance, seperti ukuran RAM dan root volume. Anda akan perlu membuat atau mendapatkan flavors nova baru yang bekerja untuk database.

source: When you create a replica, do not specify the ``--users`` or ``--databases`` options.
id: Bila Anda membuat replika, jangan menentukan opsi ``--users`` atau ``--databases``.

source: When you create images that access configuration drive data and multiple directories are under the ``openstack`` directory, always select the highest API version by date that your consumer supports. For example, if your guest image supports the 2012-03-05, 2012-08-05, and 2013-04-13 versions, try 2013-04-13 first and fall back to a previous version if 2013-04-13 is not present.
id: Bila Anda membuat image yang mengakses drive data konfigurasi dan beberapa direktori berada di bawah direktori ``openstack``, selalu pilih versi API tertinggi pada tanggal tersebut konsumen Anda mendukung. Misalnya, jika image guest Anda mendukung 2012/03/05, 2012/08/05, dan 2013/04/13 versi, cobalah petram 2013/04/13 dan jatuh kembali ke versi sebelumnya jika 2013/04/13 adalah tidak hadir.

source: When you delete a stack, you cannot undo this action.
id: Ketika Anda menghapus stack, Anda tidak dapat membatalkan tindakan ini.

source: When you delete an instance, the data in its attached volumes is not deleted.
id: Ketika Anda menghapus sebuah instance, data dalam volume yang melekat tidak dihapus.

source: When you launch a virtual machine, you can inject a *key pair*, which provides SSH access to your instance. For this to work, the image must contain the ``cloud-init`` package.
id: Ketika Anda memulai mesin virtual, Anda dapat menyuntikkan *key pair*, yang menyediakan akses SSH untuk instance Anda. Untuk ini untuk bekerja, image harus berisi paket ``cloud-init``.

source: When you launch an instance from a volume, note the following steps:
id: Ketika Anda memulai sebuah instance dari volume, perhatikan langkah berikut:

source: When you launch an instance from an image, OpenStack creates a local copy of the image on the compute node where the instance starts.
id: Ketika Anda memulai sebuah instance dari sebuah image, OpenStack membuat copy lokal dari image pada node komputasi dimana instance dimulai.

source: When you launch an instance, it is automatically assigned a private IP address that stays the same until you explicitly terminate the instance. Rebooting an instance has no effect on the private IP address.
id: Ketika Anda memulai sebuah instance, maka secara otomatis diberi alamat IP pribadi yang tetap sama sampai Anda secara eksplisit mengakhiri instance. Reboot instance tidak berpengaruh pada alamat IP pribadi.

source: When you no longer need an instance, you can delete it.
id: Bila Anda tidak perlu lagi sebuah instance, Anda dapat menghapusnya.

source: When you request a list of containers or objects, Object Storage returns a maximum of 10,000 names for each request. To get subsequent names, you must make another request with the ``marker`` parameter. Set the ``marker`` parameter to the name of the last item returned in the previous list. You must URL-encode the ``marker`` value before you send the HTTP request. Object Storage returns a maximum of 10,000 names starting after the last item returned.
id: Ketika Anda meminta daftar kontainer atau objek, Object Storage mengembalikan maksimum 10.000 nama untuk setiap permintaan. Untuk mendapatkan nama berikutnya, Anda harus membuat permintaan lain dengan parameter ``marker``. Mengatur parameter ``marker`` dengan nama item terakhir kembali dalam daftar sebelumnya. Anda harus URL-encode nilai ``marker`` sebelum Anda mengirim permintaan HTTP. Object Storage mengembalikan maksimum 10.000 nama akan memulai setelah item terakhir kembali.

source: When you upload each segment and the manifest, include the same value in the ``X-Trans-Id-Extra`` request header. If an error occurs, you can find all requests that are related to the large object upload in the Object Storage logs.
id: Ketika Anda meng-upload setiap segmen dan manifes, masukkan nilai yang sama dalam header permintaan (request) ``X-Trans-Id-Extra`` . Jika terjadi kesalahan, Anda dapat menemukan semua permintaan yang berhubungan dengan upload objek besar di log Object Storage.

source: Where ``length`` is the 3-character, zero-padded hexadecimal character length of the object, ``<object_name>`` is the object name, and ``<timestamp>`` is the time when the object was initially created as a current version.
id: Dimana ``length`` adalah 3 karakter, panjang karakter heksadesimal zero-padded dari objek, ``<object_name> `` adalah nama objek, dan ``<timestamp> `` adalah waktu ketika objek itu awalnya diciptakan sebagai versi saat ini.

source: While static and dynamic objects have similar behavior, this table describes their differences:
id: Sementara objek statis dan dinamis memiliki perilaku yang sama, tabel ini menggambarkan perbedaan mereka:

source: Who should read this book?
id: Siapa yang harus membaca buku ini?

source: With bulk delete, you can delete up to 10,000 objects or containers (configurable) in one request.
id: Dengan penghapusan massal, Anda dapat menghapus hingga 10.000 objek atau kontainer (dikonfigurasi) dalam satu permintaan.

source: With this option, you can boot from an image and create a volume by entering the :guilabel:`Device Size` and :guilabel:`Device Name` for your volume. Click the :guilabel:`Delete Volume on Instance Delete` option to delete the volume on deleting the instance.
id: Dengan opsi ini, Anda dapat boot dari image dan membuat volume dengan memasukkan :guilabel:`Device Size` dan :guilabel:`Device Name` untuk volume Anda. Klik opsi :guilabel:`Delete Volume on Instance Delete` untuk menghapus volume pada penghapusan instance.

source: XML data serialization response format.
id: Format respon serialisasi data XML

source: You also create and upload a manifest file. The manifest file is a zero-byte file with the extra ``X-Object-Manifest`` ``CONTAINER/PREFIX`` header. The ``CONTAINER`` is the container the object segments are in and ``PREFIX`` is the common prefix for all the segments. You must UTF-8-encode and then URL-encode the container and common prefix in the ``X-Object-Manifest`` header.
id: Anda juga membuat dan mengunggah file manifest. File manifest file nol-byte dengan tambahan header ``X-Object-Manifest`` ``CONTAINER/PREFIX``. ``CONTAINER`` adalah kontainer dimana segmen objek berada di dalamnya, dan `` PREFIX`` adalah awalan umum untuk semua segmen. Anda harus utf-8-encode dan kemudian URL-encode kontainer dan awalan umum di header ``X-Object-Manifest``.

source: You also have the option of displaying a list of files in your pseudo-directory instead of a web page. To do this, set the ``X-Container-Meta-Web-Listings`` header to ``TRUE``. You may add styles to your file listing by setting ``X-Container-Meta-Web-Listings-CSS`` to a style sheet (for example, ``lists.css``).
id: Anda juga memiliki pilihan untuk menampilkan daftar file dalam pseudo-direktori Anda bukan sebuah halaman web. Untuk melakukan hal ini, aturlah header ``X-Container-Meta-Web-Listings`` ke ``TRUE``. Anda dapat menambahkan gaya ke file daftar Anda dengan pengaturan ``X-Container-Meta-Web-Listings-CSS`` ke style sheet (misalnya, ``lists.css``).

source: You can also assign a floating IP address to a running instance to make it accessible from outside the cloud. See :doc:`cli-manage-ip-addresses`.
id: Anda juga dapat menetapkan alamat IP mengambang ke instance yang menjalankan supaya dapat diakses dari luar cloud. Lihat :doc:`cli-manage-ip-addresses`.

source: You can also attach a block storage device, or **volume**, for persistent storage.
id: Anda juga dapat menghubungkan (attach) perangkat penyimpanan blok, atau **volume**, untuk penyimpanan persisten.

source: You can also configure the Compute service to always create a configuration drive by setting the following option in the ``/etc/nova/nova.conf`` file:
id: Anda juga dapat mengkonfigurasi layanan Compute untuk selalu membuat drive konfigurasi dengan menetapkan opsi berikut di file ``/etc/nova/nova.conf``:

source: You can also filter the image list by using :command:`grep` to find a specific image, as follows:
id: Anda juga dapat menyaring daftar image dengan menggunakan :command:`grep` untuk menemukan image tertentu, sebagai berikut:

source: You can also launch an instance from the :guilabel:`Images` or :guilabel:`Volumes` category when you launch an instance from an image or a volume respectively.
id: Anda juga dapat meluncurkan sebuah instance dari kategori :guilabel:`Images` atau :guilabel:`Volumes` ketika Anda memulai sebuah instance dari sebuah image atau volume masing-masing.

source: You can also place arbitrary local files into the instance file system at creation time by using the ``--file <dst-path=src-path>`` option. You can store up to five files. For example, if you have a special authorized keys file named ``special_authorized_keysfile`` that you want to put on the instance rather than using the regular SSH key injection, you can use the ``--file`` option as shown in the following example.
id: Anda juga dapat menempatkan file lokal sembarang tempat ke dalam sistem file instance pada waktu pembuatan dengan menggunakan opsi ``--file <dst-path=src-path>``. Anda dapat menyimpan hingga lima file. Misalnya, jika Anda memiliki file authorized keys khusus bernama ``special_authorized_keysfile`` dimana Anda ingin menempatkan pada instance daripada menggunakan injeksi kunci SSH biasa, Anda dapat menggunakan opsi ``--file`` seperti yang ditunjukkan dalam contoh berikut.

source: You can also use ``X-Trans-Id-Extra`` strings to help operators debug requests that fail to receive responses. The operator can search for the extra information in the logs.
id: Anda juga dapat menggunakan string ``X-Trans-Id-Extra`` membantu permintaan operator debug yang gagal untuk menerima tanggapan. operator dapat mencari informasi tambahan di log.

source: You can also use the :command:`openstack` and :command:`glance` command-line clients or the Image service to manage images. For more information see :doc:`../common/cli-manage-images`.
id: Anda juga dapat menggunakan command-line client :command:`openstack` dan :command:`glance` atau layanan Image untuk mengelola images. Untuk informasi lebih lanjut lihat :doc:`../common/cli-manage-images`.

source: You can also use the :command:`swift stat` command with the ``ACCOUNT`` or ``CONTAINER`` names as parameters.
id: Anda juga dapat menggunakan perintah :command:`swift stat` dengan nama ``ACCOUNT`` atau ``CONTAINER`` sebagai parameter.

source: You can also use the ``--dry-run`` option with the :command:`openstack stack create` command to validate a template file without creating a stack from it.
id: Anda juga dapat menggunakan opsi ``--dry-run`` dengan perintah :command:`openstack stack create` untuk memvalidasi file template tanpa membuat stack (tumpukan) dari itu.

source: You can apply a configuration group to hundreds or thousands of database instances in your environment.
id: Anda dapat menerapkan kelompok konfigurasi untuk ratusan atau ribuan instance database di lingkungan Anda.

source: You can assign a floating IP address to a project and to an instance.
id: Anda dapat menetapkan alamat IP mengambang untuk proyek dan untuk sebuah instance.

source: You can boot instances from a volume instead of an image.
id: Anda dapat boot instance dari volume bukan image.

source: You can change a database's configuration by attaching a configuration group to a database instance. You do this by using the :command:`trove configuration-attach` command and passing in the ID of the database instance and the ID of the configuration group.
id: Anda dapat mengubah konfigurasi database dengan menghubungkan (attaching) kelompok konfigurasi untuk instance database. Anda melakukan ini dengan menggunakan perintah :command:`trove configuration-attach` dan lewatkan di ID dari database instance dan ID dari kelompok konfigurasi.

source: You can change various characteristics of a database instance, such as its volume size and flavor.
id: Anda dapat mengubah berbagai karakteristik instance database, seperti ukuran volume dan flavor.

source: You can choose a smaller volume or flavor for a replica than for the original, but the replica's volume must be big enough to hold the data snapshot from the original.
id: Anda dapat memilih volume atau flavor yang lebih kecil untuk replika daripada aslinya, tetapi volume replika ini harus cukup besar untuk menampung snapshot data dari aslinya.

source: You can configure OpenStack to write metadata to a special configuration drive that attaches to the instance when it boots. The instance can mount this drive and read files from it to get information that is normally available through the `metadata service <https://docs.openstack.org/admin-guide/compute-networking-nova.html#metadata-service>`__. This metadata is different from the user data.
id: Anda dapat mengkonfigurasi OpenStack untuk menulis metadata ke drive konfigurasi khusus yang melekat pada instance ketika boot. Instance dapat me-mount drive ini dan membaca file itu untuk mendapatkan informasi yang biasanya tersedia melalui `metadata service <https://docs.openstack.org/admin-guide/compute-networking-nova.html#metadata-service>`__. Metadata ini berbeda dari data pengguna.

source: You can continue to upload segments, like this example shows, before you upload the manifest.
id: Anda dapat terus meng-upload segmen, seperti yang ditunjukkan contoh ini, sebelum Anda meng-upload manifes.

source: You can count the instances each module is applied to by doing the following:
id: Anda dapat menghitung instance setiap modul yang diterapkan dengan melakukan hal berikut:

source: You can create a configuration group by using the :command:`trove configuration-create` command. The general syntax for this command is:
id: Anda dapat membuat kelompok konfigurasi dengan menggunakan perintah :command:`trove configuration-create`. Sintaks umum untuk perintah ini adalah:

source: You can create a new object in container without a file available and can upload the file later when it is ready. This temporary object acts a place-holder for a new object, and enables the user to share object metadata and URL info in advance.
id: Anda dapat membuat objek baru dalam kontainer tanpa file yang tersedia dan dapat meng-upload file kemudian waktu ketika file sudah siap. Objek sementara ini bertindak place-holder untuk objek baru, dan memungkinkan pengguna untuk berbagi metadata objek dan info URL pada waktu sebelumnya.

source: You can create a replica of an existing database instance. When you make subsequent changes to the original instance, the system automatically applies those changes to the replica.
id: Anda dapat membuat replika dari sebuah instance database yang ada. Ketika Anda membuat perubahan selanjutnya ke instance asli, sistem secara otomatis menerapkan perubahan untuk replika.

source: You can create a test module and mysql database with the module applied by doing the following:
id: Anda bisa membuat test module dan database mysql dengan modul yang diaplikasikan dengan melakukan hal berikut:

source: You can create a volume from an existing image, volume, or snapshot. This procedure shows you how to create a volume from an image, and use the volume to boot an instance.
id: Anda dapat membuat volume dari sebuah image, volume, atau snapshot yang ada. Prosedur ini menunjukkan Anda bagaimana untuk membuat volume dari sebuah image, dan menggunakan volume untuk boot sebuah instance.

source: You can create an unlimited number of nested pseudo-directories. To navigate through them, use a longer ``prefix`` parameter coupled with the ``delimiter`` parameter. In this sample output, there is a pseudo-directory called ``dogs`` within the pseudo-directory ``animals``. To navigate directly to the files contained within ``dogs``, enter the following command:
id: Anda dapat membuat jumlah yang tidak terbatas pseudo-directory bersarang. Untuk menavigasi melalui mereka, gunakan lebih panjang parameter ``prefix`` ditambah dengan parameter ``delimiter``. Dalam contoh output ini, ada pseudo-directory yang disebut ``dogs`` dalam pseudo-directory ``animals``. Untuk menavigasi langsung ke file yang terdapat dalam ``dogs``, masukkan perintah berikut:

source: You can create and set custom error pages for visitors to your website; currently, only 401 (Unauthorized) and 404 (Not Found) errors are supported. To do this, set the metadata header, ``X-Container-Meta-Web-Error``.
id: Anda dapat membuat dan mengatur halaman kesalahan kustom untuk pengunjung ke website Anda; Saat ini, hanya kesalahan 401 (Unauthorized/tak sah) dan 404 (Tidak Ditemukan/Not Found) yang didukung. Untuk melakukan hal ini, aturlah header metadata, ``X-Container-Meta-Web-Error``.

source: You can create at least one key pair for each project. You can use the key pair for multiple instances that belong to that project. If you generate a key pair with an external tool, you can import it into OpenStack.
id: Anda dapat membuat setidaknya satu sepasang kunci (key pair) untuk setiap proyek. Anda dapat menggunakan sepasang kunci untuk beberapa instance yang tergabung dalam proyek itu. Jika Anda menghasilkan pasangan kunci dengan alat eksternal, Anda dapat mengimpor ke OpenStack.

source: You can extend a volume by using the :guilabel:`Extend Volume` option available in the :guilabel:`More` dropdown list and entering the new value for volume size.
id: Anda dapat memperbesar volume dengan menggunakan opsi tersedia :guilabel:`Extend Volume` dalam daftar dropdown :guilabel:`More` dan memasukkan nilai baru untuk ukuran volume.

source: You can generate a key pair or upload an existing public key.
id: Anda dapat menghasilkan sepasang kunci atau meng-upload kunci publik (public key) yang ada.

source: You can get additional information about the backup by using the :command:`trove backup-show` command and passing in the ``BACKUP_ID``, which is ``8af30763-61fd-4aab-8fe8-57d528911138``.
id: Anda bisa mendapatkan informasi tambahan tentang backup (cadangan) dengan menggunakan perintah :command:`trove backup-show` dan melewat ``BACKUP_ID``, dimana ``8af30763-61fd-4aab-8fe8-57d528911138``.

source: You can launch an instance from various sources.
id: Anda dapat memulai sebuah instance dari berbagai sumber.

source: You can list and delete bare-metal nodes. When you delete a node, any associated network interfaces are removed. You can list and remove network interfaces that are associated with a bare-metal node.
id: Anda bisa daftar dan menghapus node bare-metal. Ketika Anda menghapus sebuah node, setiap antarmuka jaringan yang terkait akan dihapus. Anda bisa daftar dan menghapus antarmuka jaringan yang terkait dengan node bare-metal.

source: You can list the instances that have a particular module applied by doing the following:
id: Anda dapat mencantumkan instance yang memiliki modul tertentu yang diterapkan dengan melakukan hal berikut:

source: You can manage database configuration tasks by using configuration groups. Configuration groups let you set configuration options, in bulk, on one or more databases.
id: Anda dapat mengelola tugas konfigurasi database dengan menggunakan kelompok konfigurasi. Kelompok konfigurasi memungkinkan Anda mengatur opsi konfigurasi, dalam jumlah besar, pada satu atau lebih database.

source: You can modify the rules in a security group to allow access to instances through different ports and protocols. For example, you can modify rules to allow access to instances through SSH, to ping instances, or to allow UDP traffic; for example, for a DNS server running on an instance. You specify the following parameters for rules:
id: Anda dapat memodifikasi aturan dalam kelompok keamanan untuk memungkinkan akses ke instance melalui port yang berbeda dan protokol. Misalnya, Anda dapat mengubah aturan untuk memungkinkan akses ke instance melalui SSH, ping instance, atau untuk mengizinkan traffic UDP; misalnya, untuk server DNS berjalan pada sebuah instance. Anda menentukan parameter berikut untuk aturan:

source: You can modify these examples for your specific use cases.
id: Anda dapat mengubah contoh tersebut untuk kasus penggunaan spesifik Anda.
