Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: After the server is built, if you change the server name in the API or change the host name directly, the names are not updated in the dashboard.
id: Setelah server dibangun, jika Anda mengubah nama server di API atau mengubah hostname langsung, nama-nama tidak diperbarui di dashboard.

source: After the stack is created, click on the stack name to see the following details:
id: Setelah stack dibuat, klik pada nama stack untuk melihat rincian sebagai berikut:

source: After you associate the IP address and configure security group rules for the instance, the instance is publicly available at the floating IP address.
id: Setelah Anda mengasosiasikan alamat IP dan mengkonfigurasi aturan kelompok keamanan instance, kemudian instance ini tersedia untuk umum di alamat IP mengambang.

source: After you create one or more volumes, you can attach them to instances. You can attach a volume to one instance at a time.
id: Setelah Anda membuat satu atau lebih volume, Anda dapat menghubungkan mereka untuk instance. Anda dapat menghubungkan volume ke satu instance pada suatu waktu.

source: After you delete the instance, the system you have just installed using your ISO image remains, because the parameter ``shutdown=preserve`` was set, so run the following command.
id: Setelah Anda menghapus instance, sistem yang baru saja diinstal dengan menggunakan image ISO tetap Anda, karena parameter ``shutdown=preserve`` ditetapkan, sehingga jalankan perintah berikut.

source: After you gather required parameters, run the following command to launch an instance. Specify the server name, flavor ID, and image ID.
id: Setelah Anda mengumpulkan parameter yang diperlukan, jalankan perintah berikut untuk memulai sebuah instance. Tentukan nama server, ID flavor, dan ID image.

source: After you gather the parameters that you need to launch an instance, you can launch it from an :doc:`image<cli-nova-launch-instance-from-image>` or a :doc:`volume<cli-nova-launch-instance-from-volume>`. You can launch an instance directly from one of the available OpenStack images or from an image that you have copied to a persistent volume. The OpenStack Image service provides a pool of images that are accessible to members of different projects.
id: Setelah Anda mengumpulkan parameter yang Anda butuhkan untuk memulai sebuah instance, Anda dapat memulai dari sebuah :doc:`image<cli-nova-launch-instance-from-image>` atau :doc:`volume<cli-nova-launch-instance-from-volume>`. Anda dapat memulai sebuah instance langsung dari salah satu image OpenStack tersedia atau dari image yang telah disalin ke volume persisten (volume tetap). The OpenStack layanan Image menyediakan kolam renang image yang dapat diakses oleh anggota proyek yang berbeda.

source: Again, two items are returned, and there might be more.
id: Sekali lagi, dua barang yang dikembalikan, dan mungkin ada lebih.

source: All of OpenStack's APIs are actually REST APIs. The `keystoneauth <https://docs.openstack.org/developer/keystoneauth>`_ library provides an object that looks very much like a `Session <http://docs.python-requests.org/en/master/api/#request-sessions>`_ object from the Python `requests <http://pypi.python.org/pypi/requests>`_ library that handles all of the authentication for you. If you are more comfortable just dealing with REST or if there is a feature implemented in your cloud that has not seen support in any of the libraries yet, this option is for you.
id: Semua API OpenStack adalah benar-benar REST API. `keystoneauth <https://docs.openstack.org/developer/keystoneauth>`_ perpustakaan memberikan sebuah object yang terlihat sangat banyak seperti `Session <http://docs.python-requests.org/en/master/api/#request-sessions>`_ objek dari Python `requests <http://pypi.python.org/pypi/requests>`_ perpustakaan yang menangani semua otentikasi untuk Anda. Jika Anda merasa lebih nyaman hanya berurusan dengan REST atau jika ada suatu fitur yang diimplementasikan dalam cloud Anda yang belum terlihat mendapat dukungan di salah satu perpustakaan, pilihan ini adalah untuk Anda.

source: All of the legacy client objects can be constructed the same way - the only difference is the first argument to ``make_client``. The examples will use ``compute`` to get a nova client, but neutron can be accessed instead by replacing ``compute`` with ``network``.
id: Semua objek klien warisan (legacy client object) dapat dibangun dengan cara yang sama - satu-satunya perbedaan adalah argumen pertama untuk ``make_client``. Contoh akan menggunakan ``compute`` untuk mendapatkan klien nova, tetapi neutron dapat diakses bukan dengan penggantian ``compute`` dengan ``network``.

source: All segment objects must be in the same container.
id: Semua objek segmen harus dalam wadah (container) yang sama.

source: All users residing in project1 can read container contents:
id: Semua pengguna yang berada di project1 dapat membaca konten kontainer:

source: All users residing in project1 can write to the container:
id: Semua pengguna yang berada di project1 dapat menulis ke kontainer:

source: Allocate a floating IP address to an instance
id: Mengalokasikan alamat IP mengambang ke sebuah Instance

source: Allow UDP access from IP addresses, specified as IP subnet ``0.0.0.0/0`` in CIDR notation.
id: Mengizinkan akses UDP dari alamat IP, ditetapkan sebagai IP subnet ``0.0.0.0/0`` dalam notasi CIDR.

source: Allow access
id: Izinkan akses

source: Allow access from all IP addresses, specified as IP subnet ``0.0.0.0/0`` in CIDR notation:
id: Mengizinkan akses dari semua alamat IP, ditetapkan sebagai IP subnet ``0.0.0.0/0`` dalam notasi CIDR:

source: Allow access only from IP addresses from other security groups (source groups) to access the specified port:
id: Mengizinkan akses hanya dari alamat IP dari kelompok keamanan lainnya (kelompok sumber) untuk mengakses port tertentu:

source: Allow access.
id: Izinkan akses

source: Allow only IP addresses from other security groups (source groups) to access the specified port.
id: Hanya mengizinkan alamat IP dari kelompok keamanan lainnya (source groups) untuk mengakses port tertentu.

source: Allow only members of other security groups (source groups) to ping instances.
id: Hanya mengizinkan anggota kelompok keamanan lainnya (kelompok sumber) melakukan ping instance.

source: Allow pinging from all IP addresses, specified as IP subnet ``0.0.0.0/0`` in CIDR notation.
id: Mengizinkan ping dari semua alamat IP, ditetapkan sebagai IP subnet ``0.0.0.0/0`` dalam notasi CIDR.

source: Allow read-only access
id: Izinkan akses read-only (read-only)

source: Allow read-write access
id: Izinkan akses baca-tulis (read-write)

source: Also, the Bare Metal service supports the configuration drive.
id: Juga, layanan Bare Metal mendukung drive konfigurasi.

source: Although you cannot nest directories in OpenStack Object Storage, you can simulate a hierarchical structure within a single container by adding forward slash characters (``/``) in the object name. To navigate the pseudo-directory structure, you can use the ``delimiter`` query parameter. This example shows you how to use pseudo-hierarchical folders and directories.
id: Meskipun Anda tidak bisa membuat sarang direktori di OpenStack Object Storage, Anda dapat mensimulasikan struktur hirarki dalam satu kontainer dengan menambahkan garis miring karakter (`` / ``) dalam nama objek. Untuk menavigasi struktur pseudo-directory, Anda dapat menggunakan parameter kueri ``delimiter``. Contoh ini menunjukkan kepada Anda bagaimana menggunakan folder dan direktori pseudo-hierarchical.

source: An account
id: Sebuah akun (account)

source: An image built with a recent version of the cloud-init package can automatically access metadata passed through the configuration drive. The following table lists the references for cloud-init versions mapped to a particular operating system:
id: Image yang dibuat dengan versi terbaru dari paket cloud-init secara otomatis dapat mengakses metadata melewati drive konfigurasi. Tabel berikut mencantumkan referensi untuk versi cloud-init yang dipetakan ke sistem operasi tertentu:

source: An in-browser VNC client implemented using HTML5 Canvas and WebSockets
id: Sebuah klien VNC in-browser diimplementasikan menggunakan HTML5 Canvas dan WebSockets

source: An individual data point that is associated with a specific meter. A sample has the same attributes as the associated meter, with the addition of time stamp and value attributes. The value attribute is also known as the sample ``volume``.
id: Titik data individual (individual data point) yang terkait dengan meteran tertentu. Sampel memiliki atribut yang sama seperti meteran terkait, dengan penambahan waktu yang tertera dan nilai atribut. Nilai atribut juga dikenal sebagai sampel ``volume``.

source: An integer value which specifies the number of seconds from the time of the request to when you want to delete the object. This header is converted to a ``X-Delete-At`` header that is set to the sum of the ``X-Delete-After`` value plus the current time, in seconds.
id: Nilai integer yang menentukan jumlah detik dari waktu permintaan ketika Anda ingin menghapus objek. Header ini diubah menjadi header ``X-Delete-At`` yang diatur untuk jumlah dari nilai ``X-Delete-After`` ditambah waktu saat ini, dalam detik.

source: Any **user data** files. A user data file is a special key in the metadata service that holds a file that cloud-aware applications in the guest instance can access. For example, one application that uses user data is the `cloud-init <https://help.ubuntu.com/community/CloudInit>`__ system, which is an open-source package from Ubuntu that is available on various Linux distributions and that handles early initialization of a cloud instance.
id: File **user data**. Sebuah file data pengguna adalah kunci spesial (special key) dalam layanan metadata yang memegang sebuah file dimana aplikasi cloud-aware dalam instance tamu (quest) dapat mengakses. Misalnya, salah satu aplikasi yang menggunakan data pengguna adalah sistem `cloud-init <https://help.ubuntu.com/community/CloudInit>` __, yang merupakan paket open-source dari Ubuntu yang tersedia di berbagai distribusi Linux dan yang menangani inisialisasi awal dari instance cloud.

source: Any 2\ ``nn`` response indicates success.
id: Setiap response 2\ ``nn`` menunjukkan keberhasilan.

source: Any modern guest operating system that is capable of mounting an ISO 9660 or VFAT file system can use the configuration drive.
id: Setiap sistem operasi guest modern yang mampu pemasangan ISO 9660 atau berkas VFAT sistem dapat menggunakan drive konfigurasi.

source: Append this parameter to the URL for a ``GET`` request, where ``format`` is ``json`` or ``xml``.
id: Menambahkan parameter ini ke URL untuk permintaan ``GET``, dimana ``format`` adalah ``json`` atau ``xml``.

source: As a cloud end user, you can use the OpenStack dashboard to provision your own resources within the limits set by administrators. You can modify the examples provided in this section to create other types and sizes of server instances.
id: Sebagai pengguna akhir cloud (cloud end user), Anda dapat menggunakan dashboard OpenStack untuk penyediaan sumber daya Anda sendiri dalam batas yang ditetapkan oleh administrator. Anda dapat mengubah contoh yang diberikan dalam bagian ini untuk membuat tipe dan ukuran instance server lainnya.

source: As an OpenStack cloud end user, you can provision your own resources within the limits set by cloud administrators.
id: Sebagai pengguna akhir cloud OpenStack, Anda bisa menyediakan sumber daya Anda sendiri dalam batas yang ditetapkan oleh administrator cloud.

source: As an end user, you can create and manage load balancers and related objects for users in various projects. You can also delete load balancers and related objects.
id: Sebagai pengguna akhir (end user), Anda dapat membuat dan mengelola penyeimbang beban (load balancer) dan benda-benda terkait untuk pengguna dalam berbagai proyek. Anda juga dapat menghapus penyeimbang beban dan obyek terkait.

source: As an example, see the sample shell file that sets these variables to get credentials:
id: Sebagai contoh, lihat file shell contoh yang menetapkan variabel tersebut untuk mendapatkan mandat (credential):

source: As background, assume that you have created a database instance with the following characteristics:
id: Sebagai latar belakang, menganggap bahwa Anda telah membuat instance database dengan karakteristik sebagai berikut:

source: As shown in this example, the public URL appears in the ``StorageURL`` field, and the token appears in the ``Auth Token`` field:
id: Seperti ditunjukkan dalam contoh ini, URL publik muncul dalam field ``StorageURL``, dan token muncul di field ``Auth Token`` :

source: As you can see, the ``sync_binlog`` option is currently set to ``0`` for the ``myDB7`` database.
id: Seperti yang Anda lihat, opsi ``sync_binlog`` saat ini diatur ke ``0`` untuk database ``myDB7``.

source: As you can see, the ``sync_binlog`` option is now set to ``1``, as specified in the ``group1`` configuration group.
id: Seperti yang Anda lihat, opsi ``sync_binlog`` ini telah diatur untuk ``1``, sebagaimana ditentukan dalam kelompok konfigurasi ``group1``.

source: Ask the cloud operator for the host name or public IP address from which you can access the dashboard, and for your user name and password. If the cloud supports multi-domain model, you also need to ask for your domain name.
id: Meminta operator cloud untuk nama host atau alamat IP publik dari mana Anda dapat mengakses dashboard, dan untuk nama pengguna dan password. Jika cloud mendukung model multi-domain, Anda juga perlu menanyakan nama domain Anda.

source: Assign CORS headers to requests
id: Menetapkan header CORS untuk permintaan (request)

source: Assign a name to the virtual machine.
id: Menetapkan nama untuk mesin virtual.

source: Associate an IP address with an instance in the project, as follows:
id: Mengasosiasikan alamat IP dengan sebuah instance dalam proyek, sebagai berikut:

source: Associate floating IP addresses
id: Lakukan asosiasi alamat IP mengambang

source: Associate the floating IP address with an instance of the project. Only one floating IP address can be allocated to an instance at any given time.
id: Mengasosiasikan alamat IP mengambang dengan instance proyek. Hanya satu alamat IP mengambang dapat dialokasikan ke sebuah instance pada waktu tertentu.

source: Assume that you have installed the Database service and populated your data store with images for the type and versions of databases that you want, and that you can create and access a database.
id: Asumsikan bahwa Anda telah menginstal layanan Database dan dihuni penyimpanan data Anda dengan image untuk tipe dan versi database yang Anda inginkan, dan bahwa Anda dapat membuat dan mengakses database.

source: Assume the following list of container names:
id: Asumsikan berikut daftar nama kontainer:

source: Assured. The list of segments includes the MD5 checksum (``ETag``) of each segment. You cannot upload the manifest object if the ``ETag`` in the list differs from the uploaded segment object. If a segment is somehow lost, an attempt to download the manifest object results in an error.
id: Terjamin. Daftar segmen memasukkan MD5 checksum (``ETag``) dari setiap segmen. Anda tidak dapat meng-upload objek nyata (manifest) jika ``ETag`` dalam daftar berbeda dari objek segmen upload. Jika segmen hilang, upaya untuk men-download hasil objek nyata dalam kesalahan.

source: At the prompt, type ``yes``.
id: Pada prompt, ketik ``yes``.

source: At this point, you might want to delete the disabled ``guest1`` instance, by using the :command:`trove delete` command.
id: Pada titik ini, Anda mungkin ingin menghapus instance ``guest1`` disabled, dengan menggunakan perintah :command:`trove delete`.

source: Attach a volume to an instance
id: Hubungkan volume ke sebuah instance

source: Attach a volume to an instance after the instance is active, and the volume is available
id: Hubungkan volume ke sebuah instance setelah instance aktif, dan volume tersedia

source: Attach swap or ephemeral disk to an instance
id: Menghubungkan swap atau fana disk (ephemeral disk) pada sebuah instance

source: Attach the configuration group to the database instance:
id: Menghubungkan kelompok konfigurasi ke instance database:

source: Attach the instance to the volume:
id: Hubungkan instance ke volume:

source: Authenticate
id: Authenticate (membuktikan)

source: Auto-extract archive files
id: File arsip auto-ekstrak

source: Auto-extract archive request
id: Permintaan arsip auto-extract

source: Auto-extract archive response
id: Tanggapan (response) arsip auto-extract

source: Availability Zone
id: Zona Tersedia (Availability Zone)

source: Available Metadata
id: Metadata tersedia

source: Back up the database instance by using the :command:`trove backup-create` command. In this example, the backup is called ``backup1``. In this example, replace ``INSTANCE_ID`` with ``97b4b853-80f6-414f-ba6f-c6f455a79ae6``:
id: Back up database instance dengan menggunakan perintah :command:`trove backup-create`. Dalam contoh ini, cadangan ini disebut ``backup1``. Dalam contoh ini, menggantikan ``INSTANCE_ID`` dengan ``97b4b853-80f6-414f-ba6f-c6f455a79ae6``:

source: Backup and restore a database
id: Backup and restore database (cadangan dan mengembalikan database)

source: Based on your selection for :guilabel:`Image Source`, you either enter the location URL of the image in the :guilabel:`Image Location` field, or browse for the image file on your file system and add it.
id: Berdasarkan pilihan Anda untuk :guilabel:`Image Source`, Anda memasukkan URL lokasi image di field (kolom) :guilabel:`Image Location`, atau cari file image pada sistem file Anda dan menambahkannya.

source: Because the dashboard does not let you choose a specific datastore to use with an instance, you need to configure a default datastore. The dashboard then uses the default datastore to create the instance.
id: Karena dashboard tidak membiarkan Anda memilih datastore spesifik untuk digunakan dengan sebuah instance, Anda perlu mengkonfigurasi datastore default. Dashboard kemudian menggunakan datastore standar untuk membuat instance.

source: Because two container names are returned, there are more names to list.
id: Karena dua nama kontainer dikembalikan, ada lebih nama untuk daftar.

source: Before you begin, source the OpenStack RC file.
id: Sebelum Anda mulai, dapatkan sumber file OpenStack RC.

source: Before you can launch an instance, gather the following parameters:
id: Sebelum Anda dapat memulai sebuah instance, kumpulkan parameter berikut:

source: Before you can upload objects that are larger than 5 GB, you must segment them. You upload the segment objects like you do with any other object and create a dynamic large manifest object. The manifest object tells Object Storage how to find the segment objects that comprise the large object. You can still access each segment individually, but when you retrieve the manifest object, the API concatenates the segments. You can include any number of segments in a single large object.
id: Sebelum Anda dapat meng-upload object yang lebih besar dari 5 GB, Anda harus memotong mereka. Anda meng-upload object segmen seperti yang Anda lakukan dengan object lain dan menciptakan dinamika objek nyata (manifest) besar. Objek manifest memberitahu Object Storage bagaimana menemukan object segmen yang terdiri dari objek besar. Anda masih dapat mengakses setiap segmen individual, tetapi ketika Anda mengambil objek nyata, API merangkai segmen. Anda dapat menyertakan sejumlah segmen dalam sebuah objek tunggal yang besar.

source: Before you launch an instance, you should add security group rules to enable users to ping and use SSH to connect to the instance. Security groups are sets of IP filter rules that define networking access and are applied to all instances within a project. To do so, you either add rules to the default security group :ref:`security_groups_add_rule` or add a new security group with rules.
id: Sebelum Anda memulai sebuah instance, Anda harus menambahkan aturan kelompok keamanan untuk mengaktifkan pengguna melakukan ping dan menggunakan SSH untuk koneksi ke instance. Kelompok keamanan adalah set aturan filter IP yang mendefinisikan jaringan akses dan diterapkan untuk semua instance dalam suatu proyek. Untuk melakukannya, Anda menambah aturan untuk kelompok keamanan default :ref: `security_groups_add_rule` ataupun menambahkan kelompok keamanan baru dengan aturan.

source: Before you run commands, `set environment variables using the OpenStack RC file <https://docs.openstack.org/user-guide/common/cli-set-environment-variables-using-openstack-rc.html>`_.
id: Sebelum Anda menjalankan perintah, `set environment variables using the OpenStack RC file <https://docs.openstack.org/user-guide/common/cli-set-environment-variables-using-openstack-rc.html>`_.

source: Before you use the newly-created configuration group, look at how the ``sync_binlog`` option is configured on your database. Replace the following sample connection values with values that connect to your database:
id: Sebelum Anda menggunakan kelompok konfigurasi yang baru dibuat (newly-created configuration group), lihat bagaimana opsi ``sync_binlog`` dikonfigurasi pada database Anda. Gantilah nilai hubungan sampel berikut dengan nilai yang menghubungkan ke database Anda:

source: Boot a new instance from the snapshot
id: Boot instance baru dari snapshot

source: Boot an instance and attach to volume
id: Boot instance dan mengkaitkan volume

source: Boot an instance from an ISO image
id: Boot sebuah instance dari sebuah image ISO

source: Boot an instance from an image and attach a non-bootable volume.
id: Boot sebuah instance dari sebuah image dan menghubungkan volume non-bootable.

source: Boot an instance using flavor and image names (if names are unique)
id: Boot instance menggunakan nama flavor dan image (jika mempunyai nama unik)

source: Boot from image
id: Boot dari image

source: Boot from image (creates a new volume)
id: Boot dari image (menciptakan volume baru)

source: Boot from snapshot
id: Boot dari snapshot

source: Boot from volume
id: Boot dari volume

source: Boot from volume snapshot (creates a new volume)
id: Boot dari volume snapshot (menciptakan volume baru)

source: Boot instance from image and attach non-bootable volume
id: Boot instance dari image dan menghubungkan volume non-bootable

source: Browse to and select the file that you want to upload.
id: Browse ke dan pilih file yang ingin Anda upload.

source: Bulk delete
id: Bulk delete (penghapusan massal)

source: Bulk delete request
id: Bulk delete request (permintaan penghapusan massal)

source: Bulk delete response
id: Bulk delete response (tanggapan penghapusan massal)

source: Bulk-configure a database or databases
id: Konfigurasi massal database (bulk-configure database)

source: By default, the Object Storage API uses a ``text/plain`` response format. In addition, both JSON and XML data serialization response formats are supported.
id: Secara default, Object Storage API menggunakan format respon ``text/plain`` . Selain itu, kedua format respon serialisasi data JSON dan XML juga didukung.

source: By default, the content of an object cannot be greater than 5 GB. However, you can use a number of smaller objects to construct a large object. The large object is comprised of two types of objects:
id: Secara default, isi dari sebuah objek tidak dapat lebih besar dari 5 GB. Namun, Anda dapat menggunakan sejumlah objek yang lebih kecil untuk membangun sebuah objek besar. Objek besar terdiri dari dua jenis object:
