Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: If the image uses a static root password or a static key set (neither is recommended), you do not need to provide a key pair to launch the instance.
id: Jika image menggunakan password root statis atau satu set kunci statis (tidak disarankan), Anda tidak perlu memberikan sepasang kunci (key pair) untuk meluncurkan instance.

source: If the original instance goes down, you can detach the replica. The replica becomes a standalone database instance. You can then take the new standalone instance and create a new replica of that instance.
id: Jika instance asli turun, Anda dapat melepaskan replika. Replika menjadi instance database standalone. Anda kemudian dapat mengambil instance mandiri (standalone) baru dan membuat replika baru dari instance itu.

source: If the resize fails or does not work as expected, you can revert the resize. For example:
id: Jika resize gagal atau tidak bekerja seperti yang diharapkan, Anda dapat mengembalikan ukurannya. Sebagai contoh:

source: If the server exists, run the ``delete`` method of the ``nova_client.servers`` object:
id: Jika server ada, jalankan metode ``delete`` dari objek ``nova_client.servers``:

source: If the status for the instance is ACTIVE, the instance is online.
id: Jika status instance adalah ACTIVE, instance online.

source: If this list is empty, the cloud administrator must configure a pool of floating IP addresses. This command is only available in ``nova-network``. If you use the OpenStack Networking service, run the following command to list external networks:
id: Jika daftar ini kosong, administrator awan harus mengkonfigurasi kumpulan alamat IP terapung. Perintah ini hanya tersedia di ``nova-network``. Jika Anda menggunakan layanan OpenStack Networking, jalankan perintah berikut untuk menampilkan jaringan eksternal:

source: If true, set the variable name ``server_exists`` to ``True`` and break from the for loop:
id: Jika benar, tetapkan nama variabel ``server_exists`` untuk ``True`` dan istirahat (break) dari for loop:

source: If validation fails, the response returns an error message.
id: Jika validasi gagal, respon akan kembalikan pesan kesalahan.

source: If you are an admin user, this command will list groups for all tenants.
id: Jika Anda adalah seorang pengguna admin, perintah ini akan menampilkan kelompok untuk semua penyewa (tenant)

source: If you are logged in as an administrator, the :guilabel:`Project` tab (:ref:`dashboard-project-tab`) and :guilabel:`Admin` tab (:ref:`dashboard-admin-tab`) and :guilabel:`Identity` tab (:ref:`dashboard-identity-tab`) are displayed.
id: Jika Anda login sebagai administrator, tab :guilabel:`Project` (:ref:`dashboard-project-tab`) dan tab :guilabel:`Admin` (:ref:`dashboard-admin-tab`) dan tab :guilabel:`Identity` (:ref:`dashboard-identity-tab`) akan ditampilkan

source: If you are logged in as an end user, the :guilabel:`Project` tab (:ref:`dashboard-project-tab`) and :guilabel:`Identity` tab (:ref:`dashboard-identity-tab`) are displayed.
id: Jika Anda login sebagai pengguna akhir, tab :guilabel:`Project` (:ref:`dashboard-project-tab`) dan tab :guilabel:`Identity` (:ref:`dashboard-identity-tab`) akan ditampilkan.

source: If you are using the Dashboard from a Windows computer, use PuTTYgen to load the ``*.pem`` file and convert and save it as ``*.ppk``. For more information see the `WinSCP web page for PuTTYgen <http://winscp.net/eng/docs/ui_puttygen>`__.
id: Jika Anda menggunakan Dashboard dari komputer Windows, gunakan PuTTYgen untuk memuat (load) file `` *.pem`` dan mengkonversi dan menyimpannya sebagai `` *.ppk``. Untuk informasi lebih lanjut lihat `WinSCP web page for PuTTYgen <http://winscp.net/eng/docs/ui_puttygen>`__.

source: If you authenticate against an endpoint that uses a custom authentication back end, you must provide the name of the plugin in the ``auth_type`` parameter.
id: Jika Anda mengotentikasi terhadap titik akhir (endpoint) yang menggunakan otentikasi kustom back end, Anda harus memberikan nama plugin di parameter ``auth_type``.

source: If you boot an instance with an INSTANCE_NAME greater than 63 characters, Compute truncates it automatically when turning it into a host name to ensure the correct work of dnsmasq. The corresponding warning is written into the ``neutron-dnsmasq.log`` file.
id: Jika anda boot sebuah instance dengan INSTANCE_NAME lebih besar dari 63 karakter, Compute memotong secara otomatis ketika mengubahnya menjadi nama host untuk memastikan pekerjaan yang benar dnsmasq. Peringatan yang sesuai ditulis ke dalam file ``neutron-dnsmasq.log``.

source: If you choose VFAT, the configuration drive is 64 MB.
id: Jika Anda memilih VFAT, drive konfigurasi adalah 64 MB.

source: If you choose not to set the :guilabel:`IP Address` value, then by default OpenStack Networking uses the first host IP address in the subnet.
id: Jika Anda memilih untuk tidak mengatur value :guilabel:`IP Address`, maka secara default OpenStack Networking menggunakan alamat IP host pertama dalam subnet.

source: If you choose this option, a new field for :guilabel:`Image Name` displays. You can select the image from the list.
id: Jika Anda memilih opsi ini, kolom (field) baru untuk display :guilabel:`Image Name`. Anda dapat memilih image dari daftar.

source: If you choose this option, a new field for :guilabel:`Instance Snapshot` displays. You can select the snapshot from the list.
id: Jika Anda memilih opsi ini, field (kolom) baru untuk display :guilabel:`Instance Snapshot`. Anda dapat memilih snapshot dari daftar.

source: If you choose this option, a new field for :guilabel:`Volume` displays. You can select the volume from the list.
id: Jika Anda memilih opsi ini, field (kolom) baru untuk display :guilabel:`Volume`. Anda dapat memilih volume dari daftar.

source: If you desire a specific micro-version of the Nova API, you can pass that as the ``version`` parameter:
id: Jika Anda menginginkan micro-version spesifik dari Nova API, Anda dapat melewati itu sebagai parameter ``version``:

source: If you did not provide a key pair, security groups, or rules, users can access the instance only from inside the cloud through VNC. Even pinging the instance is not possible without an ICMP rule configured.
id: Jika Anda tidak memberikan sepasang kunci, kelompok keamanan, atau aturan, pengguna dapat mengakses instance hanya dari dalam cloud melalui VNC. Bahkan ping instance tidak mungkin tanpa aturan ICMP dikonfigurasi.

source: If you did not provide a key pair, security groups, or rules, you can access the instance only from inside the cloud through VNC. Even pinging the instance is not possible.
id: Jika Anda tidak memberikan kunci pasangan, kelompok keamanan, atau aturan, Anda dapat mengakses instance hanya dari dalam cloud melalui VNC. Bahkan ping instance tidak mungkin.

source: If you have a custom flavor that meets the needs of the database that you want to create, proceed to :ref:`Step 2 <create-database-instance>` and use that flavor.
id: Jika Anda memiliki flavor khusus yang memenuhi kebutuhan database yang ingin Anda buat, lanjutkan ke :ref:`Step 2 <create-database-instance>` dan menggunakan flavor itu.

source: If you have a large number of containers or objects, you can use the ``marker``, ``limit``, and ``end_marker`` parameters to control how many items are returned in a list and where the list starts or ends.
id: Jika Anda memiliki sejumlah besar kontainer atau objek, Anda dapat menggunakan parameter ``marker``, ``limit``, dan ``end_marker`` untuk mengontrol berapa banyak barang yang dikembalikan dalam daftar dan dimana daftar dimulai atau berakhir.

source: If you have already generated a key pair and the public key is located at ``~/.ssh/id_rsa.pub``, run the following command to upload the public key.
id: Jika Anda telah menghasilkan sepasang kunci dan kunci publik terletak di ``~/.ssh/id_rsa.pub``, jalankan perintah berikut untuk meng-upload kunci publik.

source: If you have already generated a keypair with the public key located at ``~/.ssh/id_rsa.pub``, pass the contents of the file to the `novaclient.v1\_1.keypairs.KeypairManager.create <http://docs. openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs .html#novaclient.v1_1.keypairs.KeypairManager.create>`__ method to import the public key to Compute:
id: Jika Anda telah dihasilkan sepasang kunci (keypair) dengan kunci publik (public key) yang terletak di ``~/.ssh/id_rsa.pub``, lewatkan isi file ke metode `novaclient.v1\_1.keypairs.KeypairManager.create <http://docs. openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs .html#novaclient.v1_1.keypairs.KeypairManager.create>`__ untuk mengimpor kunci publik (public key) ke Compute:

source: If you have generated a key pair with an external tool, you can import it into OpenStack. The key pair can be used for multiple instances that belong to a project. For more information, see the section :ref:`dashboard_import_keypair`.
id: Jika Anda telah menghasilkan sepasang kunci (key pair) dengan alat eksternal, Anda dapat mengimpor ke OpenStack. Pasangan kunci dapat digunakan untuk beberapa instance milik proyek. Untuk informasi lebih lanjut, lihat bagian :ref: `dashboard_import_keypair`.

source: If you have not created any security groups, you can assign only the default security group to the instance.
id: Jika Anda belum membuat kelompok keamanan, Anda hanya dapat menetapkan kelompok standar keamanan untuk instance.

source: If you have not created any security groups, you can assign the instance to only the default security group.
id: Jika Anda belum membuat kelompok keamanan, Anda dapat menetapkan instance untuk hanya kelompok keamanan default.

source: If you no longer want to expire the object, you can remove the ``X-Delete-At`` header:
id: Jika Anda tidak ingin lagi mengakhiri objek, Anda dapat menghapus header ``X-Delete-At``:

source: If you use Xen with a configuration drive, use the ``xenapi_disable_agent`` configuration parameter to disable the agent.
id: Jika Anda menggunakan Xen dengan konfigurasi drive, gunakan parameter konfigurasi ``xenapi_disable_agent`` untuk menonaktifkan agen.

source: If you use a manifest object as the source of a ``COPY`` request, the new object is a normal, and not a segment, object. If the total size of the source segment objects exceeds 5 GB, the ``COPY`` request fails. However, you can make a duplicate of the manifest object and this new object can be larger than 5 GB.
id: Jika Anda menggunakan objek bermanifestasi sebagai sumber dari permintaan ``COPY``, objek baru adalah objek normal, dan tidak segmen,. Jika ukuran total sumber objek segmen melebihi 5 GB, permintaan ``COPY`` gagal. Namun, Anda dapat membuat duplikat dari objek nyata dan objek baru ini bisa lebih besar dari 5 GB.

source: If you use the ``DELETE`` operation on a manifest object, the manifest object is deleted. The segment objects are not affected. However, if you add the ``?multipart-manifest=delete`` query parameter, the segment objects are deleted and if all are successfully deleted, the manifest object is also deleted.
id: Jika Anda menggunakan operasi ``DELETE`` pada objek nyata (manifest) , objek nyata dihapus. Object segmen tidak terpengaruh. Namun, jika Anda menambahkan parameter query ``?multipart-manifest = delete`` , obyek segmen akan dihapus dan jika semua berhasil dihapus, objek nyata juga dihapus.

source: If you use the bare-metal driver, you must create a network interface and add it to a bare-metal node. Then, you can launch an instance from a bare-metal image.
id: Jika Anda menggunakan driver bare-metal, Anda harus membuat antarmuka jaringan dan menambahkannya ke node bare-metal. Kemudian, Anda dapat memulai sebuah instance dari image bare-metal.

source: If you want to create a volume to a specific storage backend, you need to use an image which has *cinder_img_volume_type* property. In this case, a new volume will be created as *storage_backend1* volume type.
id: Jika Anda ingin membuat volume ke backend penyimpanan tertentu, Anda perlu menggunakan image yang memiliki properti *cinder_img_volume_type*. Dalam hal ini, volume baru akan dibuat sebagai tipe volume *storage_backend1 *.

source: If you wish to apply a module, you must create the module first and register it with the trove service. A user can not directly apply a module to a trove instance.
id: Jika Anda ingin menerapkan modul, Anda harus membuat modul terlebih dahulu dan mendaftarkannya dengan layanan trove. Seorang pengguna tidak bisa langsung menerapkan modul ke instance trove.

source: If your environment does not have a suitable flavor, an administrative user must create a custom flavor by using the :command:`openstack flavor create` command.
id: Jika lingkungan Anda tidak memiliki flavor cocok, pengguna administratif harus menciptakan flavor kustom dengan menggunakan perintah :command:`openstack flavor create`.

source: If your guest operating system does not use ``udev``, the ``/dev/disk/by-label`` directory is not present.
id: Jika sistem operasi guest Anda tidak menggunakan ``udev``, direktori ``/dev/disk/by-label`` tidak hadir.

source: If your guest operating system supports accessing disk by label, you can mount the configuration drive as the ``/dev/disk/by-label/configurationDriveVolumeLabel`` device. In the following example, the configuration drive has the ``config-2`` volume label:
id: Jika sistem operasi guest Anda mendukung mengakses disk dengan label, Anda dapat me-mount drive konfigurasi sebagai perangkat ``/dev/disk/by-label/configurationDriveVolumeLabel``. Pada contoh berikut, drive konfigurasi memiliki label volume ``config-2``:

source: Image Name
id: Nama Image

source: Image that you have copied to a persistent volume. The instance launches from the volume, which is provided by the ``cinder-volume`` API through iSCSI.
id: Image dimana Anda telah menyalin ke volume persisten. Instance meluncur dari volume, yang disediakan oleh API ``cinder-volume`` melalui iSCSI.

source: Image: If you choose this option, a new field for :guilabel:`Use image as a source` displays. You can select the image from the list.
id: Image: Jika Anda memilih opsi ini, filed baru untuk menampilkan :guilabel:`Use image as a source`. Anda dapat memilih image dari daftar.

source: Images uploaded to the Image service.
id: Image yang diunggah ke layanan Image.

source: Import a key pair
id: Import key pair

source: Import a keypair
id: Mengimpor sepasang kunci (keypair)

source: Import the following modules:
id: Mengimpor modul berikut:

source: Import the snapshot to the new environment
id: Impor snapshot dengan lingkungan baru

source: In CirrOS, the password for user ``cirros`` is ``cubswin:)``. For any other operating system, use SSH keys.
id: Dalam CirrOS, password untuk pengguna ``cirros`` adalah `` cubswin:) ``. Untuk sistem operasi lain, menggunakan kunci SSH.

source: In OpenStack Object Storage, containers provide storage for objects in a manner similar to a Windows folder or Linux file directory, though they cannot be nested. An object in OpenStack consists of the file to be stored in the container and any accompanying metadata.
id: Dalam OpenStack Object Storage, wadah (container) menyediakan penyimpanan untuk objek dalam cara yang mirip dengan folder Windows atau direktori file Linux, meskipun mereka tidak dapat bersarang. Obyek dalam OpenStack terdiri dari file yang akan disimpan dalam kontainer dan metadata yang menyertainya.

source: In addition to these ways of interacting with a cloud, you can access the OpenStack APIs directly or indirectly through `cURL <http://curl.haxx.se>`__ commands or open SDKs. You can automate access or build tools to manage resources and services by using the OpenStack APIs.
id: Selain cara berinteraksi dengan awan ini, Anda dapat mengakses OpenStack API secara langsung atau tidak langsung melalui perintah `cURL <http://curl.haxx.se>` __ atau buka SDK. Anda dapat mengotomatisasi akses atau membangun alat untuk mengelola sumber daya dan layanan dengan menggunakan OpenStack API.

source: In addition, this command specifies these options for the instance:
id: Selain itu, perintah ini menentukan opsi ini untuk instance:

source: In addition, you must:
id: Selain itu, Anda harus:

source: In current version (Liberty) of OpenStack Compute, live migration with ``config_drive`` on local disk is forbidden due to the bug in libvirt of copying a read-only disk. However, if we use VFAT as the format of ``config_drive``, the function of live migration works well.
id: Dalam versi saat ini (Liberty) dari OpenStack Compute, migrasi hidup dengan ``config_drive`` pada disk lokal dilarang karena bug di libvirt menyalin disk read-only. Namun, jika kita menggunakan VFAT sebagai format ``config_drive``, fungsi migrasi hidup bekerja dengan baik.

source: In order for object expiration to work properly, the ``swift-object-expirer`` daemon will need access to all backend servers in the cluster. The daemon does not need access to the proxy-server or public network.
id: Agar objek kedaluwarsa untuk bekerja dengan baik, daemon ``swift-object-expirer`` akan memerlukan akses ke semua server backend di cluster. Daemon tidak perlu akses ke proxy-server atau jaringan publik.

source: In some cases, the ``/info`` request will return an error. This could be because your service provider has disabled the ``/info`` request function, or because you are using an older version that does not support it.
id: Dalam beberapa kasus, permintaan ``/info`` akan kembali kesalahan. Ini bisa jadi karena penyedia layanan Anda telah menonaktifkan fungsi permintaan ``/info`` , atau karena Anda menggunakan versi lama yang tidak mendukung itu.

source: In the :guilabel:`Actions` column, click :guilabel:`Create Snapshot`.
id: Dalam kolom :guilabel:`Actions`, klik :guilabel:`Create Snapshot`.

source: In the :guilabel:`Actions` column, click :guilabel:`Edit Volume`.
id: Dalam kolom :guilabel:`Actions`, klik :guilabel:`Edit Volume`.

source: In the :guilabel:`Actions` column, click the menu button and then select :guilabel:`Edit Image` from the list.
id: Dalam kolom :guilabel:`Actions`, klik tombol menu dan kemudian pilih :guilabel:`Edit Image` dari daftar.

source: In the :guilabel:`Add Interface` dialog box, select a :guilabel:`Subnet`.
id: Dalam dialog box :guilabel:`Add Interface` , pilih :guilabel:`Subnet`.

source: In the :guilabel:`Add Rule` dialog box, enter the following values:
id: Dalam dialog box :guilabel:`Add Rule` , masukkan nilai berikut:

source: In the :guilabel:`Backup Database` dialog box, specify the following values:
id: Dalam dialog box :guilabel:`Backup Database` , tentukan nilai berikut:

source: In the :guilabel:`Confirm Delete Images` dialog box, click :guilabel:`Delete Images` to confirm the deletion.
id: Dalam dialog box :guilabel:`Confirm Delete Images` , klik :guilabel:`Delete Images` untuk mengkonfirmasi penghapusan.

source: In the :guilabel:`Copy Object` launch dialog box, enter the following values:
id: Dalam kotak dialog meluncurkan :guilabel:`Copy Object`, masukkan nilai berikut:

source: In the :guilabel:`Create Container` dialog box, enter a name for the container, and then click :guilabel:`Create`.
id: Dalam dialog box :guilabel:`Create Container` , masukkan nama untuk wadah, lalu klik :guilabel:`Create`.

source: In the :guilabel:`Create Key Pair` dialog box, enter a name for your key pair, and click :guilabel:`Create Key Pair`.
id: Dalam dialog box :guilabel:`Create Key Pair` , masukkan nama untuk sepasang kunci (key pair) Anda, dan klik :guilabel:`Create Key Pair`.

source: In the :guilabel:`Create Network` dialog box, specify the following values.
id: Dalam dialog box :guilabel:`Create Network` , tentukan nilai berikut.

source: In the :guilabel:`Create Port` dialog box, specify the following values.
id: Dalam dialog box :guilabel:`Create Port` , menentukan nilai berikut.

source: In the :guilabel:`Create Router` dialog box, specify a name for the router and :guilabel:`External Network`, and click :guilabel:`Create Router`.
id: Dalam dialog box :guilabel:`Create Router` , tentukan nama untuk router dan :guilabel:`External Network`, dan klik :guilabel:`Create Router`.

source: In the :guilabel:`Create Snapshot` dialog box, enter a name for the snapshot, and click :guilabel:`Create Snapshot`.
id: Dalam dialog box :guilabel:`Create Snapshot` , masukkan nama untuk snapshot, dan klik :guilabel:`Create Snapshot`.

source: In the :guilabel:`Edit Image` dialog box, you can perform various actions. For example:
id: Dalam dialog box :guilabel:`Edit Image` , Anda dapat melakukan berbagai tindakan. Sebagai contoh:

source: In the :guilabel:`Edit Volume` dialog box, update the name and description of the volume.
id: Dalam dialog box :guilabel:`Edit Volume` , perbarui (update) nama dan deskripsi dari volume.

source: In the :guilabel:`Floating IPs` list, click :guilabel:`Associate`.
id: Dalam daftar :guilabel:`Floating IPs`, klik :guilabel:`Associate`.

source: In the :guilabel:`Import Key Pair` dialog box, enter the name of your key pair, copy the public key into the :guilabel:`Public Key` box, and then click :guilabel:`Import Key Pair`.
id: Dalam dialog box :guilabel:`Import Key Pair` , masukkan nama pasangan kunci (key pair) Anda, salinlah kunci publik ke dalam box :guilabel:`Public Key`, dan kemudian klik :guilabel:`Import Key Pair`.

source: In the :guilabel:`Launch Database` dialog box, specify the following values.
id: Dalam dialog box :guilabel:`Launch Database` , tentukan nilai berikut.

source: In the :guilabel:`Launch Database` dialog box, specify the values you want for the new database instance.
id: Dalam dialog box :guilabel:`Launch Database` , tentukan nilai yang Anda inginkan untuk instance database baru.

source: In the :guilabel:`Launch Instance` dialog box, specify the following values:
id: Dalam dialog box :guilabel:`Launch Instance` , tentukan nilai berikut:

source: In the :guilabel:`Launch Stack` dialog box, specify the following values:
id: Dalam dialog box :guilabel:`Launch Stack` , tentukan nilai berikut:

source: In the :guilabel:`Manage Floating IP Associations` dialog box, choose the following options:
id: Dalam dialog box :guilabel:`Manage Floating IP Associations` , pilih opsi berikut:

source: In the :guilabel:`Manage Volume Attachments` dialog box, select an instance.
id: Dalam dialog box :guilabel:`Manage Volume Attachments` , pilihlah instance.

source: In the :guilabel:`Port to be associated` field, select a port from the list.
id: Dalam field (kolom) :guilabel:`Port to be associated`, pilih port dari daftar.

source: In the :guilabel:`Resize Database Instance` dialog box, expand the drop down menu in the :guilabel:`New Flavor` field. Select the new flavor you want for the instance.
id: Dalam dialog box :guilabel:`Resize Database Instance` , perluas drop down menu di field (kolom) :guilabel:`New Flavor`. Pilih flavor baru yang Anda inginkan instance.

source: In the :guilabel:`Resize Database Volume` dialog box, fill in the :guilabel:`New Size` field with an integer indicating the new size you want for the instance. Express the size in GB, and note that the new size must be larger than the current size.
id: Dalam dialog box :guilabel:`Resize Database Volume` , isi dalam field (kolom) :guilabel:`New Size` dengan sebuah integer yang menunjukkan ukuran baru dimana Anda menginginkan instance. Menyatakan ukuran dalam GB, dan perhatikan bahwa ukuran baru harus lebih besar dari ukuran saat ini.

source: In the :guilabel:`Select Template` dialog box, select the new template source or environment source.
id: Dalam dialog box :guilabel:`Select Template` , pilih sumber template baru atau sumber lingkungan.
