Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: Do not rely on the presence of the EC2 metadata in the configuration drive, because this content might be removed in a future release. For example, do not rely on files in the ``ec2`` directory.
id: Jangan mengandalkan kehadiran metadata EC2 di drive konfigurasi, karena konten ini mungkin dihapus di masa mendatang. Misalnya, tidak bergantung pada file dalam direktori ``ec2``.

source: Download binary image data
id: Download binary image data (unduh data citra biner)

source: Download the snapshot as an image
id: Ambil snapshot sebagai image

source: Download the snapshot by using the image ID that was returned in the previous step:
id: Download snapshot dengan menggunakan ID image yang telah dikembalikan ke dalam langkah sebelumnya:

source: Dynamic large object
id: Objek besar Dinamis

source: Dynamic large objects
id: Dynamic large objects (objek besar yang dinamis)

source: EC2 metadata format
id: Format metadata EC2

source: Each OpenStack project has its own Python library. These libraries are bundled with the command-line clients. For example, the Python bindings for the Compute API are bundled with the python-novaclient package.
id: Setiap proyek OpenStack memiliki perpustakaan Python sendiri. Perpustakaan ini dibundel dengan klien baris perintah. Misalnya, Python bindings for the Compute API dibundel dengan paket python-novaclient.

source: Each OpenStack project produces a client library that wraps its own REST API. Unless there is no other choice for some reason, the per-project libraries should be avoided.
id: Setiap proyek OpenStack menghasilkan perpustakaan klien yang membungkus REST API sendiri. Kecuali tidak ada pilihan lain untuk beberapa alasan, perpustakaan per-proyek harus dihindari.

source: Each cluster includes at least one query router and one config server. Query routers and config servers count against your quota. When you delete a cluster, the system deletes the associated query router(s) and config server(s).
id: Setiap cluster meliputi setidaknya satu router kueri dan satu server config. Router kueri dan server config menggunakan kuota Anda. Ketika Anda menghapus sebuah kluster, sistem akan menghapus router kueri dan server config terkait.

source: Each cluster includes:
id: Setiap kluster meliputi:

source: Each instance has a private, fixed IP address and can also have a public, or floating IP address. Private IP addresses are used for communication between instances, and public addresses are used for communication with networks outside the cloud, including the Internet.
id: Setiap instance memiliki, alamat IP pribadi yang tetap dan juga dapat memiliki alamat IP publik, atau alamat IP mengambang. Alamat IP pribadi yang digunakan untuk komunikasi antar instance, dan alamat publik yang digunakan untuk komunikasi dengan jaringan luar cloud, termasuk Internet.

source: Each port that listens for traffic on a particular load balancer is configured separately and tied to the load balancer. Multiple listeners can be associated with the same load balancer.
id: Setiap port yang mendengarkan untuk lalu lintas pada penyeimbang beban tertentu dikonfigurasi secara terpisah dan diikat dengan penyeimbang beban. Beberapa pendengar dapat dikaitkan dengan penyeimbang beban yang sama.

source: Edit a volume
id: Edit volume

source: Edit security service
id: Edit layanan keamanan

source: Edit share network
id: Edit jaringan bersama

source: Enable CSS for file listing
id: Aktifkan CSS untuk daftar file

source: Enable and access the configuration drive
id: Mengaktifkan dan mengakses drive konfigurasi

source: Enable file listing
id: Aktifkan daftar file

source: End-to-end integrity
id: Integritas end-to-end

source: Ensure that you use at least version 0.3.1 of CirrOS for configuration drive support.
id: Pastikan bahwa Anda menggunakan setidaknya versi 0.3.1 dari CirrOS untuk dukungan konfigurasi drive.

source: Enter a brief description of the image.
id: Masukkan deskripsi singkat tentang image.

source: Enter a name for the image.
id: Masukkan nama untuk image.

source: Enter a name for the object.
id: Masukkan nama untuk objek.

source: Enter a name for the pseudo-folder.
id: Masukkan nama untuk pseudo-folder.

source: Enter a name to identify the stack.
id: Masukkan nama untuk mengidentifikasi stack.

source: Enter new values for any parameters that you want to update.
id: Masukkan nilai baru untuk setiap parameter yang ingin Anda memperbarui.

source: Enter the following values:
id: Masukkan nilai berikut:

source: Enter the name of the device from which the volume is accessible by the instance.
id: Masukkan nama perangkat yang volume dapat diakses oleh instance.

source: Environment variables required to run examples
id: Variabel lingkungan yang diperlukan untuk menjalankan contoh

source: Environment variables via an openrc.sh file
id: Variabel lingkungan melalui file openrc.sh

source: Error pages are served with the status code pre-pended to the name of the error page you set. For instance, if you set ``X-Container-Meta-Web-Error`` to ``error.html``, 401 errors will display the page ``401error.html``. Similarly, 404 errors will display ``404error.html``. You must have both of these pages created in your container when you set the ``X-Container-Meta-Web-Error`` metadata, or your site will display generic error pages.
id: Halaman error disajikan dengan kode status pra-pended dengan nama halaman error yang Anda ditetapkan. Misalnya, jika Anda menetapkan ``X-Container-Meta-Web-Error`` untuk ``error.html``, kesalahan 401 akan menampilkan halaman ``401error.html``. Demikian pula, kesalahan 404 akan menampilkan ``404error.html``. Anda harus memiliki kedua halaman dibuat dalam kontainer Anda ketika Anda menetapkan metadata ``X-Container-Meta-Web-Error``, atau situs Anda akan menampilkan halaman error generik.

source: Errors. A list of object names and associated error statuses for the objects that failed to delete. The format depends on the value that you set in the ``Accept`` header.
id: Errors (kesalahan). Daftar nama objek dan terkait status kesalahan untuk objek yang gagal untuk menghapus. Format tergantung pada nilai yang Anda tetapkan dalam header ``Accept``.

source: Events
id: Kejadian

source: Example:
id: Contoh:

source: Example 1. JSON example with format query parameter
id: Contoh 1. Contoh JSON dengan parameter keri format

source: Example 2. XML example with Accept header
id: Contoh 2. Contoh XML dengan header Accept

source: Extend share
id: Memperluas share

source: Extend share.
id: Memperluas share.

source: Extra transaction information
id: Informasi transaksi tambahan

source: Find out what instances are using a configuration group, using the :command:`trove configuration-instances` command.
id: Cari tahu apakah instance menggunakan kelompok konfigurasi, menggunakan perintah :command:`trove configuration-instances`.

source: First, determine which configuration options you can set. Different data store versions have different configuration options.
id: Pertama, tentukan opsi konfigurasi dimana Anda dapat mengatur. Versi penyimpanan data yang berbeda memiliki opsi konfigurasi yang berbeda.

source: First, get the ID of the ``guest1`` database instance by using the :command:`trove list` command:
id: Pertama, mendapatkan ID dari ``guest1`` instance database dengan menggunakan perintah :command:`trove list`:

source: First, use the :command:`trove list` command to list all instances and their IDs:
id: Pertama, gunakan perintah :command:`trove list` untuk daftar semua instance dan ID nya:

source: Flavor ID: You must use an ID that is not already in use. In this example, IDs 1 through 5 are in use, so use ID ``6``.
id: Flavor ID: Anda harus menggunakan ID yang belum digunakan. Dalam contoh ini, adalah 1 sampai 5 yang digunakan, jadi gunakan ID ``6``.

source: Follow the steps below to launch an instance from an image.
id: Ikuti langkah di bawah ini untuk memulai sebuah instance dari sebuah image.

source: Follow this procedure to update an existing image.
id: Ikuti prosedur ini untuk memperbarui image yang ada.

source: Follow this procedure to upload an image to a project:
id: Ikuti prosedur ini untuk meng-upload image ke proyek:

source: For ``get_credentials`` see :ref:`Get credentials <get-credentials>`.
id: Untuk ``get_credentials`` lihat :ref:`Get credentials <get-credentials>`.

source: For ``get_credentials``, see :ref:`Get credentials <get-credentials>`.
id: Untuk ``get_credentials``, lihat :ref:`Get credentials <get-credentials>`.

source: For ``get_nova_credentials``, see :ref:`Get Nova credentials <get-nova-credentials>`.
id: Untuk ``get_nova_credentials``, lihat :ref:`Get Nova credentials <get-nova-credentials>`.

source: For ``print_values``, see :ref:`Print values <print-values>`.
id: Untuk ``print_values``, lihat :ref:`Print values <print-values>`.

source: For details about how to install the clients, see :doc:`../common/cli-install-openstack-command-line-clients`.
id: Untuk rincian tentang cara menginstal klien, lihat :doc:`../common/cli-install-openstack-command-line-clients`.

source: For details on creating images, see `Creating images manually <https://docs.openstack.org/image-guide/create-images-manually.html>`_ in the *OpenStack Virtual Machine Image Guide*.
id: Untuk rincian tentang penciptaan image, lihat `Creating images manually <https://docs.openstack.org/image-guide/create-images-manually.html>`_ dalam *OpenStack Virtual Machine Image Guide*.

source: For each NIC on the node, you must create an interface, specifying the interface's MAC address.
id: Untuk setiap NIC pada node, Anda harus membuat sebuah antarmuka, menentukan alamat MAC antarmuka ini.

source: For each floating IP address that is allocated to the current project, the command outputs the floating IP address, the ID for the instance to which the floating IP address is assigned, the associated fixed IP address, and the pool from which the floating IP address was allocated.
id: Untuk setiap alamat IP mengambang yang dialokasikan untuk proyek ini, perintah output alamat IP mengambang, ID untuk instance yang alamat IP mengambang ditugaskan, alamat IP tetap yang terkait, dan kolam yang alamat IP mengambang dialokasikan.

source: For example, if the first object in the tar archive is ``/home/file1.txt`` and you specify the ``/v1/12345678912345/mybackup/castor/`` path, the operation creates the ``castor/home/file1.txt`` object in the ``mybackup`` container in the ``12345678912345`` account.
id: Misalnya, jika objek pertama dalam arsip tar adalah ``/home/file1.txt`` dan Anda menentukan path ``/v1/12345678912345/mybackup/castor/``, operasi membuat objek ``castor/home/file1.txt`` di container ``mybackup`` di akun ``12345678912345``.

source: For example, if your MySQL data store name is set to ``mysql``, your entry would look like this:
id: Sebagai contoh, jika nama penyimpang data MySQL Anda diatur ke ``mysql``, entri Anda akan terlihat seperti ini:

source: For example, this request uses the ``format`` query parameter to ask for a JSON response:
id: Misalnya, request (permintaan) ini menggunakan parameter kueri ``format`` untuk meminta respon JSON:

source: For example, you can include extra transaction information when you upload large objects such as images.
id: Misalnya, Anda dapat memasukkan informasi transaksi tambahan ketika Anda meng-upload object besar seperti image.

source: For example:
id: Sebagai contoh:

source: For further information and comparisons (including security considerations), see the `Security Guide <https://docs.openstack.org/security-guide/compute.html>`__.
id: Untuk informasi lebih lanjut dan perbandingan (termasuk pertimbangan keamanan), lihat `Security Guide <https://docs.openstack.org/security-guide/compute.html>`__.

source: For information and examples on more advanced use of neutron's ``subnet`` subcommand, see the `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking-use.html#advanced-networking-operations>`__.
id: Untuk informasi dan contoh penggunaan subcommand ``subnet`` neutron yang lebih maju, lihat `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking-use.html#advanced-networking-operations>`__.

source: For instance, the Rackspace public cloud is an OpenStack deployment that has an optional custom authentication back end. While normal keystone password authentication works perfectly well, you may want to use the custom Rackspace keystoneauth API Key plugin found in `rackspace-keystoneauth-plugin <https://pypi.python.org/pypi/rackspaceauth>`_.
id: Misalnya, cloud publik Rackspace adalah pengerah (deployment) OpenStack yang memiliki back end otentikasi kustom secara opsional. Sementara otentikasi password keystone normal berjalan dengan baik, Anda mungkin ingin menggunakan plugin Rackspace keystoneauth API Key kustom yang ditemukan di `rackspace-keystoneauth-plugin <https://pypi.python.org/pypi/rackspaceauth>`_.

source: For legacy reasons, you can configure the configuration drive to use VFAT format instead of ISO 9660. It is unlikely that you would require VFAT format because ISO 9660 is widely supported across operating systems. However, to use the VFAT format, add the following line to the ``/etc/nova/nova.conf`` file:
id: Untuk alasan warisan (legacy), Anda dapat mengkonfigurasi drive konfigurasi untuk menggunakan format VFAT bukan ISO 9660. Hal ini tidak mungkin bahwa Anda akan memerlukan Format VFAT karena ISO 9660 secara luas didukung di sistem operasi. Namun, untuk menggunakan format VFAT, tambahkan baris berikut ke file ``/etc/nova/nova.conf``:

source: For variety in this example, create one more instance and module:
id: Untuk variasi dalam contoh ini, buat satu lagi instance dan modul:

source: Formats response as JSON.
id: Format respon sebagai JSON.

source: Formats response as XML.
id: Format respon sebagai XML.

source: Formats response as plain text. If you omit the ``Accept`` header, ``text/plain`` is the default.
id: Format respon sebagai teks biasa. Jika Anda menghilangkan header ``Accept``, dan ``text/plain`` adalah default.

source: From the :guilabel:`Admin` tab, you can access the following category to complete these tasks:
id: Dari tab :guilabel:`Admin` tab, Anda dapat mengakses kategori berikut untuk menyelesaikan tugas ini:

source: From the :guilabel:`Project` tab, you can access the following categories:
id: Dari tab :guilabel:`Project`, Anda dapat mengakses kategori berikut:

source: From the :guilabel:`Project` tab, you can view and manage the resources in a selected project, including instances and images. You can select the project from the drop-down menu at the top left. If the cloud supports multi-domain model, you can also select the domain from this menu.
id: Dari tab :guilabel:`Project`, Anda dapat melihat dan mengelola sumber daya dalam proyek yang dipilih, termasuk instance dan image. Anda dapat memilih proyek dari menu drop-down di bagian kiri atas. Jika cloud mendukung model multi-domain, Anda juga dapat memilih domain dari menu ini.

source: From the CURRENT PROJECT on the :guilabel:`Project` tab, select the appropriate project.
id: Dari CURRENT PROJECT pada tab :guilabel:`Project`, pilih proyek yang tepat.

source: Gather parameters to launch an instance
id: Mengumpulkan parameter untuk meluncurkan sebuah instance

source: Get Nova Credentials. See :ref:'Get Nova credentials <get-nova-credentials>'.
id: Dapatkan Nova Kredensial. Lihat :ref:'Get Nova credentials <get-nova-credentials>'.

source: Get Nova credentials
id: Dapatkan Nova kredensial

source: Get Nova credentials. See :ref:`Get OpenStack credentials (API v2) <get-openstack-credentials>`.
id: Dapatkan Nova kredensial. Lihat :ref:`Get OpenStack credentials (API v2) <get-openstack-credentials>`.

source: Get OpenStack Credentials. See :ref:`Get OpenStack credentials (API v2) <get-openstack-credentials>`.
id: Dapatkan OpenStack Kredensial. Lihat :ref:`Get OpenStack credentials (API v2) <get-openstack-credentials>`.

source: Get OpenStack credentials (API v2)
id: Dapatkan kredensial OpenStack (API v2)

source: Get OpenStack credentials. :ref:`Get OpenStack credentials (API v2) <get-openstack-credentials>`.
id: Dapatkan kredensial OpenStack. :ref:`Get OpenStack credentials (API v2) <get-openstack-credentials>`.

source: Get OpenStack credentials. See :ref:`Get OpenStack credentials (API v2) <get-openstack-credentials>`.
id: Dapatkan kredensial OpenStack. Lihat :ref:`Get OpenStack credentials (API v2) <get-openstack-credentials>`.

source: Get credentials
id: Dapatkan kredensial

source: Get credentials. See :ref:'Get credentials <get-credentials>'.
id: Dapatkan kredensial. Lihat :ref:'Get credentials <get-credentials>'.

source: Get credentials. See :ref:`Get Nova credentials <get-nova-credentials>`.
id: Dapatkan kredensial. Lihat :ref:`Get Nova credentials <get-nova-credentials>`.

source: Get credentials. See :ref:`Get credentials <get-credentials>`.
id: Dapatkan kredensial. Lihat :ref:`Get credentials <get-credentials>`.

source: Get image by ID
id: Dapatkan image dengan ID

source: Get image by name
id: Dapatkan image dengan nama

source: Get information about stacks
id: Dapatkan informasi tentang tumpukan (stack)

source: Get the ID of the configuration group:
id: Dapatkan ID dari kelompok konfigurasi:

source: Get the ID of the database instance:
id: Dapatkan ID dari database instance:

source: Get the ID of the original instance you want to replicate:
id: Mendapatkan ID instance asli dimana Anda ingin meniru:

source: Get the flavor and image to use to create a server. This code uses the ``cirros`` image, the ``m1.tiny`` flavor, and the ``private`` network:
id: Dapatkan flavor dan image untuk digunakan untuk membuat server. Kode ini menggunakan image ``cirros``, flavor ``m1.tiny``, dan jaringan ``private``:

source: Get the image ID:
id: Dapatkan ID image:

source: Get the server instance using ``server_id`` and print the details by calling ``print_server`` method:
id: Dapatkan instance server menggunakan ``server_id`` dan mencetak rincian dengan calling method ``print_server``:

source: Get the updated instance of the server:
id: Dapatkan instance terbaru dari server:

source: Go to the security service that you want to edit and choose :guilabel:`Edit Security Service` from Actions.
id: Jelajahi layanan keamanan yang ingin Anda edit dan pilih:guilabel:`Edit Security Service` dari Actions.

source: Go to the share network that you want to edit and choose :guilabel:`Edit Share Network` from Actions.
id: Pergi ke jaringan bersama yang ingin Anda edit dan pilih:guilabel:`Edit Share Network` dari Actions.

source: Go to the share that you want to allow access and choose :guilabel:`Manage Rules` from Actions.
id: Jelajahi share yang ingin Anda izinkan akses dan memilih :guilabel:`Manage Rules` dari Actions.

source: Go to the share that you want to deny access and choose :guilabel:`Manage Rules` from Actions.
id: Jelajahi share yang ingin Anda tolak akses dan memilih:guilabel:`Manage Rules` dari Actions.

source: Go to the share that you want to edit and choose :guilabel:`Edit Share Metadata` from Actions.
id: Kunjungi ke share yang ingin Anda edit dan pilih :guilabel:`Edit Share Metadata` from Actions.

source: Go to the share that you want to edit and choose :guilabel:`Edit Share` from Actions.
id: Jelajahi share yang ingin Anda edit dan pilih :guilabel:`Edit Share` dari Actions.

source: Go to the share that you want to edit and choose :guilabel:`Extend Share` from Actions.
id: Jelajahi share yang ingin Anda edit dan pilih :guilabel:`Extend Share` dari Actions.

source: Health monitor
id: Health monitor (monitor kesehatan)

source: Here is a list of common commands for reference.
id: Berikut adalah daftar perintah umum untuk referensi.

source: How can I use an OpenStack cloud?
id: Bagaimana saya bisa menggunakan cloud OpenStack?

source: However, in addition to the fixed IP address, a floating IP address can also be attached to an instance. Unlike fixed IP addresses, floating IP addresses can have their associations modified at any time, regardless of the state of the instances involved. This procedure details the reservation of a floating IP address from an existing pool of addresses and the association of that address with a specific instance.
id: Namun, selain alamat IP tetap, alamat IP mengambang juga dapat dilampirkan ke sebuah Instance. Tidak seperti alamat IP tetap, alamat IP mengambang dapat memiliki asosiasi nya dapat diubah setiap saat, terlepas dari keadaan Instance yang terlibat. Prosedur ini merinci reservasi alamat IP mengambang dari kolam alamat yang ada dan alamat yang berasosiasi dengan instance spesifik.

source: ID of the instance (``INSTANCE_ID``): ``792a6a56-278f-4a01-9997-d997fa126370``
id: ID instance (``INSTANCE_ID``): ``792a6a56-278f-4a01-9997-d997fa126370``

source: ID of the regular backup artifact (``BACKUP_ID``): ``6dc3a9b7-1f3e-4954-8582-3f2e4942cddd``
id: ID regular backup artifact (``BACKUP_ID``): ``6dc3a9b7-1f3e-4954-8582-3f2e4942cddd``

source: If a certificate warning appears when you try to access the URL for the first time, a self-signed certificate is in use, which is not considered trustworthy by default. Verify the certificate or add an exception in the browser to bypass the warning.
id: Jika peringatan sertifikat muncul ketika Anda mencoba untuk mengakses URL untuk pertama kalinya, sebuah sertifikat yang ditandatangani sendiri sedang digunakan, yang tidak dapat dipercaya secara default. Verifikasi sertifikat atau menambahkan pengecualian dalam browser untuk memotong peringatan.

source: If a user passes the ``--config-drive true`` flag to the :command:`nova boot` command, an administrator cannot disable the configuration drive.
id: Jika pengguna melewatkan bendera (flag) ``--config-drive true`` ke perintah :command:`nova boot`, administrator tidak dapat menonaktifkan drive konfigurasi.

source: If an image does not have the cloud-init package installed, you must customize the image to run a script that mounts the configuration drive on boot, reads the data from the drive, and takes appropriate action such as adding the public key to an account. You can read more details about how data is organized on the configuration drive.
id: Jika image tidak memiliki paket cloud-init terinstal, Anda harus menyesuaikan image untuk menjalankan script yang me-mount drive konfigurasi pada boot, membaca data dari drive, dan mengambil tindakan yang tepat seperti menambahkan kunci publik (public key) ke akun . Anda dapat membaca lebih detail tentang bagaimana data diorganisasi pada drive konfigurasi.

source: If an image uses a static root password or a static key set (neither is recommended), you must not provide a key pair when you launch the instance.
id: Jika image menggunakan password root statis atau satu set kunci statis (tidak disarankan), Anda tidak harus memberikan sepasang kunci ketika Anda memulai instance.

source: If everything matches, the API creates the manifest object and sets the ``X-Static-Large-Object`` metadata to ``true`` to indicate that the manifest is a static object manifest.
id: Jika semuanya cocok, API membuat objek nyata (manifest) dan menetapkan metadata ``X-Static-besar-Object`` untuk ``true`` untuk menunjukkan bahwa manifes adalah objek nyata statis.

source: If needed, you can assign a **floating (public) IP address** to a running instance.
id: Jika diperlukan, Anda dapat menetapkan **floating (public) IP address** (alamat IP mengambang (publik)) untuk instance berjalan.
