Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: To upload an image, call the ``glanceclient.v2.images.ImageManager.create`` method:
id: Untuk mengupload image, panggil metode ``glanceclient.v2.images.ImageManager.create``:

source: To upload an object to a container, run the following command:
id: Untuk meng-upload sebuah objek ke kontainer, jalankan perintah berikut:

source: To use SSH to connect to your instance, use the downloaded keypair file.
id: Untuk menggunakan SSH untuk koneksi ke instance Anda, gunakan file key pair yang di-download

source: To use configuration drive with Hyper-V, you must set the ``mkisofs_cmd`` value to the full path to an ``mkisofs.exe`` installation. Additionally, you must set the ``qemu_img_cmd`` value in the ``hyperv`` configuration section to the full path to an :command:`qemu-img` command installation.
id: Untuk menggunakan drive konfigurasi dengan Hyper-V, Anda harus mengatur nilai ``mkisofs_cmd`` ke path lengkap ke instalasi ``mkisofs.exe``. Selain itu, Anda harus mengatur nilai ``qemu_img_cmd`` di bagian konfigurasi `` hyperv`` ke path lengkap ke instalasi perintah :command:`qemu-img`.

source: To use configuration drive with libvirt, XenServer, or VMware, you must first install the genisoimage package on each compute host. Otherwise, instances do not boot properly.
id: Untuk menggunakan drive konfigurasi dengan libvirt, XenServer, atau VMware, Anda harus menginstal paket genisoimage pada setiap host komputasi. Jika tidak, instance tidak boot dengan benar.

source: To use configuration drive with the Bare Metal service, you do not need to prepare anything because the Bare Metal service treats the configuration drive properly.
id: Untuk menggunakan drive konfigurasi dengan layanan Bare Metal, Anda tidak perlu mempersiapkan apa-apa karena layanan Bare Metal memperlakukan drive konfigurasi benar.

source: To use snapshots to migrate instances from OpenStack projects to clouds, complete these steps.
id: Untuk menggunakan snapshot memigrasikan instance dari proyek OpenStack ke cloud, lengkapi langkah ini.

source: To use the OpenStack APIs, it helps to be familiar with HTTP/1.1, RESTful web services, the OpenStack services, and JSON or XML data serialization formats.
id: Untuk menggunakan API OpenStack, keakraban hal berikut akan membantunya. Hal itu meliputi akrab dengan HTTP / 1.1, layanan web RESTful, layanan OpenStack, dan format serialisasi data JSON atau XML.

source: To use the Virtual Network Computing (VNC) client for the dashboard, your browser must support HTML5 Canvas and HTML5 WebSockets. The VNC client is based on noVNC. For details, see `noVNC: HTML5 VNC Client <https://github.com/kanaka/noVNC/blob/master/README.md>`__. For a list of supported browsers, see `Browser support <https://github.com/kanaka/noVNC/wiki/Browser-support>`__.
id: Untuk menggunakan klien Virtual Network Computing (VNC) dashboard, browser Anda harus mendukung HTML5 Canvas dan HTML5 WebSockets. Klien VNC berdasarkan noVNC. Untuk rincian, lihat `noVNC: HTML5 VNC Client <https://github.com/kanaka/noVNC/blob/master/README.md>`__. Untuk daftar browser yang didukung, lihat `Browser support <https://github.com/kanaka/noVNC/wiki/Browser-support>`__.

source: To use the ``/info`` request, send a ``GET`` request using the ``/info`` path to the Object Store endpoint as shown in this example:
id: Untuk menggunakan request (permintaan) ``/info``, kirim request ``GET``menggunakan path ``/info`` ke endpoint Object Store seperti yang ditunjukkan dalam contoh ini:

source: To use the configuration drive, you must follow the following requirements for the compute host and image.
id: Untuk menggunakan drive konfigurasi, Anda harus mengikuti persyaratan berikut untuk host dan image komputasi

source: To use the information in this section, you must be familiar with OpenStack Compute.
id: Untuk menggunakan informasi dalam bagian ini, Anda harus terbiasa dengan OpenStack Compute.

source: To use the information in this section, you should have a general understanding of OpenStack Networking, OpenStack Compute, and the integration between the two. You should also have access to a plug-in that implements the Networking API v2.0.
id: Untuk menggunakan informasi dalam bagian ini, Anda harus memiliki pemahaman umum OpenStack Networking, OpenStack Compute, dan integrasi antara keduanya. Anda juga harus memiliki akses ke sebuah plug-in yang mengimplementasikan Networking API v2.0.

source: To use the legacy ``python-novaclient`` with a Compute endpoint, instantiate a `novaclient.v2.client.Client <https://docs.openstack.org/developer/python-novaclient/ref/v2/client.html>`__ object using ``os-client-config``:
id: Untuk menggunakan legacy ``python-novaclient`` dengan Compute endpoint, instantiate `novaclient.v2.client.Client <https://docs.openstack.org/developer/python-novaclient/ref/v2/client.html>`__ object using ``os-client-config``:

source: To validate that the file was injected, use ssh to connect to the instance, and look in ``/var/lib/cloud`` for the file.
id: Untuk memvalidasi bahwa file tersebut injected, gunakan ssh untuk menyambung ke instance, dan lihat file ``/var/lib/cloud``.

source: To verify that the server was deleted, run the :command:`openstack server list` command:
id: Untuk memverifikasi bahwa server telah dihapus, jalankan: perintah :command:`openstack server list`:

source: To view the available options for the :command:`openstack server list` command, run the following command:
id: Untuk melihat pilihan yang tersedia untuk perintah :command:`openstack server list` jalankan perintah berikut:

source: Topology
id: Topologi

source: Track usage for instances
id: Track usage for instances (penggunaan jalur untuk instance)

source: Turn on file listing. If you do not set the index file, the URL displays a list of the objects in the container. Instructions on styling the list with a CSS follow.
id: Aktifkan daftar file. Jika Anda tidak mengatur file indeks, URL menampilkan daftar objek dalam kontainer. Petunjuk tentang styling daftar dengan mengikuti CSS.

source: UTF-8-encode and then URL-encode the names.
id: UTF-8-encode dan kemudian URL-encode nama.

source: Unmount the volume
id: Melakukan unmount volume

source: Unpause
id: Unpause (batalkan jeda)

source: Unshelve an instance - Restores the instance.
id: Unshelve (meletakan) instance - Restore (mengembalikan) instance.

source: Unsuspend
id: Unsuspend (batalkan penangguhan)

source: Update a database instance
id: Update database instance

source: Update a stack
id: Memperbarui stack

source: Update an image
id: Update image

source: Update server code listing example
id: Update kode server daftar contoh

source: Update the image
id: Update image

source: Update the module again. By doing this, it will cause the instances to report their module is not current.
id: Perbaharui modul lagi. Dengan melakukan ini, akan menyebabkan instance untuk melaporkan modul mereka tidak saat ini.

source: Updating and creating a second module for a redis cluster
id: Memperbarui dan membuat modul kedua untuk cluster redis

source: Upload an image
id: Upload image

source: Upload an object
id: Upload object

source: Upload and manage images
id: Upload dan mengelola image

source: Upload binary image data
id: Upload binary image data (mengunggah data citra biner)

source: Upload manifest request: HTTP
id: Upload permintaan (request) manifest: HTTP

source: Upload manifest response: HTTP
id: Upload respon manifest: HTTP

source: Upload next segment of large object request: HTTP
id: Upload segmen permintaan objek besar berikutnya: HTTP

source: Upload order
id: Upload order (urutan upload)

source: Upload segment of large object request: HTTP
id: Upload segmen permintaan (request) objek besar: HTTP

source: Upload the volume to glance.
id: Upload volume ke glance

source: Use `EpochConverter <http://www.epochconverter.com/>`_ to convert dates to and from epoch timestamps and for batch conversions.
id: Gunakan `EpochConverter <http://www.epochconverter.com/>`_ untuk mengkonversi tanggal ke dan dari cap waktu zaman dan untuk konversi batch.

source: Use ``X-Container-Meta-Web-Index`` to determine the index file (or default page served, such as ``index.html``) for your website. When someone initially enters your site, the ``index.html`` file displays automatically. If you create sub-directories for your site by creating pseudo-directories in your container, the index page for each sub-directory is displayed by default. If your pseudo-directory does not have a file with the same name as your index file, visits to the sub-directory return a 404 error.
id: Gunakan ``X-Container-Meta-Web-Index`` untuk menentukan file indeks (atau halaman default disajikan, seperti `index.html```) untuk website Anda. Ketika seseorang awalnya memasuki situs Anda, file ``index.html`` menampilkan otomatis. Jika Anda membuat sub-direktori untuk situs Anda dengan membuat pseudo-direktori dalam kontainer Anda, halaman indeks untuk setiap sub-direktori akan ditampilkan secara default. Jika Anda pseudo-direktori tidak memiliki file dengan nama yang sama dengan file indeks, kunjungan ke sub-direktori mengembalikan kesalahan 404.

source: Use a ``limit`` of two:
id: Gunakan `` limit`` dua:

source: Use gzip or bzip2 to compress the archive.
id: Gunakan gzip atau bzip2 untuk kompres arsip.

source: Use incremental backups
id: Gunakan inkremental backup (cadangan)

source: Use one of the following methods to stop and start an instance.
id: Gunakan salah satu metode berikut untuk berhenti dan memulai sebuah instance.

source: Use snapshots to migrate instances
id: Gunakan snapshot untuk bermigrasi instance.

source: Use ssh to connect to the instance
id: Gunakan ssh untuk terhubung ke instance

source: Use the :command:`nova baremetal-node-list` command to view all bare-metal nodes and interfaces. When a node is in use, its status includes the UUID of the instance that runs on it:
id: Gunakan perintah :command:`nova baremetal-node-list` untuk melihat semua node bare-metal dan interface. Ketika sebuah node digunakan, statusnya termasuk UUID dari instance yang berjalan di atasnya:

source: Use the :command:`nova baremetal-node-show` command to view the details for a bare-metal node:
id: Gunakan perintah :command:`nova baremetal-node-show` untuk melihat rincian node bare-metal:

source: Use the :command:`openstack image list` command to check the status until the status is ``active``:
id: Gunakan perintah :command:`openstack image list` untuk memeriksa status sampai statusnya ``active``:

source: Use the :command:`openstack server list` command to confirm that the instance shows a ``SHUTOFF`` status:
id: Gunakan perintah :command:`openstack server list` untuk mengkonfirmasi bahwa instance menunjukkan status ``SHUTOFF``:

source: Use the :command:`openstack server stop` command to shut down the instance:
id: Gunakan perintah :command:`openstack server stop` untuk menutup instance:

source: Use the :command:`openstack` commands to manage floating IP addresses.
id: Gunakan perintah :command:`openstack` untuk mengelola alamat IP mengambang.

source: Use the :command:`ssh` command to make a secure connection to the instance. For example:
id: Gunakan perintah :command:`ssh` untuk membuat sambungan aman untuk instance. Sebagai contoh:

source: Use the :command:`trove backup-create` command and specify:
id: Gunankan perintah :command:`trove backup-create` dan tentukan:

source: Use the :command:`trove database-list` command to check that the original databases (``db1`` and ``db2``) are present on the restored instance.
id: Gunakan perintah :command:`trove database-list` untuk memeriksa bahwa database asli (` `db1`` dan` `db2``) yang hadir pada instance dipulihkan.

source: Use the :command:`trove show` command to display information about the new guest2 instance. Pass in guest2's ``INSTANCE_ID``, which is ``ac7a2b35-a9b4-4ff6-beac-a1bcee86d04b``.
id: Gunakan perintah :command:`trove show` untuk menampilkan informasi tentang instance guest2 baru. Lulus dalam guest2 ini ``INSTANCE_ID``, yang merupakan ``ac7a2b35-a9b4-4ff6-beac-a1bcee86d04b``.

source: Use the :command:`trove user-list` command to check that the original user (``user1``) is present on the restored instance.
id: Gunakan perintah :command:`trove user-list` untuk memeriksa bahwa pengguna asli (` `user1``) hadir pada instance dipulihkan.

source: Use the POST method to assign expiration headers to existing objects that you want to expire.
id: Menggunakan metode POST untuk menetapkan header kedaluwarsa objek yang ada dimana Anda ingin berakhir.

source: Use the ``end_marker`` parameter to limit the result set to object names that are less than the ``end_marker`` parameter value:
id: Gunakan parameter ``end_marker`` untuk membatasi hasil set ke objek nama yang kurang dari nilai parameter ``end_marker``:

source: Use the ``extract-archive`` query parameter to specify the format. Valid values for this parameter are ``tar``, ``tar.gz``, or ``tar.bz2``.
id: Gunakan parameter query ``extract-archive`` untuk menentukan format. Nilai yang valid untuk parameter ini adalah ``tar``, ``tar.gz``, atau ``tar.bz2``.

source: Use the ``get_credentials()`` method to populate and get a dictionary:
id: Gunakan metode ``get_credentials () `` untuk mengisi dan mendapatkan kamus (dictionary):

source: Use the ``get_nova_credentials()`` method to populate and get a dictionary:
id: Gunakan metode ``get_nova_credentials()`` untuk mengisi dan mendapatkan kamus (dictionary):

source: Use the ``get_nova_credentials_v2()`` method to populate and get a dictionary:
id: Gunakan metode ``get_nova_credentials_v2 () `` untuk mengisi dan mendapatkan kamus:

source: Use the ``mkisofs_cmd`` flag to set the path where you install the genisoimage program. If genisoimage is in same path as the ``nova-compute`` service, you do not need to set this flag.
id: Gunakan flag ``mkisofs_cmd``` untuk mengatur jalan dimana Anda menginstal program genisoimage. Jika genisoimage berada di jalur yang sama dengan layanan ``nova-compute``, Anda tidak perlu mengatur bendera (flag) ini.

source: Use the ``prefix`` and ``delimiter`` parameters to view the objects inside a pseudo-directory, including further nested pseudo-directories.
id: Gunakan parameter ``prefix`` dan ``delimiter`` untuk melihat objek di dalam pseudo-directory, termasuk pseudo-directory bersarang lebih lanjut.

source: Use the auto-extract archive feature to upload a tar archive file.
id: Gunakan fitur arsip auto-ekstrak untuk meng-upload file arsip tar.

source: Use the concepts described in the overview section to fill in the necessary information about the load balancer you want to create.
id: Gunakan konsep yang dijelaskan di bagian overview untuk mengisi tentang informasi yang diperlukan untuk penyeimbang beban yang Anda ingin buat.

source: Use the delimiter parameter to limit the displayed results. To use ``delimiter`` with pseudo-directories, you must use the parameter slash (``/``).
id: Gunakan parameter pembatas untuk membatasi hasil yang ditampilkan. Untuk menggunakan ``delimiter`` dengan pseudo-directory, Anda harus menggunakan parameter garis miring (`` / ``).

source: Used in this way, configuration groups let you modify your database cloud configuration, on the fly, on a massive scale.
id: Digunakan dengan cara ini, kelompok konfigurasi membiarkan Anda mengubah konfigurasi cloud database Anda, dengan cepat, dalam skala besar.

source: Used to manage volumes and volume snapshots that attach to instances.
id: Digunakan untuk mengelola volume dan snapshot volume yang terkait instance.

source: User data
id: Data pengguna (user)

source: User1 from project1 can read container contents:
id: User1 dari project1 dapat membaca konten kontainer:

source: User1 from project1 can write to the container:
id: User1 dari project1 dapat menulis ke kontainer:

source: Users have roles on accounts. For example, a user with the admin role has full access to all containers and objects in an account. You can set access control lists (ACLs) at the container level and support lists for read and write access, which you set with the ``X-Container-Read`` and ``X-Container-Write`` headers.
id: Pengguna (user) memiliki peran di account (akun). Misalnya, pengguna dengan peran admin memiliki akses penuh ke semua kontainer dan objek dalam akun. Anda dapat mengatur daftar kontrol akses (ACL) di tingkat kontainer dan daftar dukungan untuk membaca dan menulis akses, dimana Anda mengatur dengan header ``X-Container-Read`` dan ``X-Container-Write``.

source: Users: The ``user1`` user with the ``password`` password
id: Pengguna: pengguna ``user1`` dengan kata sandi ``password``

source: Using this option, you can boot from a volume snapshot and create a new volume by choosing :guilabel:`Volume Snapshot` from a list and adding a :guilabel:`Device Name` for your volume. Click the :guilabel:`Delete Volume on Instance Delete` option to delete the volume on deleting the instance.
id: Menggunakan opsi ini, Anda dapat boot dari snapshot volume dan membuat volume baru dengan memilih :guilabel:`Volume Snapshot` dari daftar dan menambahkan :guilabel:`Device Name` untuk volume Anda. Klik opsi :guilabel:`Delete Volume on Instance Delete` untuk menghapus volume pada penghapusan instance.

source: VNC or SPICE is used to view the console output of an instance, regardless of whether or not the console log has output. This allows relaying keyboard and mouse activity to and from an instance.
id: VNC atau SPICE digunakan untuk melihat konsol output dari sebuah instance, terlepas dari apakah log konsol memiliki output atau tidak. Hal ini memungkinkan menyampaikan aktivitas keyboard dan mouse ke dan dari sebuah instance.

source: Valid values for the ``format`` variable are ``tar``, ``tar.gz``, or ``tar.bz2``.
id: Nilai yang valid untuk variable ``format`` adalah ``tar``, ``tar.gz``, atau ``tar.bz2``.

source: Verify the ``X-Delete-At`` header has posted to the object:
id: Lakukan verifikasi header ``X-Delete-At`` yang telah diposting ke objek:

source: View and manage load balancers v2
id: Melihat dan mengelola beban balancers v2

source: View console log of instance
id: View console log instance (Lihat log konsol instance)

source: View existing load balancers
id: Lihat load balancer (penyeimbang beban) yang ada

source: View statistics:
id: Lihat statistik:

source: Volume: If you choose this option, a new field for :guilabel:`Use volume as a source` displays. You can select the volume from the list. Options to use a snapshot or a volume as the source for a volume are displayed only if there are existing snapshots or volumes.
id: Volume: Jika Anda memilih opsi ini, field baru untuk menampilkan :guilabel:`Use volume as a source`. Anda dapat memilih volume dari daftar. Pilihan untuk menggunakan snapshot atau volume sebagai sumber untuk volume ditampilkan hanya jika ada snapshot atau volume.

source: Volumes are block storage devices that you attach to instances to enable persistent storage. You can attach a volume to a running instance or detach a volume and attach it to another instance at any time. You can also create a snapshot from or delete a volume. Only administrative users can create volume types.
id: Volume adalah perangkat penyimpanan blok yang Anda hubungkan ke instance untuk mengaktifkan penyimpanan persisten. Anda dapat pasangkan volume untuk instance menjalankan atau melepaskan volume dan pasangkan ke instance lain setiap saat. Anda juga dapat membuat snapshot dari atau menghapus volume. Hanya pengguna administratif dapat membuat tipe volume.

source: We strongly recommend that you put non-current objects in a different container than the container where current object versions reside.
id: Kami sangat menyarankan agar Anda menaruh objek non-current dalam kontainer berbeda dari kontainer dimana versi objek saat berada.

source: When Object Storage processes the request, it performs multiple sub-operations. Even if all sub-operations fail, the operation returns a 200 status. The bulk operation returns a response body that contains details that indicate which sub-operations have succeeded and failed. Some sub-operations might succeed while others fail. Examine the response body to determine the results of each delete sub-operation.
id: Ketika Object Storage memproses permintaan, ia melakukan beberapa sub-operasi. Bahkan jika semua sub-operasi gagal, operasi mengembalikan status 200. Operasi massal mengembalikan response body yang berisi rincian yang menunjukkan yang sub-operasi telah berhasil dan gagal. Beberapa sub-operasi mungkin berhasil sementara yang lain gagal. Periksa response body untuk menentukan hasil setiap sub-operasi penghapusan.

source: When Object Storage processes the request, it performs multiple sub-operations. Even if all sub-operations fail, the operation returns a 201 ``Created`` status. Some sub-operations might succeed while others fail. Examine the response body to determine the results of each auto-extract archive sub-operation.
id: Ketika Object Storage memproses permintaan, ia melakukan beberapa sub-operasi. Bahkan jika semua sub-operasi gagal, operasi mengembalikan status ``Created`` 201. Beberapa sub-operasi mungkin berhasil sementara yang lain gagal. Periksa respon body untuk menentukan hasil setiap sub-operation arsip auto-extract

source: When adding a rule, you must specify the protocol used with the destination port or source port.
id: Ketika menambahkan aturan, Anda harus menentukan protokol akan digunakan dengan port tujuan atau port sumber.

source: When an instance is created in OpenStack, it is automatically assigned a fixed IP address in the network to which the instance is assigned. This IP address is permanently associated with the instance until the instance is terminated.
id: Ketika sebuah Instance dibuat dalam OpenStack, maka secara otomatis diberi alamat IP tetap dalam jaringan dimana Instance ditugaskan. Alamat IP ini secara permanen terkait dengan Instance sampai Instance diakhiri.

source: When an instance is created in OpenStack, it is automatically assigned a fixed IP address in the network to which the instance is assigned. This IP address is permanently associated with the instance until the instance is terminated. However, in addition to the fixed IP address, a floating IP address can also be attached to an instance. Unlike fixed IP addresses, floating IP addresses are able to have their associations modified at any time, regardless of the state of the instances involved.
id: Ketika sebuah instance dibuat dalam OpenStack, maka secara otomatis diberi alamat IP tetap dalam jaringan dimana instance ditugaskan. Alamat IP ini secara permanen terkait dengan instance sampai instance diakhiri. Namun, selain alamat IP tetap, alamat IP mengambang juga dapat dihubungkan ke sebuah instance. Tidak seperti alamat IP tetap, alamat IP mengambang dapat memiliki asosiasi nya yang dapat diubah setiap saat, terlepas dari keadaan instance yang terlibat.

source: When creating a port, you can specify any unallocated IP in the subnet even if the address is not in a pre-defined pool of allocated IP addresses (set by your cloud provider).
id: Ketika membuat sebuah port, Anda dapat menentukan IP yang tidak terisi di subnet bahkan jika alamat tidak ada di kolam yang telah ditentukan (pre-defined pool) dari alamat IP dialokasikan (ditetapkan oleh penyedia cloud Anda).

source: When running QEMU without support for the hardware virtualization, set ``cpu_mode="none"`` alongside ``virt_type=qemu`` in ``/etc/nova/nova-compute.conf`` to solve the following error:
id: Saat menjalankan QEMU tanpa dukungan untuk virtualisasi perangkat keras, atur ``cpu_mode = "none" `` di samping ``virt_type = qemu`` di ``/etc/nova/nova-compute.conf`` untuk mengatasi kesalahan berikut:
