Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: Log in to the instance with a public IP address (from Mac)
id: Log in ke instance dengan alamat IP publik (dari Mac)

source: Make another request with a ``marker`` of the last item returned:
id: Membuat permintaan lain dengan ``marker`` dari item terakhir kembali:

source: Make another request with a ``marker`` parameter set to the name of the last item returned:
id: Membuat permintaan lain dengan parameter ``marker`` set nama dari item terakhir kembali:

source: Make container publicly readable
id: Membuat wadah (container) dibaca publik

source: Make filesystem on volume
id: Membuat filesystem pada volume

source: Make sure an appropriate flavor exists for the type of database instance you want.
id: Pastikan flavor yang tepat ada untuk tipe instance database yang Anda inginkan.

source: Make sure that you set the relevant environment variables.
id: Pastikan bahwa Anda mengatur variabel lingkungan yang relevan.

source: Make the container publicly readable. Once the container is publicly readable, you can access your objects directly, but you must set the index file to browse the main site URL and its sub-directories.
id: Membuat kontainer dibaca publik. Setelah kontainer dibaca publik, Anda dapat mengakses obyek langsung, tetapi Anda harus mengatur file indeks untuk menelusuri URL situs utama dan sub-direktori nya.

source: Make the image available to the new environment, either through HTTP or direct upload to a machine (``scp``).
id: Membuat image yang tersedia dengan lingkungan baru, baik melalui HTTP ataupun upload langsung ke mesin (``scp``).

source: Make the instances booted from ISO image functional
id: Membuat instance boot dari ISO image fungsional

source: Manage IP addresses
id: Mengelola alamat IP

source: Manage a stack
id: Mengelola stack

source: Manage access
id: Mengelola akses

source: Manage an instance
id: Mengelola sebuah instance

source: Manage an object
id: Mengelola obyek

source: Manage bare-metal nodes
id: Mengelola node bare-metal

source: Manage database configuration
id: Mengelola konfigurasi database

source: Manage images
id: Mengelola image

source: Manage images using cURL
id: Mengelola image menggunakan cURL

source: Manage instances and hosts
id: Mengelola instance dan host

source: Manage objects
id: Mengelola objek

source: Manage objects and containers
id: Mengelola objek dan kontainer

source: Manage security groups
id: Mengelola kelompok keamanan (security group)

source: Manage shares
id: mengelola share

source: Manage volumes after login into the instance
id: Mengelola volume setelah login ke instance

source: Manifest object metadata
id: Metadata objek manifest

source: Measure cloud resources
id: Mengukur sumber cloud

source: Measures a specific aspect of resource usage, such as the existence of a running instance, or ongoing performance, such as the CPU utilization for an instance. Meters exist for each type of resource. For example, a separate ``cpu_util`` meter exists for each instance. The lifecycle of a meter is decoupled from the existence of its related resource. The meter persists after the resource goes away.
id: Mengukur aspek tertentu dari penggunaan sumber daya, seperti adanya instance menjalankan (running), atau kinerja yang berkelanjutan, seperti penggunaan CPU untuk sebuah instance. Meter ada untuk setiap jenis sumber daya. Misalnya, meteran ``cpu_util`` terpisah ada untuk setiap instance. Siklus hidup meter dipisahkan dari keberadaan sumber daya terkait. Meteran berlanjut setelah sumber daya hilang.

source: Member
id: Member (anggota)

source: Members are the actual IP addresses that receive traffic from the load balancer. Members are associated with pools.
id: Anggota adalah alamat IP aktual yang menerima lalu lintas (traffic) dari load balancer (penyeimbang beban). Anggota berhubungan dengan kolam (pool).

source: Members may go offline from time to time and health monitors diverts traffic away from members that are not responding properly. Health monitors are associated with pools.
id: Anggota dapat offline dari waktu ke waktu dan monitor kesehatan mengalihkan lalu lintas dari anggota yang tidak merespon dengan baik. Monitor kesehatan berhubungan dengan kolam (pool)..

source: Modify a configuration group on the fly, using the :command:`trove configuration-patch` command.
id: Memodifikasi kelompok konfigurasi dengan cepat, dengan menggunakan perintah :command:`trove configuration-patch`.

source: Modify security group rules with the :command:`openstack security group rule` commands. Before you begin, source the OpenStack RC file. For details, see :doc:`../common/cli-set-environment-variables-using-openstack-rc`.
id: Memodifikasi aturan grup keamanan dengan perintah :command:`openstack security group rule`. Sebelum Anda mulai, dapatkan sumber file OpenStack RC. Untuk rincian, lihat :doc:`../common/cli-set-environment-variables-using-openstack-rc`.

source: Mount the volume at the mountpoint
id: Melakukan mount volume pada mountpoint

source: Name
id: Nama

source: Name of the database instance: ``guest1``
id: Nama database instance: ``guest1``

source: Name of the instance: ``mysql_instance_1``
id: Nama instance: ``mysql_instance_1``

source: Networking in OpenStack is complex. This section provides the basic instructions for creating a network and a router. For detailed information about managing networks, refer to the `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking.html>`__.
id: Networking dalam OpenStack adalah kompleks. Bagian ini memberikan petunjuk dasar untuk menciptakan jaringan dan router. Untuk informasi rinci tentang mengelola jaringan, mengacu pada `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking.html>`__.

source: New users should default to coding against the OpenStack SDK.
id: Pengguna baru harus standar (default) untuk pengkodean terhadap OpenStack SDK.

source: Next, upload the manifest. This manifest specifies the container where the object segments reside. Note that if you upload additional segments after you create the manifest, the concatenated object becomes that much larger but you do not need to recreate the manifest file for subsequent additional segments.
id: Berikutnya, upload manifest. Manifest ini menentukan Kontainer dimana segmen objek berada. Catatan bahwa jika Anda meng-upload segmen tambahan setelah Anda membuat manifes, objek bersambung (concatenated) menjadi yang jauh lebih besar tetapi Anda tidak perlu menciptakan file manifest untuk segmen tambahan berikutnya.

source: No response body is returned.
id: Tidak ada response body dikembalikan (returned).

source: No source, empty volume: Creates an empty volume. An empty volume does not contain a file system or a partition table.
id: Tidak ada sumber, volume yang kosong: Membuat volume kosong. Volume kosong tidak berisi sistem file atau tabel partisi.

source: Normally when you perform a ``GET`` operation on the manifest object, the response body contains the concatenated content of the segment objects. To download the manifest list, use the ``?multipart-manifest=get`` query parameter. The list in the response is not formatted the same as the manifest that you originally used in the ``PUT`` operation.
id: Biasanya, bila Anda melakukan operasi ``GET`` pada objek nyata (manifest), response body berisi konten bersambung objek segmen. Untuk men-download daftar manifest, gunakan parameter query ``multipart-manifest = get`` . Daftar dalam respon tidak diformat sama dengan manifest yang awalnya Anda gunakan dalam operasi ``PUT``.

source: Not guaranteed. The eventual consistency model means that although you have uploaded a segment object, it might not appear in the container listing until later. If you download the manifest before it appears in the container, it does not form part of the content returned in response to a ``GET`` request.
id: Tidak dijamin. Model konsistensi akhir (eventual consistency model) berarti bahwa meskipun Anda telah meng-upload sebuah objek segmen, hal itu tidak mungkin akan muncul dalam daftar kontainer sampai nanti. Jika Anda men-download manifes sebelum muncul dalam kontainer, hal itu tidak merupakan bagian dari konten yang kembali dalam menanggapi permintaan ``GET``.

source: Note that the command returns both the ID of the original instance (``instance_id``) and the ID of the backup artifact (``id``).
id: Perhatikan bahwa hasil perintah kedua ID dari instance asli (``instance_id``) dan ID dari backup artifact (``id``).

source: Note that the data store, flavor ID, and volume size have the same values as in the original ``guest1`` instance.
id: Perhatikan bahwa data store, ID flavor, dan ukuran volume yang memiliki nilai yang sama seperti pada aslinya instance ``guest1``.

source: Note that the system allocates one IP address if you do not specify an IP address in the :command:`openstack port create` command.
id: Perhatikan bahwa sistem akan mengalokasikan satu alamat IP jika Anda tidak menentukan alamat IP di perintah :command:`openstack port create`.

source: Note that this command returns both the ID of the database instance you are incrementally backing up (``instance_id``) and a new ID for the new incremental backup artifact you just created (``id``).
id: Perhatikan bahwa perintah ini kembali baik ID dari instance Anda backing up secara inkremental (``instance_id``) dan ID baru untuk artefak inkremental backup baru saja Anda buat (``id``).

source: Note the ID of the flavor that you want to use for your instance::
id: Perhatikan ID rasa yang ingin Anda gunakan instance Anda ::

source: Note the ID of the flavor that you want to use to create a volume.
id: Perhatikan ID dari rasa yang ingin Anda gunakan untuk membuat volume.

source: Note the ID of the image from which you want to boot your instance::
id: Perhatikan ID dari image yang Anda ingin boot instance Anda ::

source: Note the ID of the image that you want to use to create a volume.
id: Perhatikan ID dari image yang ingin Anda gunakan untuk membuat volume.

source: Note the ID of the security group that you want to use for your instance::
id: Perhatikan ID dari grup keamanan yang ingin Anda gunakan instance Anda ::

source: Note the effect of the ``--file /etc/network/interfaces=/home/myuser/instance-interfaces`` argument that was passed to the :command:`openstack server create` command. The contents of this file are contained in the ``openstack/content/0000`` file on the configuration drive, and the path is specified as ``/etc/network/interfaces`` in the ``meta_data.json`` file.
id: Perhatikan efek dari argumen ``--file /etc/network/interfaces=/home/myuser/instance-interfaces`` yang dilewatkan ke perintah :command:`openstack server create`. Isi file ini terkandung dalam file ``openstack/content/0000`` pada drive konfigurasi, dan path ditetapkan sebagai ``/etc/network/interfaces`` dalam file ``meta_data.json``.

source: Nothing is written to the non-current version container when you initially ``PUT`` an object in the ``current`` container. However, subsequent ``PUT`` requests that edit an object trigger the creation of a version of that object in the ``archive`` container.
id: Tidak ada yang ditulis ke kontainer versi non-current ketika Anda awalnya ``PUT`` obyek dalam kontainer ``current``. Namun, selanjutnya request (permintaan) ``PUT`` yang mengedit sebuah objek memicu penciptaan versi objek yang di kontainer ``archive``.

source: Now assume that your ``guest1`` database instance is damaged and you need to restore it from your incremental backups. In this example, you use the :command:`trove create` command to create a new database instance called ``guest2``.
id: Sekarang asumsikan bahwa Anda basis data ``guest1`` instance rusak dan Anda perlu untuk mengembalikannya dari inkremental backup Anda. Dalam contoh ini, Anda menggunakan perintah :command:`trove create` untuk membuat sebuah instance database baru yang disebut ` `guest2``.

source: Now assume that your ``guest1`` database instance is damaged and you need to restore it. In this example, you use the :command:`trove create` command to create a new database instance called ``guest2``.
id: Sekarang asumsikan bahwa Anda basis data instance ``guest1`` rusak dan Anda perlu untuk mengembalikannya. Dalam contoh ini, Anda menggunakan perintah :command:`trove create` untuk membuat sebuah instance database baru yang disebut ` `guest2``.

source: Now assume that your original database instance is damaged and you need to restore it. You do the restore by using your backup to create a new database instance.
id: Sekarang menganggap bahwa instance database asli Anda rusak dan Anda perlu untuk mengembalikannya. Anda restore dengan menggunakan cadangan (backup) Anda untuk membuat sebuah instance database baru.

source: Now check that the new ``guest2`` instance has the same characteristics as the original ``guest1`` instance.
id: Sekarang periksa bahwa baru instance ``guest2`` memiliki karakteristik yang sama seperti aslinya instance ``guest1``.

source: Now complete the following steps to make your instances created using ISO image actually functional.
id: Sekarang lakukan langkah berikut ini untuk membuat instance Anda yang dibuat menggunakan image ISO fungsional sebenarnya.

source: Now pass in ``base_1``'s instance ID with the :command:`trove show` command to list the replica(s) associated with the original instance. Note that the ``replicas`` property is set to the ID of ``replica_1``. If there are multiple replicas, they appear as a comma-separated list.
id: Sekarang lewatkan dalam ID instance ``base_1`` ini dengan perintah :command:`trove show` untuk mendaftar replika(s) terkait dengan instance asli. Perhatikan bahwa properti ``replicas`` diatur ke ID dari ``replica_1``. Jika ada beberapa replikas, mereka akan muncul sebagai daftar dipisahkan koma (comma-separated list).

source: Now take a look at the minimum requirements for various database instances:
id: Sekarang kita lihat persyaratan minimum untuk berbagai Instance database:

source: Now they are both updated. If the ``--force`` flag is used, it can reapply to already applied instances. Notice that the only thing that changes is the minimum and maximum updated date fields.
id: Sekarang keduanya diperbarui. Jika flag ``--force`` digunakan, maka dapat mengajukan permohonan kembali ke instance yang sudah diterapkan. Perhatikan bahwa satu-satunya perubahan adalah bidang tanggal minimum dan maksimum yang diperbarui.

source: Now to show the usage with a redis cluster, create as follows:
id: Sekarang untuk menunjukkan penggunaan dengan cluster redis, buatlah sebagai berikut:

source: Now we have 2 single instances, and 3 cluster instances on various versions of the module, none current.
id: Sekarang kita memiliki 2 instance tunggal, dan 3 instance cluster pada berbagai versi modul, tidak ada yang ada saat ini.

source: Now you can log in to the instance and mount, format, and use the disk.
id: Sekarang Anda dapat masuk ke instance dan mount, format, dan menggunakan disk.

source: Object Storage lists container names with additional information in JSON format:
id: Object Storage berisi nama kontainer dengan informasi tambahan dalam format JSON:

source: Object Storage lists container names with additional information in XML format:
id: Object Storage berisi nama kontainer dengan informasi tambahan dalam format XML:

source: Object Storage takes the ``ETag`` value of each segment, concatenates them together, and returns the MD5 checksum of the result to calculate the ``ETag`` response header value. The manifest object types are:
id: Object Storage mengambil nilai ``ETag`` dari setiap segmen, merangkai mereka bersama-sama, dan mengembalikan checksum MD5 hasilnya untuk menghitung nilai respon header (response header value) ``ETag``. Jenis objek nyata (manifest) adalah:

source: Object expiration
id: Objek kedaluwarsa

source: On the :guilabel:`Admin` tab, click :guilabel:`Networks` category.
id: Pada tab :guilabel:`Admin`, klik category :guilabel:`Networks`.

source: On the :guilabel:`Log In` page, enter your user name and password, and click :guilabel:`Sign In`. If the cloud supports multi-domain model, you also need to enter your domain name.
id: Pada page :guilabel:`Log In`, masukkan username dan password Anda, dan klik :guilabel:`Sign In`. Jika cloud mendukung model multi-domain, Anda juga harus memasukkan nama domain Anda.

source: On the :guilabel:`Project` tab, open the :guilabel:`Compute` tab and click :guilabel:`Access & Security` category.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Compute`dan klik kategori :guilabel:`Access & Security`.

source: On the :guilabel:`Project` tab, open the :guilabel:`Compute` tab and click :guilabel:`Access & Security` category. The :guilabel:`Security Groups` tab shows the security groups that are available for this project.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Compute` dan klik kategori :guilabel:`Access & Security`. Tab :guilabel:`Security Groups` menunjukkan kelompok keamanan yang tersedia untuk proyek ini.

source: On the :guilabel:`Project` tab, open the :guilabel:`Compute` tab and click :guilabel:`Images` category.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Compute` dan klik kategori :guilabel:`Images`.

source: On the :guilabel:`Project` tab, open the :guilabel:`Compute` tab and click :guilabel:`Instances` category.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Compute` dan klik kategori :guilabel:`Instances`.

source: On the :guilabel:`Project` tab, open the :guilabel:`Compute` tab and click :guilabel:`Overview` category.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Compute` dan klik kategori :guilabel:`Overview`.

source: On the :guilabel:`Project` tab, open the :guilabel:`Compute` tab and click :guilabel:`Volumes` category.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Compute` dan klik kategori :guilabel:`Volumes`.

source: On the :guilabel:`Project` tab, open the :guilabel:`Compute` tab and click the :guilabel:`Instances` category.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Compute` dan klik kategori the :guilabel:`Instances`.

source: On the :guilabel:`Project` tab, open the :guilabel:`Compute` tab and click the :guilabel:`Volumes` category.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Compute` dan klik kategori :guilabel:`Volumes`.

source: On the :guilabel:`Project` tab, open the :guilabel:`Database` tab and click :guilabel:`Backups` category. This lists the available backups.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Database` dan klik kategori :guilabel:`Backups`. Ini berisi daftar backup yang tersedia.

source: On the :guilabel:`Project` tab, open the :guilabel:`Database` tab and click :guilabel:`Instances` category. This lists the instances that already exist in your environment.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Database` dan klik kategori :guilabel:`Instances`. Ini berisi daftar instance yang sudah ada di lingkungan Anda.

source: On the :guilabel:`Project` tab, open the :guilabel:`Database` tab and click :guilabel:`Instances` category. This displays the existing instances in your system.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Database` dan klik kategori :guilabel:`Instances`. Ini menampilkan instance yang ada dalam sistem Anda.

source: On the :guilabel:`Project` tab, open the :guilabel:`Network` tab and click :guilabel:`Networks` category.
id: Pada label gui: `tab project`, buka tab :guilabel:`Network` dan klik kategori :guilabel:`Networks`.

source: On the :guilabel:`Project` tab, open the :guilabel:`Network` tab and click :guilabel:`Routers` category.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Network`dan klick kategori :guilabel:`Routers`.

source: On the :guilabel:`Project` tab, open the :guilabel:`Network` tab, and click the :guilabel:`Load Balancers` category.
id: Pada tab :guilabel:`Project` , buka tab :guilabel:`Network`, dan klik kategori :guilabel:`Load Balancers`.

source: On the :guilabel:`Project` tab, open the :guilabel:`Object Store` tab and click :guilabel:`Containers` category.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Object Store` dan klik kategori :guilabel:`Containers`.

source: On the :guilabel:`Project` tab, open the :guilabel:`Orchestration` tab and click :guilabel:`Stacks` category.
id: Pada tab :guilabel:`Project`, buka tab :guilabel:`Orchestration` dan klik kategori :guilabel:`Stacks`.

source: On the :guilabel:`Router Details` page, click the :guilabel:`Interfaces` tab, then click :guilabel:`Add Interface`.
id: Pada page :guilabel:`Router Details`, klick tab :guilabel:`Interfaces`, kemudian klik :guilabel:`Add Interface`.

source: On the :guilabel:`Routers` tab, click the name of the router.
id: Pada tab :guilabel:`Routers`, klik nama router.

source: On the Xen Hypervisor it is possible to provide a specific device name instead of automatic allocation. For example:
id: Di Xen Hypervisor, sesuatu hal yang mungkin untuk memberikan nama perangkat tertentu bukannya alokasi otomatis. Sebagai contoh:

source: Once identified, you can mount the device:
id: Setelah diidentifikasi, Anda dapat me-mount perangkat:

source: One or more *config servers*. Config servers store the metadata that links requested data with the shard that contains it.
id: Satu atau lebih *config server *. Server config menyimpan metadata yang menghubungkan data yang diminta dengan pecahan (shard) yang mengisi data itu.

source: One or more *query routers*. A query router is the machine that your application actually connects to. This machine is responsible for communicating with the config server to figure out where the requested data is stored. It then accesses and returns the data from the appropriate shard(s).
id: Satu atau lebih *query routers*. Sebuah router kueri adalah mesin dimana aplikasi Anda benar-benar terhubung. Mesin ini bertanggung jawab untuk berkomunikasi dengan server config untuk mencari tahu dimana data yang diminta. Kemudian mesin ini mengakses dan mengembalikan data dari pecahan yang sesuai (appropriate shard).

source: One or more *shards*. Each shard consists of a three member replica set (three instances organized as a replica set).
id: Satu atau lebih *shards*. Setiap pecahan (*shards*) terdiri dari set replika tiga anggota (tiga instance diatur sebagai satu set replika).

source: One use case for using the configuration drive is to pass a networking configuration when you do not use DHCP to assign IP addresses to instances. For example, you might pass the IP address configuration for the instance through the configuration drive, which the instance can mount and access before you configure the network settings for the instance.
id: Satu kasus digunakan untuk menggunakan drive konfigurasi adalah untuk lulus konfigurasi jaringan bila Anda tidak menggunakan DHCP untuk menetapkan alamat IP untuk instance. Misalnya, Anda mungkin lulus konfigurasi alamat IP untuk instance melalui drive konfigurasi, yang instance dapat me-mount dan akses sebelum Anda mengkonfigurasi pengaturan jaringan instance.

source: Open a web browser that has JavaScript and cookies enabled.
id: Buka web browser yang memiliki JavaScript dan cookie diaktifkan.

source: OpenStack End User Guide
id: OpenStack End User Guide (Panduan End User OpenStack)

source: OpenStack Networking security groups are case-sensitive while the nova-network security groups are case-insensitive.
id: Kelompok keamanan OpenStack Networking berkarakter huruf case-sensitive sedangkan kelompok keamanan nova-network berkarakter huruf case-insensitive.
