Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: In the :guilabel:`Select Template` dialog box, specify the following values:
id: Dalam dialog box :guilabel:`Select Template` , tentukan nilai berikut:

source: In the ``PUT`` request, you can specify the path for:
id: Dalam permintaan ``PUT``, Anda dapat menentukan jalan (path) untuk:

source: In the actions column, click :guilabel:`Create Snapshot`.
id: Dalam kolom tindakan, klik :guilabel:`Create Snapshot`.

source: In the address bar, enter the host name or IP address for the dashboard, for example, ``https://ipAddressOrHostName/``.
id: Di address bar, masukkan hostname atau alamat IP untuk dashboard, misalnya, ``https://ipAddressOrHostName/``.

source: In the confirmation dialog box, click :guilabel:`Delete Stack` to confirm the deletion.
id: Pada kotak dialog konfirmasi, klik :guilabel:`Delete Stack` untuk mengkonfirmasi penghapusan.

source: In the destination project:
id: Dalam proyek tujuan (destination):

source: In the dialog box that opens, enter a snapshot name and a brief description.
id: Pada kotak dialog yang terbuka, masukkan nama snapshot dan deskripsi singkat.

source: In the dialog box that opens, enter or select the following values.
id: Pada kotak dialog yang terbuka, masukkan atau pilih nilai berikut.

source: In the menu list in the actions column, select the state.
id: Dalam daftar menu di kolom tindakan, pilih kondisi.

source: In the new project or cloud environment, import the snapshot:
id: Dalam proyek atau cloud lingkungan baru, impor snapshot:

source: In the new project or cloud environment, use the snapshot to create the new instance:
id: Dalam proyek atau awan lingkungan baru, gunakan snapshot untuk membuat instance baru:

source: In the request body of the ``POST`` or ``DELETE`` operation, list the objects or containers to be deleted. Separate each name with a newline character. You can include a maximum of 10,000 items (configurable) in the list.
id: Dalam body request operasi ``POST`` atau ``DELETE``, daftarlah objek atau kontainer yang akan dihapus. Pisahkan setiap nama dengan karakter baris baru. Anda dapat menyertakan maksimal 10.000 item (dikonfigurasi) dalam daftar.

source: In the source project:
id: Dalam proyek sumber (source):

source: In this command, ``ubuntu-14.04.2-server-amd64.iso`` is the ISO image, and ``INSTANCE_NAME`` is the name of the new instance. ``NETWORK_UUID`` is a valid network id in your system.
id: Dalam perintah ini, ``ubuntu-14.04.2-server-amd64.iso`` adalah ISO image, dan `` INSTANCE_NAME`` adalah nama instance baru. ``NETWORK_UUID`` adalah id jaringan yang valid dalam sistem Anda.

source: In this example, ``--name subnet1`` specifies the name of the subnet.
id: Dalam contoh ini, ``--name subnet1`` menentukan nama subnet.

source: In this example, ``net1`` is a positional argument that specifies the network name.
id: Dalam contoh ini, ``net1`` adalah argumen posisi yang menentukan nama jaringan.

source: In this example, the :command:`trove configuration-parameter-list` command returns a list of options that work with MySQL 5.5.
id: Dalam contoh ini, perintah :command:`trove configuration-parameter-list` mengembalikan daftar pilihan yang berjalan dengan MySQL 5.5.

source: In this example, the ``X-Delete-After`` header is set to 864000 seconds. The object expires after this time.
id: Dalam contoh ini, header ``X-Delete-After`` diatur untuk 864.000 detik. Objek berakhir setelah waktu ini.

source: In this example, the ``X-Delete-At`` header is assigned a UNIX epoch timestamp in integer form for ``Mon, 11 Jun 2012 15:38:25 GMT``.
id: Dalam contoh ini, header ``X-Delete-At`` diberikan a UNIX epoch timestamp dalam bentuk integer untuk ``Mon, 11 Jun 2012 15:38:25 GMT``.

source: In this example, the contents of the configuration drive are as follows::
id: Dalam contoh ini, isi dari drive konfigurasi adalah sebagai berikut ::

source: In this example, the objects reside in a container called ``backups``. Within that container, the objects are organized in a pseudo-directory called ``photos``. The container name is not displayed in the example, but it is a part of the object URLs. For instance, the URL of the picture ``me.jpg`` is ``https://storage.swiftdrive.com/v1/CF_xer7_343/backups/photos/me.jpg``.
id: Dalam contoh ini, objek berada dalam kontainer yang disebut ``backups``. Dalam wadah itu, objek yang diatur dalam pseudo-directory yang disebut ``photos``. Nama kontainer tidak ditampilkan pada contoh, tetapi merupakan bagian dari URL objek. Sebagai contoh, URL dari gambar ``me.jpg`` adalah ``https://storage.swiftdrive.com/v1/CF_xer7_343/backups/photos/me.jpg``.

source: Include the ``?multipart-manifest=get`` query string in the ``COPY`` request. The new object contains the same manifest as the original. The segment objects are not copied. Instead, both the original and new manifest objects share the same set of segment objects.
id: Sertakan query string ``?multipart-manifest = get`` di permintaan ``COPY``. Objek baru berisi manifest yang sama seperti aslinya. Objek segmen tidak disalin. Sebaliknya, kedua objek nyata asli dan baru akan berbagi set (pengaturan) objek segmen yang sama.

source: Include the ``X-Versions-Location`` header. This header defines the container that holds the non-current versions of your objects. You must UTF-8-encode and then URL-encode the container name before you include it in the ``X-Versions-Location`` header. This header enables object versioning for all objects in the ``current`` container. Changes to objects in the ``current`` container automatically create non-current versions in the ``archive`` container.
id: Sertakan header ``X-Versi-Location``. Header ini mendefinisikan kontainer yang memegang versi non-current objek Anda. Anda harus utf-8-encode dan kemudian URL-encode nama kontainer sebelum Anda memasukkannya dalam header ``X-Versi-Location``. Header ini memungkinkan objek versi untuk semua objek dalam kontainer ``current``. Perubahan ke objek dalam kontainer ``current`` otomatis membuat versi non-current di kontainer ``archive``.

source: Include this header in the ``GET`` request. The valid header values are:
id: Sertakan header ini di request (permintaan) ) ``GET``. Nilai header valid adalah:

source: Incremental backups let you chain together a series of backups. You start with a regular backup. Then, when you want to create a subsequent incremental backup, you specify the parent backup.
id: Inkremental backup (cadangan) membiarkan Anda rantai bersama serangkaian backup. Anda mulai dengan cadangan biasa. Kemudian, ketika Anda ingin membuat backup inkremental berikutnya, Anda menentukan cadangan parent (parent backup).

source: Information
id: Informasi

source: Inject a keypair into an instance and access the instance with that keypair
id: Inject keypair menjadi sebuah instance dan mengakses instance dengan keypair

source: Inject user data and files into an instance
id: Inject data dan file user ke dalam instance

source: Installing OpenStack SDK
id: Instalasi OpenStack SDK

source: Instance Name
id: Nama Instance

source: Instance name: ``guest1``
id: nama name: ``guest1``

source: Instance snapshot that you took.
id: Instance snapshot yang Anda ambil.

source: Instances are virtual machines that run inside the cloud on physical compute nodes. The Compute service manages instances. A host is the node on which a group of instances resides.
id: Instance adalah mesin virtual yang berjalan di dalam cloud pada node komputasi fisik. Layanan Compute mengelola instance. Sebuah host adalah node dimana sekelompok instance berada.

source: Instances are virtual machines that run inside the cloud.
id: Instance adalah mesin virtual yang berjalan di dalam cloud.

source: Instances are virtual machines that run inside the cloud. You can launch an instance from the following sources:
id: Instance adalah mesin virtual yang berjalan di dalam cloud. Anda dapat memulai sebuah instance dari sumber berikut:

source: Instances that use the default security group cannot, by default, be accessed from any IP address outside of the cloud. If you want those IP addresses to access the instances, you must modify the rules for the default security group.
id: Instance yang menggunakan kelompok keamanan default tidak bisa, secara default, diakses dari alamat IP di luar cloud. Jika Anda ingin mereka alamat IP untuk mengakses instance, Anda harus memodifikasi aturan untuk grup keamanan default.

source: Instances that use the default security group cannot, by default, be accessed from any IP address outside of the cloud. If you want those IP addresses to access the instances, you must modify the rules for the default security group. Additionally, security groups will automatically drop DHCP responses coming from instances.
id: Instance yang menggunakan kelompok keamanan default tidak bisa, secara default, diakses dari alamat IP di luar cloud. Jika Anda ingin alamat IP itu untuk mengakses instance, Anda harus memodifikasi aturan untuk grup keamanan default. Selain itu, kelompok keamanan otomatis akan turun tanggapan DHCP yang datang dari instance.

source: Instances will now accept all incoming ICMP packets.
id: Instance sekarang akan menerima semua paket ICMP yang masuk.

source: Instances will now have SSH port 22 open for requests from any IP address.
id: Instance tidak akan memiliki SSH port 22 terbuka untuk permintaan dari alamat IP.

source: Instantiate the ``neutron`` client object by using the ``credentials`` dictionary object:
id: Instantiate (mencontoh) objek klien ``neutron`` dengan menggunakan objek kamus ``credentials`` :

source: Instantiate the ``nova_client`` client object by using the ``credentials`` dictionary object:
id: Mencontoh (instantiate) objek klien ``nova_client`` dengan menggunakan objek kamus ``credentials`` :

source: Issue a ``DELETE`` request to a versioned object to remove the current version of the object and replace it with the next-most current version in the non-current container.
id: Mengeluarkan request (permintaan) ``DELETE`` ke objek berversi untuk menghapus versi dari objek dan menggantinya dengan versi berikutnya terbaru dalam kontainer non-current ini.

source: Issue a ``GET`` request to a versioned object to get the current version of the object. You do not have to do any request redirects or metadata lookups.
id: Mengeluarkan request (permintaan) ``GET`` ke objek berversi untuk mendapatkan versi terbaru dari objek. Anda tidak perlu melakukan apapun pengalihan permintaan atau pencarian metadata.

source: It is also possible to SSH into an instance without an SSH keypair, if the administrator has enabled root password injection. For more information about root password injection, see `Injecting the administrator password <https://docs.openstack.org/admin-guide/compute-admin-password-injection.html>`_ in the *OpenStack Administrator Guide*.
id: Hal ini juga memungkinkan untuk melakukan SSH ke sebuah instance tanpa keypair SSH, jika administrator mengaktifkan root password injection. Untuk informasi lebih lanjut tentang root password injection., lihat `Injecting the administrator password <https://docs.openstack.org/admin-guide/compute-admin-password-injection.html>`_ dalam *OpenStack Administrator Guide*.

source: It is also possible to reboot a running instance into rescue mode. For example, this operation may be required, if a filesystem of an instance becomes corrupted with prolonged use.
id: Hal ini juga memungkinkan untuk reboot instance menjalankan ke mode rescue. Misalnya, operasi ini mungkin diperlukan, jika filesystem dari sebuah instance menjadi rusak dengan penggunaan jangka panjang.

source: It is best to upload all the segments first and then create or update the manifest. With this method, the full object is not available for downloading until the upload is complete. Also, you can upload a new set of segments to a second location and update the manifest to point to this new location. During the upload of the new segments, the original manifest is still available to download the first set of segments.
id: Cara terbaik adalah untuk meng-upload semua segmen pertama dan kemudian membuat atau memperbarui manifes. Dengan metode ini, objek penuh tidak tersedia untuk di-download sampai upload selesai. Juga, Anda dapat meng-upload satu set segmen baru ke lokasi kedua dan memperbarui manifes untuk menunjuk ke lokasi baru ini. Selama upload segmen baru, manifes asli masih tersedia untuk men-download set segmen pertama.

source: Iterate over ``servers_list`` and compare name with ``vm1``.
id: Iterasi (iterate) atas ``servers_list`` dan bandingkan nama dengan ``vm1``.

source: JSON and data serialization formats
id: JSON dan format serialisasi data

source: JSON data serialization response format.
id: Format respon serialisasi data JSON

source: Keep in mind, the health checks routinely run against each instance within a target load balancer and the result of the health check is used to determine if the instance receives new connections.
id: Perlu diingat, pemeriksaan kesehatan secara rutin dijalankan terhadap setiap instance dalam penyeimbang beban sasaran dan hasil dari pemeriksaan kesehatan digunakan untuk menentukan apakah instance akan menerima sambungan baru.

source: Key Pair
id: Key Pair (sepasang kunci)

source: Key pairs are SSH credentials that are injected into an instance when it is launched. To use key pair injection, the image that the instance is based on must contain the ``cloud-init`` package. Each project should have at least one key pair. For more information, see the section :ref:`keypair_add`.
id: Pasangan kunci (key pair) adalah kredensial SSH yang disuntikkan ke sebuah instance ketika diluncurkan. Untuk menggunakan injeksi pasangan kunci, image dimana instance harus berdasarkan pada konten paket ``cloud-init``. Setiap proyek harus memiliki setidaknya satu sepasang kunci. Untuk informasi lebih lanjut, lihat bagian :ref:`keypair_add`.

source: LBaaS v2 has several new concepts to understand:
id: LBaaS v2 memiliki beberapa konsep baru untuk memahami:

source: Large objects
id: Large objects (benda besar)

source: Later on, use the :command:`trove backup-list` command to get this information:
id: Kemudian, gunakan perintah: `perintah harta backup-list` untuk mendapatkan informasi ini:

source: Launch a stack
id: Meluncurkan stack

source: Launch an instance
id: Meluncurkan sebuah instance

source: Launch an instance from a bare-metal image
id: Meluncurkan sebuah instance dari image bare-metal.

source: Launch an instance from a volume
id: Meluncurkan sebuah instance dari volume

source: Launch an instance from an image
id: Meluncurkan sebuah instance dari sebuah image

source: Launch an instance using ISO image
id: Meluncurkan sebuah instance menggunakan image ISO

source: Launch and manage instances
id: Peluncuran dan mengelola instance

source: Launch and manage stacks
id: Memulai dan mengelola tumpukan (stack)

source: Launch instances
id: Peluncuran instance

source: Least connections: Allocates requests to the instance with the least number of active connections.
id: Least connections: Mengalokasikan permintaan untuk instance dengan sedikitnya jumlah koneksi aktif.

source: Leave this field empty.
id: Tinggalkan filed ini kosong.

source: Limits the result set to names that are less than the ``end_marker`` parameter value. You must URL-encode the ``end_marker`` value before you send the HTTP request.
id: Membatasi hasil ditetapkan untuk nama yang kurang dari nilai parameter ``end_marker``. Anda harus URL-encode nilai ``end_marker`` sebelum Anda mengirim permintaan HTTP.

source: Link the router to the external provider network:
id: Menghubungkan router ke jaringan penyedia eksternal:

source: Link the router to the subnet:
id: Menghubungkan router untuk subnet:

source: List Identity service catalog
id: Lihat daftar Identity service catalog

source: List Security groups
id: Daftar kelompok keamanan (security group)

source: List access.
id: Daftar akses

source: List all instances:
id: Daftar semua instance:

source: List all project instances with which a floating IP address could be associated.
id: Daftar semua instance proyek dengan yang alamat IP mengambang dapat dikaitkan.

source: List all the clusters in your system, using the :command:`trove cluster-list` command.
id: Daftar semua cluster dalam sistem anda, gunakan perintah :command:`trove cluster-list`.

source: List all users
id: Lihat daftar all users

source: List all volumes, noticing the volume status
id: Daftar semua volume, memperhatikan status volume

source: List bare-metal nodes and interfaces
id: Daftar node bare-metal dan interface

source: List containers
id: Membuat daftar container (wadah)

source: List flavors
id: Lihat daftar flavor

source: List flavors (API v2)
id: Daftar flavor (API v2)

source: List flavors by calling ``list()`` on ``nova_client.flavors`` object:
id: Daftar rasa dengan pemanggilan ``list()`` pada object ``nova_client.flavors``:

source: List flavors code listing example
id: Daftar flavor kode daftar contoh

source: List floating IP address information
id: Daftar informasi alamat IP mengambang

source: List floating IPs (API v2)
id: Daftar IP mengambang (API v2)

source: List floating IPs by calling ``list()`` on ``nova_client.floating_ips`` object:
id: Daftar IP mengambang dengan pemanggilan ``list()`` pada object ``nova_client.floating_ips``:

source: List floating IPs code listing example
id: Daftar IP mengambang kode daftar contoh

source: List hosts (API v2)
id: Daftar host (API v2)

source: List hosts by calling ``list()`` on ``nova_client.hosts`` object:
id: Daftar hosts dengan pemanggilan ``list()`` pada object ``nova_client.hosts``:

source: List hosts code listing example
id: Daftar host kode daftar contoh

source: List images
id: Lihat daftar images

source: List images you can access
id: Lihat daftar images anda dapat mengakses

source: List instances, check status of instance
id: Lihat daftar instances, periksa status instance

source: List keypairs
id: Daftar pasangan kunci (keypair)

source: List networks
id: Daftar networks

source: List objects in the ``archive`` container to show that the archived object was moved back to the ``current`` container:
id: Daftar objek di kontainer ``archive`` untuk menunjukkan bahwa objek diarsipkan dipindahkan kembali ke kontainer ``current``:

source: List older versions of the object in the ``archive`` container:
id: Daftar versi lama dari objek dalam kontainer ``archive``:

source: List ports
id: Daftar port

source: List pseudo-hierarchical folders request: HTTP
id: Daftar permintaan folder pseudo-hierarchical: HTTP

source: List routers
id: Daftar routers

source: List routers: complete code listing example
id: Daftar router: kode lengkap listing contoh

source: List samples:
id: Lihat daftar sampel:

source: List security groups
id: Daftar kelompok keamanan.

source: List security groups: complete code listing example
id: Daftar kelompok keamanan: kode lengkap daftar contoh

source: List server code listing example
id: Daftar kode server pendaftaran contoh

source: List server ports
id: Daftar port server

source: List servers (API v2)
id: Daftar server (API v2)

source: List servers by calling ``servers.list`` on ``nova_client`` object:
id: Daftar server dengan pemanggilan ``servers.list`` pada object ``nova_client``:

source: List servers: ``servers_list``.
id: Daftar server: ``servers_list``.

source: List share export locations.
id: Daftar lokasi ekspor share.

source: List share networks.
id: Daftar jaringan bersama (share)

source: List shares.
id: Daftar share.

source: List snapshots after deleting.
id: Daftar snapshot setelah menghapus.

source: List snapshots before deleting.
id: Daftar snapshot sebelum menghapus.

source: List snapshots.
id: Daftar snapshot.

source: List storage devices
id: Membuat daftar perangkat penyimpanan

source: List subnets
id: Daftar subnets

source: List subnets:
id: Daftar subnets:

source: List subnets: complete code listing example
id: Daftar subnets: kode lengkap daftar contoh

source: List the alarms that are set:
id: Lihat daftar alarm yang ditetapkan:

source: List the available flavors with the following command:
id: Daftar flavor tersedia dengan perintah berikut:

source: List the available flavors.
id: Daftar rasa yang tersedia.

source: List the available images.
id: Daftar image yang tersedia.

source: List the available key pairs, and note the key pair name that you use for SSH access.
id: Daftar pasangan kunci (key pair) yang tersedia, dan perhatikan nama pasangan kunci yang Anda gunakan untuk akses SSH.

source: List the available security groups.
id: Daftar kelompok keamanan yang tersedia.

source: List the extensions of the system:
id: Lihat daftar ekstensi dari sistem:

source: List the heat resources that were created:
id: Lihat daftar heat resources yang diciptakan:

source: List the instances in a cluster by using the :command:`trove cluster-instances` command.
id: Daftar instance dalam sebuah cluster dengan menggunakan perintah :command:`trove cluster-instances`.

source: List the meters that are set:
id: Lihat daftar meter yang ditetapkan:

source: List the name of each segment object along with its size and MD5 checksum in order.
id: Daftar nama masing-masing objek segmen bersama dengan ukuran dan MD5 checksum secara teratur.

source: List the names and IDs of all available versions of the ``mysql`` data store:
id: Daftar nama dan ID dari semua versi yang tersedia dari penyimpanan data ``mysql``:

source: List the routers:
id: Daftar router:

source: List volumes to see the bootable volume and its attached ``myInstanceFromVolume`` instance.
id: Daftar volume untuk melihat volume bootable dan yang melekat instance ``myInstanceFromVolume``.

source: List volumes.
id: Daftar volume.

source: Listener
id: Listener (pendengar)

source: Lists available bare-metal nodes.
id: Daftar tersedia node bare-metal.

source: Lists network interfaces associated with a bare-metal node.
id: Daftar antarmuka jaringan berhubungan dengan node bare-metal.

source: Load balancer
id: Load balancer (penyeimbang beban)

source: Load-Balancer-as-a-Service (LBaaS) enables networking to distribute incoming requests evenly among designated instances. This distribution ensures that the workload is shared predictably among instances and enables more effective use of system resources. Use one of these load-balancing methods to distribute incoming requests:
id: Load-Balancer-as-a-Service (LBaaS) memungkinkan jaringan untuk mendistribusikan permintaan yang masuk secara merata di antara instance yang ditunjuk. Distribusi ini memastikan bahwa beban kerja diperkirakan terbagi antar instance dan memungkinkan lebih efektif penggunaan sumber daya sistem. Gunakan salah satu metode load-balancing ini untuk mendistribusikan permintaan yang masuk:

source: Log in to the OpenStack dashboard.
id: Log in dashboard OpenStack.

source: Log in to the dashboard
id: Log in dashboard

source: Log in to the dashboard, choose a project, and click :guilabel:`Shares`.
id: Login ke dashboard, pilih proyek, dan klik :guilabel:`Shares`.

source: Log in to the dashboard, choose a project, click :guilabel:`Shares`, and click :guilabel:`Security Services`.
id: Login ke dashboard, pilih proyek, klik :guilabel:`Shares`, dan klik :guilabel:`Security Services`.

source: Log in to the dashboard, choose a project, click :guilabel:`Shares`, and click :guilabel:`Share Networks`.
id: Login ke dashboard, pilih proyek, klik :guilabel:`Shares`, dan klik :guilabel:`Share Networks`.

source: Log in to the dashboard.
id: Login ke dashboard.

source: Log in to the instance (from Linux)
id: Log in ke instance (dari Linux)
