Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: Shelve an instance - Shuts down the instance, and stores it together with associated data and resources (a snapshot is taken if not volume backed). Anything in memory is lost.
id: Meletakan (shelve) sebuah instance - Mematikan (shut down) instance, danpenyimpanan bersama-sama dengan data terkait dan sumber daya (snapshot diambil jika bukan volume didukung). Apa pun di memori hilang.

source: Shelve and unshelve an instance
id: Meletakan (shelve) dan unshelve sebuah instance

source: Shelving is useful if you have an instance that you are not using, but would like retain in your list of servers. For example, you can stop an instance at the end of a work week, and resume work again at the start of the next week. All associated data and resources are kept; however, anything still in memory is not retained. If a shelved instance is no longer needed, it can also be entirely removed.
id: Peletakan (shelving) berguna jika Anda memiliki sebuah instance bahwa Anda tidak menggunakan, namun ingin mempertahankan di daftar server. Misalnya, Anda dapat menghentikan sebuah instance pada akhir minggu kerja, dan melanjutkan pekerjaan lagi pada awal minggu depan. Semua data dan sumber daya terkait disimpan; Namun, apa pun masih dalam memori tidak dipertahankan. Jika instance dipetieskan (shelved) tidak lagi diperlukan, juga dapat sepenuhnya dihapus.

source: Show a share.
id: Tampilkan share

source: Show details for a bare-metal node
id: Tampilkan detail untuk node bare-metal

source: Show details of instance
id: Show details instance (tampilkan detail instance)

source: Show information about your server, including its size, which is shown as the value of the flavor property:
id: Tampilkan informasi tentang server Anda, termasuk ukurannya, yang ditampilkan sebagai nilai properti flavor:

source: Show the share after it is being shrunk.
id: Tampilkan share setelah menyusut.

source: Show the share after it is extended.
id: Tampilkan share setelah diperpanjang.

source: Show the share created from snapshot.
id: Tampilkan share dibuat dari snapshot.

source: Show the share while it is being extended.
id: Tampilkan share saat sedang diperpanjang.

source: Show the share while it is being shrunk.
id: Tampilkan share saat sedang menyusut.

source: Show the status for your server.
id: Tampilkan status server Anda.

source: Shows information about a bare-metal node.
id: Menampilkan informasi tentang node bare-metal.

source: Shrink a share.
id: Kecilkan share.

source: Shrink share
id: Kecilkan share

source: Shut down the source VM before you take the snapshot to ensure that all data is flushed to disk. If necessary, list the instances to view the instance name:
id: Matikan (shut down) sumber VM sebelum Anda mengambil snapshot untuk memastikan bahwa semua data mengalir (flushed) ke disk. Jika perlu, daftarlah instance untuk melihat nama instance:

source: Snapshot: If you choose this option, a new field for :guilabel:`Use snapshot as a source` displays. You can select the snapshot from the list.
id: Snapshot: Jika Anda memilih opsi ini, field baru untuk menampilkan :guilabel:`Use snapshot as a source`. Anda dapat memilih snapshot dari daftar.

source: Some cloud providers allow only administrators to perform this task.
id: Beberapa penyedia cloud mengizinkan hanya administrator untuk melakukan tugas ini.

source: Some fields of the created network are invisible to non-admin users.
id: Beberapa bidang jaringan dibuat tidak terlihat oleh pengguna non-admin.

source: Some resources are updated in-place, while others are replaced with new resources.
id: Beberapa sumber diperbarui di tempat, sementara yang lain diganti dengan sumber daya baru.

source: Some resources have associated metadata which can change throughout the lifecycle of a resource. Show the metadata by running the following command:
id: Beberapa sumber telah dikaitkan metadata yang dapat mengubah seluruh siklus hidup dari sumber daya. Tampilkan metadata dengan menjalankan perintah berikut:

source: Some tabs, such as :guilabel:`Orchestration` and :guilabel:`Firewalls`, only appear on the dashboard if they are properly configured.
id: Beberapa tab, seperti :guilabel:`Orchestration` dan :guilabel:`Firewalls`, hanya muncul di dashboard jika mereka dikonfigurasi dengan benar.

source: Source IP: Requests from a unique source IP address are consistently directed to the same instance.
id: IP sumber (Source IP): Permintaan dari alamat IP sumber yang unik secara konsisten diarahkan untuk instance yang sama.

source: Specify a customization script that runs after your instance launches.
id: Tentukan kustomisasi script yang sudah berjalan benar setelah instance Anda diluncurkan.

source: Specify a key pair.
id: Tentukan sepasang kunci (key pair).

source: Specify a name for the backup.
id: Tentukan nama untuk cadangan (backup)

source: Specify the Linux distribution that is used in the stack.
id: Tentukan distribusi Linux yang digunakan dalam stack.

source: Specify the architecture. For example, ``i386`` for a 32-bit architecture or ``x86_64`` for a 64-bit architecture.
id: Tentukan arsitektur. Sebagai contoh, ``i386`` untuk 32-bit arsitektur atau ``x86_64`` untuk 64-bit arsitektur.

source: Specify the flavor for the instance.
id: Tentukan flavor instance.

source: Specify the name of the database user.
id: Tentukan nama pengguna database.

source: Specify the name of the database.
id: Tentukan nama database.

source: Specify the name of the key pair to use to log in to the stack.
id: Tentukan nama pasangan kunci (key pair) digunakan untuk login ke stack.

source: Specify the number of minutes that can elapse before the launch of the stack times out.
id: Tentukan jumlah menit yang dapat dilalui sebelum peluncuran stack habis waktu (times out).

source: Specify the password of the database.
id: Tentukan password dari database.

source: Specify the password that the default user uses when the stack is created.
id: Tentukan password dimana user default menggunakan ketika stack (tumpukan) dibuat.

source: Specify the root password for the database.
id: Tentukan password root untuk database.

source: Specify the size of the instance to launch.
id: Tentukan ukuran instance untuk memulai.

source: Specify this option to add resource metadata. The glance Metadata Catalog provides a list of metadata image definitions. (Note: Not all cloud providers enable this feature.)
id: Tentukan pilihan ini untuk menambahkan metadata sumber daya. Glance Metadata Catalog menyediakan daftar definisi image metadata. (Catatan: Tidak semua cloud provider mengaktifkan fitur ini.)

source: Specify this option to copy image data to the Image service.
id: Tentukan pilihan ini untuk menyalin data image ke layanan Image.

source: Start
id: Start (memulai)

source: Start an instance (boot)
id: Memulai instance (boot)

source: Start by getting the ID of the new ``guest2`` instance.
id: Mulai dengan mendapatkan ID yang baru instance ``guest2``.

source: Static Web middleware through Object Storage
id: Static Web middleware melalui Object Storage

source: Static large object
id: Objek besar statis

source: Static large object manifest list
id: Daftar manifest objek besar statis

source: Static large objects
id: Static large objects (object besar statis)

source: Statistic
id: Statistic (Statistik)

source: Stop
id: Stop (berhenti)

source: Stop and start an instance
id: Berhenti dan memulai sebuah instance

source: Store metadata on a configuration drive
id: Menyimpan metadata pada drive konfigurasi.

source: String name
id: String name (nama string)

source: Style the file listing using a CSS.
id: Style (gaya) daftar file menggunakan CSS.

source: Suspend
id: Suspend (menangguhkan)

source: Suspend and resume an instance
id: Menunda dan melanjutkan sebuah instance

source: Take note of the unique router identifier returned, this will be required in subsequent steps.
id: Mencatat identifier router unik yang dikembalikan, ini akan diperlukan dalam langkah berikutnya.

source: Task
id: Tugas

source: Telemetry measures cloud resources in OpenStack. It collects data related to billing. Currently, this metering service is available through only the :command:`ceilometer` command-line client.
id: Telemetry mengukur sumber daya cloud di OpenStack. Ini mengumpulkan data terkait dengan penagihan. Saat ini, layanan metering ini tersedia melalui hanya baris perintah klien (command-line client) :command:`ceilometer`

source: Tell the users who were accessing the now-disabled ``guest1`` database instance that they can now access ``guest2``. Provide them with ``guest2``'s name, IP address, and any other information they might need. (You can get this information by using the :command:`trove show` command.)
id: Memberitahu pengguna yang mengakses instance database now-disabled ``guest1`` bahwa mereka sekarang dapat mengakses ``guest2``. Menyediakan mereka dengan nama ``guest2``, alamat IP, dan informasi lainnya yang mungkin mereka butuhkan. (Anda bisa mendapatkan informasi ini dengan menggunakan perintah :command:`trove show` )

source: The **flavor** for your instance, which defines the compute, memory, and storage capacity of nova computing instances. A flavor is an available hardware configuration for a server. It defines the size of a virtual server that can be launched.
id: **flavor** untuk instance Anda, yang mendefinisikan komputasi, memori, dan kapasitas penyimpanan dari instance komputasi nova. Rasa adalah konfigurasi hardware yang tersedia untuk server. Mendefinisikan ukuran server virtual yang dapat diluncurkan.

source: The **instance source** can be an image, snapshot, or block storage volume that contains an image or snapshot.
id: **instance source** (sumber daya instance) bisa image, snapshot, atau volume penyimpanan blok yang berisi image atau snapshot.

source: The 2``nn`` response code indicates a successful write. ``nn`` is a value from 00 to 99.
id: Kode respon 2``nn`` menunjukkan write (menulis) sukses. ``nn`` adalah nilai 00-99.

source: The :command:`ip` command is available only on Linux. Using :command:`ip netns` provides your environment a copy of the network stack with its own routes, firewall rules, and network devices for better troubleshooting.
id: Perintah :command:`ip` hanya tersedia di Linux. Penggunaan :command:`ip netns` menyediakan lingkungan Anda salinan network stack dengan rute sendiri, aturan firewall, dan perangkat jaringan untuk pemecahan masalah yang lebih baik.

source: The :command:`openstack server` command does not allow users to associate a floating IP address with a specific fixed IP address using the optional ``--fixed-address`` parameter, which legacy commands required as an argument.
id: Perintah :command:`openstack server` tidak mengizinkan pengguna untuk mengasosiasikan alamat IP mengambang dengan alamat IP tetap tertentu menggunakan opsional parameter ``--fixed-address``, dimana perintah legacy diperlukan sebagai argumen.

source: The :guilabel:`Create An Image` dialog box appears.
id: Dialog box :guilabel:`Create An Image` akan muncul.

source: The :guilabel:`Create Pseudo-Folder in Container` ``<name>`` dialog box is displayed. ``<name>`` is the name of the container to which you are uploading the object.
id: Dialog box :guilabel:`Create Pseudo-Folder in Container` ``<name>`` akan ditampilkan. ``<name>`` is nama kontainer dimana Anda sedang upload objek.

source: The :guilabel:`Edit Object` dialog box is displayed.
id: Dialog box :guilabel:`Edit Object` akan ditampilkan.

source: The :guilabel:`IP Address` field is filled automatically, but you can add a new IP address by clicking the :guilabel:`+` button.
id: Field (kolom) :guilabel:`IP Address` adalah diisi secara otomatis, tetapi Anda dapat menambahkan alamat IP baru dengan mengklik tombol :guilabel:`+`.

source: The :guilabel:`Images` category shows the instance snapshot.
id: Kategori :guilabel:`Images` menunjukkan instance snapshot.

source: The :guilabel:`Router Name` and :guilabel:`Router ID` fields are automatically updated.
id: Field (kolom) :guilabel:`Router Name` dan :guilabel:`Router ID` secara otomatis diperbarui.

source: The :guilabel:`Update Stack Parameters` window appears.
id: Window :guilabel:`Update Stack Parameters` akan muncul.

source: The :guilabel:`Upload File To Container: <name>` dialog box appears. ``<name>`` is the name of the container to which you are uploading the object.
id: Muncul dialog box :guilabel:`Upload File To Container: <name>`. ``<name>`` adalah nama dari kontainer dimana Anda sedang upload objek.

source: The :guilabel:`Upload Object To Container`: ``<name>`` dialog box is displayed.
id: Dialog box :guilabel:`Upload Object To Container`: ``<name>`` akan ditampilkan.

source: The CIDR of the subnet.
id: CIDR dari subnet.

source: The Compute database registers the public key of the key pair.
id: Database Compute meregister kunci publik dari pasangan kunci (key pair).

source: The Dashboard lists the key pair on the :guilabel:`Access & Security` tab.
id: Dashboard mendaftar pasangan kunci (key pair) pada tab :guilabel:`Access & Security`.

source: The Database service provides scalable and reliable cloud provisioning functionality for both relational and non-relational database engines. Users can quickly and easily use database features without the burden of handling complex administrative tasks.
id: Layanan Database menyediakan secara fungsionalitas cloud provisioning terukur (scalable) dan handal (reliable) untuk kedua mesin database relasional dan non-relasional. Pengguna dengan cepat dan mudah dapat menggunakan fitur database yang tanpa beban menangani tugas administrasi yang kompleks.

source: The GNU tar format. Includes the long name, long link, and sparse extensions.
id: Format tar GNU. Termasuk nama panjang, hubungan yang panjang, dan ekstensi jarang.

source: The ID of the source object.
id: ID dari objek sumber.

source: The IP address is returned to the pool of IP addresses that is available for all projects. If the IP address is still associated with a running instance, it is automatically disassociated from that instance.
id: Alamat IP dikembalikan ke kolam alamat IP yang tersedia untuk semua proyek. Jika alamat IP masih berkaitan dengan instance menjalankan, maka secara otomatis memisahkan diri dari instance itu.

source: The Image service Python bindings do not support the retrieval of an image object by name. However, the Compute Python bindings enable you to get an image object by name. To get an image object by name, call the ``novaclient.v2.images.ImageManager.find`` method:
id: Image service Python bindings tidak mendukung pengambilan obyek image dengan nama. Namun, Compute Python bindings mengaktifkan Anda untuk mendapatkan sebuah objek image dengan nama. Untuk mendapatkan obyek image dengan nama, sebut (call) metode ``novaclient.v2.images.ImageManager.find``:

source: The MD5 checksum of the content of the segment object. This value must match the ``ETag`` of that object.
id: MD5 checksum dari isi dari objek segmen. Nilai ini harus sesuai dengan ``ETag`` dari objek itu.

source: The Object Storage API appends the first 32 characters of the ``X-Trans-Id-Extra`` request header value to the transaction ID value in the generated ``X-Trans-Id`` response header. You must UTF-8-encode and then URL-encode the extra transaction information before you include it in the ``X-Trans-Id-Extra`` request header.
id: Objek Storage API menambahkan 32 karakter pertama dari nilai header permintaan (request) ``X-Trans-Id-Extra`` ke nilai ID transaksi di header respon ``X-Trans-Id`` yang dihasilkan. Anda harus UTF-8-encode dan kemudian URL-encode informasi transaksi tambahan sebelum Anda memasukkannya dalam header permintaan ``X-Trans-Id-Extra``.

source: The Object Storage system extracts files from the archive file and creates an object.
id: Sistem Object Storage ekstrak file dari file arsip dan menciptakan sebuah objek.

source: The OpenStack Networking service provides a scalable system for managing the network connectivity within an OpenStack cloud deployment. It can easily and quickly react to changing network needs (for example, creating and assigning new IP addresses).
id: Layanan OpenStack Networking menyediakan sistem scalable untuk mengelola konektivitas jaringan dalam pengerahan OpenStack cloud. Hal ini dapat dengan mudah dan cepat bereaksi terhadap perubahan kebutuhan jaringan (misalnya, menciptakan dan menetapkan alamat IP baru).

source: The OpenStack Object Storage service provides the ``swift`` client, which is a command-line interface (CLI). Use this client to list objects and containers, upload objects to containers, and download or delete objects from containers. You can also gather statistics and update metadata for accounts, containers, and objects.
id: Layanan Object Storage OpenStack menyediakan klien ``swift``, yang merupakan antarmuka baris perintah, command-line interface (CLI). Gunakan klien ini untuk daftar objek dan kontainer, upload objek untuk kontainer, dan download atau menghapus objek dari kontainer. Anda juga dapat mengumpulkan statistik dan memperbarui metadata piutang, kontainer, dan objek.

source: The Orchestration service enables you to orchestrate multiple composite cloud applications. This service supports use of both the Amazon Web Services (AWS) CloudFormation template format through both a Query API that is compatible with CloudFormation and the native OpenStack :term:`Heat Orchestration Template (HOT)` format through a REST API.
id: Layanan Orchestration memungkinkan Anda untuk mengatur beberapa aplikasi komposit cloud. Layanan ini mendukung penggunaan kedua Amazon Web Services (AWS) format template CloudFormation baik melalui API Query yang kompatibel dengan CloudFormation maupun OpenStack asli format :term:`Heat Orchestration Template (HOT)` melalui REST API.

source: The POSIX.1-1988 Ustar format.
id: Format POSIX.1-1988 Ustar.

source: The POSIX.1-2001 pax format.
id: Format pax POSIX.1-2001

source: The Python script output looks something like this:
id: Output script Python terlihat seperti ini:

source: The Static Web filter must be added to the pipeline in your ``/etc/swift/proxy-server.conf`` file below any authentication middleware. You must also add a Static Web middleware configuration section.
id: Static Web filter harus ditambahkan ke pipa (pipeline) di file Anda ``/etc/swift/proxy-server.conf`` di bawah setiap middleware otentikasi. Anda juga harus menambahkan bagian konfigurasi Web middleware statis.

source: The `OpenStack Python Software Development Kit (SDK) <https://pypi.python.org/pypi/openstacksdk>`_ is used to write Python automation scripts that create and manage resources in your OpenStack cloud. The SDK implements Python bindings to the OpenStack API, which enables you to perform automation tasks in Python by making calls on Python objects, rather than making REST calls directly.
id: `OpenStack Python Software Development Kit (SDK) <https://pypi.python.org/pypi/openstacksdk>`_ digunakan untuk menulis Python otomatisasi skrip yang membuat dan mengelola sumber daya di cloud OpenStack Anda. SDK mengimplementasikan Python binding ke API OpenStack, yang memungkinkan Anda untuk melakukan tugas otomatisasi di Python dengan membuat panggilan pada objek Python, daripada membuat panggilan REST langsung.

source: The ``--parameter`` values that you specify depend on the parameters that are defined in the template. If a website hosts the template file, you can also specify the URL with the ``--template`` parameter.
id: Nilai ``--parameter`` dimana Anda tentukan tergantung pada parameter yang didefinisikan dalam template. Jika sebuah situs web menjadi host file template, Anda juga dapat menentukan URL dengan parameter ``--template``.

source: The ``BACKUP_ID`` of the parent backup. In this case, the parent is the regular backup, with an ID of ``6dc3a9b7-1f3e-4954-8582-3f2e4942cddd``
id: ``BACKUP_ID`` dari cadangan parent (parent backup). Dalam hal ini, parent adalah backup secara teratur, dengan ID dari ``6dc3a9b7-1f3e-4954-8582-3f2e4942cddd``

source: The ``COPY`` operation does not create a manifest object. To duplicate a manifest object, use the ``GET`` operation to read the value of ``X-Object-Manifest`` and use this value in the ``X-Object-Manifest`` request header in a ``PUT`` operation. This creates a new manifest object that shares the same set of segment objects as the original manifest object.
id: Operasi ``COPY`` tidak membuat objek nyata. Untuk menduplikasi objek manifest, gunakan operasi ``GET`` untuk membaca nilai ``X-Object-Manifest`` dan menggunakan nilai ini dalam header request ``X-Object-Manifest`` dalam operasi ``PUT ``. Ini menciptakan objek manifest baru yang berbagi set (pengaturan) objek segmen yang sama sebagai objek manifest asli.

source: The ``Content-Length`` request header must contain the length of the JSON content and not the length of the segment objects. However, after the ``PUT`` operation completes, the ``Content-Length`` metadata is set to the total length of all the object segments. A similar situation applies to the ``ETag``. If used in the ``PUT`` operation, it must contain the MD5 checksum of the JSON content. The ``ETag`` metadata value is then set to be the MD5 checksum of the concatenated ``ETag`` values of the object segments. You can also set the ``Content-Type`` request header and custom object metadata.
id: Header permintaan ``Content-Length`` harus berisi panjang konten JSON dan tidak panjang object segmen. Namun, setelah operasi ``PUT`` selesai, metadata ``Content-Length`` diatur untuk total panjang semua segmen objek. Situasi serupa berlaku untuk ``ETag``. Jika digunakan dalam operasi ``PUT``, itu harus berisi checksum MD5 dari konten JSON. Nilai metadata ``ETag`` kemudian diatur menjadi checksum MD5 dari nilai `` ETag`` bersambung (concatenated) dari segmen objek. Anda juga dapat mengatur header permintaan ``Content-Type`` dan objek kustom metadata.

source: The ``DELETE`` operation is supported for backwards compatibility.
id: Operasi ``DELETE`` didukung untuk kompatibilitas mundur.

source: The ``INSTANCE_ID`` of the database instance you are doing the incremental backup for (in this example, ``792a6a56-278f-4a01-9997-d997fa126370``)
id: ``INSTANCE_ID`` dari name database Anda melakukan inkremental backup untuk (dalam contoh ini, ``792a6a56-278f-4a01-9997-d997fa126370``)

source: The ``Length Required (411)`` response code indicates that the request does not include a required ``Content-Length`` or ``Content-Type`` header.
id: Kode respon ``Length Required (411)`` menunjukkan bahwa permintaan tidak termasuk yang diperlukan header ``Content-Length`` atau ``Content-Type``.

source: The ``Unprocessable Entity (422)`` response code indicates that the MD5 checksum of the data written to the storage system does NOT match the optional ETag value.
id: Kode respon ``Unprocessable Entity (422)`` menunjukkan bahwa checksum MD5 dari data ditulis ke sistem penyimpanan TIDAK cocok dengan nilai ETag opsional.

source: The ``X-Delete-After`` header will be converted to ``X-Delete-At``. Verify the ``X-Delete-At`` header has posted to the object:
id: Header ``X-Delete-After`` akan dikonversi ke ``X-Delete-At``. Lakukan verifikasi header ``X-Delete-At`` yang telah diposting ke objek:

source: The ``X-Object-Manifest`` value is the ``CONTAINER/PREFIX``, which indicates where the segment objects are located. You supply this request header in the ``PUT`` operation.
id: Nilai ``X-Object-Manifest`` adalah ``CONTAINER/PREFIX``, yang menunjukkan dimana objek segmen berada. Anda menyediakan header permintaan (request) ini dalam operasi ``PUT``.

source: The ``myDB`` database.
id: Database ``myDB``.
