Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: OpenStack Object Storage (swift) is used for redundant, scalable data storage using clusters of standardized servers to store petabytes of accessible data. It is a long-term storage system for large amounts of static data which can be retrieved and updated.
id: OpenStack Object Storage (swift) digunakan untuk penyimpanan berlebihan, data terukur menggunakan cluster server standar untuk menyimpan petabyte data diakses. Ini adalah sistem penyimpanan jangka panjang untuk sejumlah besar data statis yang dapat diambil dan diperbarui.

source: OpenStack Object Storage provides a distributed, API-accessible storage platform that can be integrated directly into an application or used to store any type of file, including VM images, backups, archives, or media files. In the OpenStack dashboard, you can only manage containers and objects.
id: OpenStack Object Storage menyediakan didistribusikan, platform penyimpanan API-accessible yang dapat diintegrasikan langsung ke aplikasi atau digunakan untuk menyimpan semua jenis file, termasuk image VM, backup, arsip, atau file media. Di dashboard OpenStack, Anda hanya dapat mengelola kontainer dan objek.

source: OpenStack Orchestration is a service that you can use to orchestrate multiple composite cloud applications. This service supports the use of both the Amazon Web Services (AWS) CloudFormation template format through both a Query API that is compatible with CloudFormation and the native OpenStack :term:`Heat Orchestration Template (HOT)` format through a REST API.
id: OpenStack Orchestration adalah layanan yang dapat Anda gunakan untuk mengatur beberapa aplikasi cloud komposit. Layanan ini mendukung penggunaan format template Amazon Web Services (AWS) CloudFormation melalui format Query API yang kompatibel dengan CloudFormation ataupun format asli OpenStack :term:`Heat Orchestration Template (HOT)` melalui REST API.

source: OpenStack command-line clients
id: OpenStack klien baris perintah (command-line client)

source: OpenStack command-line clients: Each core OpenStack project has a command-line client that you can use to run simple commands to view, create, and manage resources in a cloud and automate tasks by using scripts.
id: Klien baris perintah OpenStack: Setiap proyek OpenStack inti memiliki klien baris perintah (command-line client) yang dapat Anda gunakan untuk menjalankan perintah sederhana untuk melihat, membuat, dan mengelola sumber daya di cloud dan mengotomatisasi tugas dengan menggunakan script.

source: OpenStack command-line interface cheat sheet
id: OpenStack lembar contekan antarmuka baris perintah (command-line)

source: OpenStack dashboard
id: Dashboard OpenStack

source: OpenStack dashboard: Use this web-based graphical interface, code named `horizon <https://git.openstack.org/cgit/openstack/horizon>`__, to view, create, and manage resources.
id: OpenStack dashboard: Gunakan antarmuka grafis berbasis web ini, kode dinamai `horizon <https://git.openstack.org/cgit/openstack/horizon>`__, untuk melihat, membuat, dan mengelola sumber daya.

source: OpenStack is an open-source cloud computing platform for public and private clouds. A series of interrelated projects deliver a cloud infrastructure solution. This guide shows OpenStack end users how to create and manage resources in an OpenStack cloud with the OpenStack dashboard and OpenStack client commands.
id: OpenStack merupakan open-source platform komputasi cloud untuk cloud publik dan private. Serangkaian proyek yang saling terkait memberikan solusi infrastruktur cloud. Panduan ini menunjukkan pengguna akhir OpenStack tentang cara membuat dan mengelola sumber daya di cloud OpenStack dengan dashboard OpenStack dan perintah klien OpenStack.

source: OpenStack metadata format
id: Format metadata OpenStack

source: OpenStack provides four different options for interacting with its APIs from Python, each targeting a slightly different user:
id: OpenStack menyediakan empat pilihan yang berbeda untuk berinteraksi dengan API dari Python, masing-masing menargetkan pengguna yang sedikit berbeda:

source: OpenStack supports booting instances using ISO images. But before you make such instances functional, use the :command:`openstack server create` command with the following parameters to boot an instance:
id: OpenStack mendukung instance booting menggunakan image ISO. Tapi sebelum Anda membuat instance seperti fungsional, gunakan perintah :command:`openstack server create` dengan parameter berikut untuk boot sebuah instance:

source: Operating system
id: Sistem operasi

source: Optionally provide a comma separated list of databases to create, for example:
id: Secara opsional memberikan daftar database dipisahkan dengan koma dalam pembuatan, misalnya:

source: Optionally, a specific container
id: Opsional, wadah spesifik (specific container)

source: Optionally, a specific object prefix
id: Opsional, awalan objek spesifik (specific object prefix)

source: Optionally, in the :guilabel:`Add Interface` dialog box, set an :guilabel:`IP Address` for the router interface for the selected subnet.
id: Secara optional, dalam dialog box :guilabel:`Add Interface` , aturlah :guilabel:`IP Address` untuk antarmuka router untuk subnet yang dipilih.

source: Optionally, you can provide a key name for access control and a security group for security. You can also include metadata key and value pairs. For example, you can add a description for your server by providing the ``--property description="My Server"`` parameter.
id: Secara opsional, Anda dapat memberikan nama kunci untuk kontrol akses dan kelompok keamanan untuk keamanan. Anda juga bisa memasukkan kunci metadata dan nilai pasangan. Misalnya, Anda dapat menambahkan deskripsi untuk server Anda dengan penyediaan parameter ``--property description = "My Server"``.

source: Orchestration is compatible with the CloudFormation template, but you can also write heat templates to orchestrate cloud resources.
id: Orchestration kompatibel dengan template CloudFormation, tetapi Anda juga dapat menulis template heat (heat template) untuk mengatur sumber daya cloud.

source: Origin
id: Origin (asal muasal)

source: Overview
id: Iktisar

source: Page through large lists of containers or objects
id: Halaman keseluruhan daftar besar kontainer atau objek (containers atau objects)

source: Pass in ``replica_1``'s instance ID with the :command:`trove show` command to verify that the newly created ``replica_1`` instance is a replica of the original ``base_1``. Note that the ``replica_of`` property is set to the ID of ``base_1``.
id: Lewatkan dalam ID instance ``replica_1`` ini dengan perintah :command:`trove show` untuk memverifikasi bahwa instance ``replica_1`` baru dibuat adalah replika dari yang asli ``base_1``. Perhatikan bahwa ``replica_of`` properti diatur ke ID dari ``base_1``.

source: Pass in the data store version ID with the :command:`trove configuration-parameter-list` command to get the available options:
id: Melewatkan dalam ID versi penyimpanan data dengan perintah :command:`trove configuration-parameter-list` untuk mendapatkan opsi yang tersedia:

source: Pause
id: Pause (berhenti sebentar)

source: Pause and unpause an instance
id: Menunda dan melanjutkan sebuah instance

source: Pause, suspend, and stop operations are not allowed when an instance is running in rescue mode, as triggering these actions causes the loss of the original instance state, and makes it impossible to unrescue the instance.
id: Jeda, menangguhkan, dan berhenti operasi tidak diperbolehkan ketika sebuah instance berjalan dalam modus penyelamatan (rescue), seperti memicu tindakan ini menyebabkan hilangnya instance keadaan semula, dan tidak memungkinkan untuk unrescue instance.

source: Pause, suspend, stop, rescue, resize, rebuild, reboot an instance
id: Pause, suspend, stop, rescue, resize, rebuild, reboot instance

source: Per-project client libraries
id: Perpustakaan klien per-proyek

source: Plain text response format. The default.
id: Format respon plain text. Default.

source: Pool
id: Pool (kolam)

source: Print the flavor details, id and name by calling ``print_flavors``:
id: Mencetak rincian flavor, id dan nama dengan pemanggilan ``print_flavors``:

source: Print the floating IP object details by calling ``print_values_ip``:
id: Cetak rincian objek IP mengambang dengan pemanggilan ``print_values_ip``:

source: Print the host object details by calling ``print_hosts(host_list)``:
id: Mencetak rincian obyek host dengan pemanggilan ``print_hosts(host_list)``:

source: Print values
id: Cetak nilai

source: Projects are organizational units in the cloud and are also known as tenants or accounts. Each user is a member of one or more projects. Within a project, a user creates and manages instances.
id: Proyek adalah unit organisasi di cloud dan juga dikenal sebagai penyewa (tenant) atau rekening (account). Setiap pengguna (user) adalah anggota dari satu atau lebih proyek. Dalam sebuah proyek, pengguna membuat dan mengelola instance.

source: Provide user data to instances
id: Memberikan data user ke instance

source: Pseudo-folders are similar to folders in your desktop operating system. They are virtual collections defined by a common prefix on the object's name.
id: Pseudo-folder adalah serupa dengan folder dalam sistem operasi desktop Anda. Mereka adalah koleksi maya didefinisikan oleh prefiks umum pada nama objek.

source: Pseudo-hierarchical folders and directories
id: Folder dan direktori pseudo-hierarchical

source: Query ports with specified fixed IP addresses:
id: Query port dengan alamat IP tetap tertentu:

source: Query routers and config servers
id: Router kueri dan server config

source: RESTful web services
id: Layanan web RESTful

source: Reboot
id: Reboot (booting ulang)

source: Reboot an instance
id: Reboot instance

source: Rebuild
id: Rebuild (membangun kembali)

source: Reference for cloud-init version
id: Referensi untuk versi cloud-init

source: Removal or addition of segment objects
id: Penghapusan atau penambahan objek segmen

source: Remove a shelved instance - Removes the instance from the server; data and resource associations are deleted. If an instance is no longer needed, you can move the instance off the hypervisor in order to minimize resource usage.
id: Hapus instance dipetieskan - Menghapus instance dari server; asosiasi data dan sumber daya akan dihapus. Jika instance tidak lagi diperlukan, Anda dapat memindahkan instance dari hypervisor untuk meminimalkan penggunaan sumber daya.

source: Removes a bare-metal node and any associated interfaces.
id: Menghapus node bare-metal dan setiap interface yang terkait.

source: Removes a network interface from a bare-metal node.
id: Menghapus antarmuka jaringan dari node bare-metal.

source: Replace ROUTER with the unique identifier of the router, replace NETWORK with the unique identifier of the external provider network.
id: Ganti ROUTER dengan identifier unik router, ganti NETWORK dengan identifier unik dari jaringan operator eksternal.

source: Replace ROUTER with the unique identifier of the router, replace SUBNET with the unique identifier of the subnet.
id: Ganti ROUTER dengan identifier unik router, ganti SUBNET dengan identifier unik subnet.

source: Replace ``DATASTORE_NAME`` with the name that the administrative user set when issuing the :command:`trove-manage` command to create the datastore. You can use the trove :command:`datastore-list` command to display the datastores that are available in your environment.
id: Ganti ``DATASTORE_NAME`` dengan nama yang pengguna administratif ditetapkan pada saat menerbitkan perintah :command:`trove-manage` untuk membuat datastore. Anda dapat menggunakan perintah trove :command:`datastore-list` untuk menampilkan datastore yang tersedia di lingkungan Anda.

source: Replicas are read-only.
id: Replika read-only.

source: Requirements and guidelines
id: Persyaratan dan pedoman

source: Rescue
id: Rescue (menyelamatkan)

source: Rescue mode provides a mechanism for access, even if an image renders the instance inaccessible. By default, it starts an instance from the initial image attaching the current boot disk as a secondary one.
id: Mode penyelamatan (rescue) menyediakan mekanisme untuk akses, bahkan jika image menjadikan instance tidak dapat diakses. Secara default, itu dimulai sebuah instance dari image awal menghubungkan boot disk saat ini sebagai salah satu instance sekunder.

source: Resize
id: Resize (mengubah ukuran)

source: Resources
id: Summer days

source: Respond to the prompt to download the key pair.
id: Menanggapi permintaan untuk mengunduh sepasang kunci (key pair).

source: Restart Database services on the controller node:
id: Restart layanan Database pada kontroler node:

source: Restoring a database instance from an incremental backup is the same as creating a database instance from a regular backup—the Database service handles the complexities of applying the chain of incremental backups.
id: Memulihkan name database dari inkremental backup (cadangan) adalah sama seperti membuat name database dari cadangan-layanan database biasa menangani kompleksitas menerapkan rantai inkremental backup.

source: Root volume size in GB: ``5``
id: Ukuran volume root dalam GB: ``5``

source: Round robin: Rotates requests evenly between multiple instances.
id: Round robin: Memutar permintaan merata antara beberapa instance.

source: Rules are automatically enforced as soon as you create or modify them.
id: Aturan secara otomatis diberlakukan segera setelah Anda membuat atau memodifikasi mereka.

source: Run the "Sleep for five seconds" command, and determine whether the server/vm was created by calling ``nova_client.servers.list()``:
id: Jalankan (run) perintah "Sleep for five seconds", dan tentukan apakah server/vm dibuat dengan pemanggilan ``nova_client.servers.list()``:

source: Run the :command:`openstack server delete` command to delete the instance. The following example shows deletion of the ``newServer`` instance, which is in ``ERROR`` state:
id: Jalankan perintah :command:`openstack server delete` untuk menghapus instance. Contoh berikut menunjukkan penghapusan instance ``newServer``, yang dalam keadaan ``ERROR``:

source: Run the following command to allocate a floating IP address to the current project. By default, the floating IP address is allocated from the public pool. The command outputs the allocated IP address:
id: Jalankan perintah berikut untuk mengalokasikan alamat IP mengambang untuk proyek ini. Secara default, alamat IP mengambang dialokasikan dari kolam umum (public pool). Perintah output alamat IP yang dialokasikan:

source: Save the ``*.pem`` file locally.
id: Simpan file ``*.pem`` secara local.

source: Schedule objects for deletion
id: Jadwal objek untuk penghapusan

source: Scheduling an object for deletion is helpful for managing objects that you do not want to permanently store, such as log files, recurring full backups of a dataset, or documents or images that become outdated at a specified time.
id: Penjadwalan obyek untuk penghapusan membantu untuk mengelola objek yang Anda tidak ingin menyimpan secara permanen, seperti file log, backup penuh dari dataset berulang, atau dokumen atau image yang menjadi usang pada waktu tertentu.

source: Search for an instance using IP address
id: Mencari instance menggunakan alamat IP

source: Security Groups
id: Security Groups (kelompok keamanan)

source: Security groups are a kind of cloud firewall that define which incoming network traffic is forwarded to instances.
id: Kelompok keamanan adalah jenis firewall cloud yang menentukan dimana traffic jaringan yang masuk diteruskan ke instance.

source: See the Cloud Administrator Guide for a complete example of the `/etc/swift/proxy-server.conf file <https://docs.openstack.org/ocata/config-reference/object-storage/proxy-server.html#sample-proxy-server-configuration-file>`_ (including static web).
id: Lihat Cloud Administrator Guide untuk contoh lengkap dari `/etc/swift/proxy-server.conf file <https://docs.openstack.org/ocata/config-reference/object-storage/proxy-server.html#sample-proxy-server-configuration-file>`_ (termasuk web statis).

source: See the Cloud Administrator Guide for an example of the `static web configuration syntax <https://docs.openstack.org/ocata/config-reference/object-storage/features.html#static-web-sites>`_.
id: Lihat Cloud Administrator Guide untuk contoh `static web configuration syntax <https://docs.openstack.org/ocata/config-reference/object-storage/features.html#static-web-sites>`_.

source: Segment object container name
id: Nama kontainer objek segmen

source: Segment object size and number
id: Ukuran dan nomor objek segmen

source: Segment objects can be any size.
id: Objek segmen dapat berbagai ukuran.

source: Segment objects must be at least 1 MB in size (by default). The final segment object can be any size. At most, 1000 segments are supported (by default).
id: Objek segmen harus minimal 1 MB (secara default). Objek segmen akhir dapat ukuran. Paling banyak, 1000 segmen yang didukung (secara default).

source: Select a volume from which to create a snapshot.
id: Pilih volume yang untuk membuat snapshot.

source: Select an instance.
id: Pilih sebuah instance.

source: Select the :guilabel:`Public` check box to make the image public.
id: Pilih check box :guilabel:`Public` untuk membuat image publik.

source: Select the appropriate project from the drop down menu at the top left.
id: Pilih proyek yang sesuai dari menu drop down di bagian kiri atas.

source: Select the appropriate project from the drop-down menu at the top left.
id: Pilih proyek yang sesuai dari menu drop-down di bagian kiri atas.

source: Select the check boxes for the security services that you want to delete.
id: Pilih kotak centang (check box) untuk layanan keamanan yang ingin Anda hapus.

source: Select the check boxes for the share networks that you want to delete.
id: Pilih kotak centang (check box) untuk jaringan bersama yang ingin Anda hapus.

source: Select the check boxes for the shares that you want to delete.
id: Pilih kotak centang (check box) untuk share yang ingin Anda hapus.

source: Select the check boxes for the volumes that you want to delete.
id: Pilih kotak centang (check box) untuk volume yang ingin Anda hapus.

source: Select the container in which you want to store your object.
id: Pilih wadah di mana Anda ingin menyimpan objek.

source: Select the default security group and click :guilabel:`Manage Rules`.
id: Pilih kelompok keamanan default dan klik :guilabel:`Manage Rules`.

source: Select the image format (for example, QCOW2) for the image.
id: Pilih format image (misalnya, QCOW2) untuk image.

source: Select the image that you want to edit.
id: Pilih image yang ingin Anda edit.

source: Select the images that you want to delete.
id: Pilih image yang ingin Anda hapus.

source: Select the instance from which to create a snapshot.
id: Pilih instance yang membuat snapshot.

source: Select the instance you want to back up.
id: Pilih instance Anda ingin membuat cadangan (backup)

source: Select the load balancer you want to delete and click the :guilabel:`Delete Load Balancer` button.
id: Pilih penyeimbang beban yang ingin Anda hapus dan klik tombol :guilabel:`Delete Load Balancer`.

source: Select the stack that you want to delete.
id: Pilih stack yang ingin Anda hapus.

source: Select the stack that you want to update.
id: Pilih stack yang ingin Anda update.

source: Select the volume and click :guilabel:`Manage Attachments`.
id: Pilih volume dan klik :guilabel:`Manage Attachments`.

source: Select the volume or volume snapshot from which to boot. Enter a device name. Enter ``vda`` for KVM images or ``xvda`` for Xen images.
id: Pilih volume atau volume snapshot dari mana untuk boot. Masukkan nama perangkat. Masukkan ``vda`` untuk image KVM atau ``xvda`` untuk image Xen.

source: Select the volume that you want to edit.
id: Pilih volume yang ingin Anda edit.

source: Select the volume to add to an instance and click :guilabel:`Manage Attachments`.
id: Pilih volume untuk menambahkan ke sebuah instance dan klik :guilabel:`Manage Attachments`.

source: Select this check box if you want the service to roll back changes if the stack fails to launch.
id: Pilih kotak centang (check box) ini jika Anda ingin layanan untuk memutar kembali perubahan ke semula (roll back change) jika tumpukan gagal untuk memulai meluncur.

source: Select this check box to ensure that only users with permissions can delete the image. ``Yes`` or ``No``.
id: Pilih kotak centang (check box) ini untuk memastikan bahwa hanya pengguna dengan hak akses dapat menghapus image. ``Yes`` atau ``No``.

source: Selected Networks
id: Jaringan yang dipilih (Selected Networks)

source: Serialized response formats
id: Format respon serial

source: Server names are not guaranteed to be unique when created so you could have two instances with the same host name.
id: Nama server tidak dijamin untuk menjadi unik ketika dibuat sehingga Anda bisa memiliki dua instance dengan nama host yang sama.

source: Set *VALUES* as a JSON dictionary, for example:
id: Set *VALUES* sebagai kamus JSON, misalnya:

source: Set an object to expire after a relative amount of time (in seconds):
id: Atur objek untuk berakhir setelah jumlah waktu relatif (dalam detik):

source: Set an object to expire at an absolute time (in Unix time). You can get the current Unix time by running ``date +'%s'``.
id: Atur objek untuk berakhir pada waktu yang mutlak (dalam waktu Unix). Anda bisa mendapatkan waktu Unix saat ini dengan menjalankan ``date +'%s'``.

source: Set environment variables
id: Atur variabel lingkungan

source: Set error pages for static website
id: Mengatur halaman kesalahan untuk website statis

source: Set error pages for static website request
id: Mengatur halaman kesalahan untuk permintaan website statis

source: Set metadata on an instance
id: Set metadata on an instance (mengatur metadata pada instance)

source: Set site index file
id: Atur file index site

source: Set the ``--availability-zone`` parameter to specify which zone or node to use to start the server. Separate the zone from the host name with a comma. For example:
id: Atur parameter ``--availability-zone`` untuk menentukan zona atau node digunakan untuk memulai server. Pisahkan zona dari nama host dengan koma. Sebagai contoh:

source: Set the ``Content-Type`` request header to ``text/plain``.
id: Mengatur request header ``Content-Type`` ke ``text/plain``.

source: Set the index file. In this case, ``index.html`` is the default file displayed when the site appears.
id: Mengatur file indeks. Dalam hal ini, ``index.html`` adalah file default ditampilkan ketika situs muncul.

source: Set up clustering
id: Mengatur pengelompokan (clustering)

source: Set up database clustering
id: Pengaturan pengelompokan database

source: Set up database replication
id: Mengatur replikasi database

source: Set up replication
id: Mengatur replikasi

source: Shares are file storage that you provide access to instances. You can allow access to a share to a running instance or deny access to a share and allow access to it to another instance at any time. You can also delete a share. You can create snapshot from a share if the driver supports it. Only administrative users can create share types.
id: Share adalah penyimpanan file yang Anda berikan akses ke instance. Anda dapat mengizinkan akses berbagi (share) untuk instance yang sedang berjalan atau menolak akses berbagi dan mengizinkan akses itu untuk instance lain setiap saat. Anda juga dapat menghapus share. Anda dapat membuat snapshot dari share jika driver mendukungnya. Hanya pengguna administratif dapat membuat tipe share.
