Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: You can now access the new database you just created (myDB) by using typical database access commands. In this MySQL example, replace ``IP_ADDRESS`` with ``172.16.200.2``.
id: Anda sekarang dapat mengakses database baru yang baru saja dibuat (myDB) dengan menggunakan perintah akses database tipikal. Dalam contoh MySQL ini, menggantikan ``IP_ADDRESS`` dengan ``172.16.200.2``.

source: You can now pass in the instance ID with the :command:`trove show` command to get the IP address of the instance. In this example, replace ``INSTANCE_ID`` with ``5599dad6-731e-44df-bb60-488da3da9cfe``.
id: Anda sekarang dapat melewatkan instance ID dengan perintah :command:`trove show` untuk mendapatkan alamat IP dari instance. Dalam instance ini, gantikan ``INSTANCE_ID`` dengan ``5599dad6-731e-44df-bb60-488da3da9cfe``.

source: You can only assign these headers to objects. For more information, see `www.w3.org/TR/access-control/ <http://www.w3.org/TR/access-control/>`__.
id: Anda hanya dapat menetapkan header ini ke objek. Untuk informasi lebih lanjut, lihat `www.w3.org/TR/access-control/ <http://www.w3.org/TR/access-control/>`__.

source: You can pass user data in a local file at instance launch by using the ``--user-data USER-DATA-FILE`` parameter.
id: Anda dapat melewatkan data pengguna dalam file lokal di peluncuran instance dengan menggunakan parameter ``--user-data USER-DATA-FILE``.

source: You can place user data in a local file and pass it through the ``--user-data <user-data-file>`` parameter at instance creation.
id: Anda dapat menempatkan data user dalam file lokal dan menyebarkannya melalui parameter ``--user-data <user-data-file>`` di pembuatan instance.

source: You can resize or rebuild an instance. You can also choose to view the instance console log, edit instance or the security groups. Depending on the current state of the instance, you can pause, resume, suspend, soft or hard reboot, or terminate it.
id: Anda dapat mengubah ukuran atau membangun kembali sebuah instance. Anda juga dapat memilih untuk melihat log konsol instance, mengedit instance atau kelompok keamanan. Tergantung pada keadaan saat ini instance, Anda dapat menghentikan sebentar, melanjutkan, menangguhkan, reboot lembut atau keras, atau mengakhiri itu.

source: You can run the following shelving tasks:
id: Anda dapat menjalankan tugas peletakan (shelving) berikut:

source: You can schedule Object Storage (swift) objects to expire by setting the ``X-Delete-At`` or ``X-Delete-After`` header. Once the object is deleted, swift will no longer serve the object and it will be deleted from the cluster shortly thereafter.
id: Anda dapat menjadwalkan obyek dari Object Storage (swift) berakhir dengan menetapkan header ``X-Delete-At`` atau ``X-Delete-After``. Setelah objek dihapus, swift tidak akan lagi melayani objek dan akan dihapus dari cluster tidak lama kemudian.

source: You can search for an instance using the IP address parameter, ``--ip``, with the :command:`openstack server list` command.
id: Anda dapat mencari instance menggunakan parameter alamat IP, ``--ip``, dengan perintah :command:`openstack server list`.

source: You can set the ``Accept`` request header to one of the following values to define the response format:
id: Anda dapat mengatur request header ``Accept`` ke salah satu nilai berikut untuk menentukan format respon:

source: You can set the ``Accept`` request header to one of these values to define the response format:
id: Anda dapat mengatur header permintaan ``Accept`` ke salah satu nilai ini untuk menentukan format respon:

source: You can soft or hard reboot a running instance. A soft reboot attempts a graceful shut down and restart of the instance. A hard reboot power cycles the instance.
id: Anda dapat reboot lembut atau keras dalam menjalankan instance. A reboot lembut mencoba shutdown anggun dan restart instance. Sebuah daya reboot keras memutar instance.

source: You can specify a MAC address with ``--mac-address MAC_ADDRESS``. If you specify an invalid MAC address, including ``00:00:00:00:00:00`` or ``ff:ff:ff:ff:ff:ff``, you will get an error.
id: Anda dapat menentukan alamat MAC dengan ``--mac-address MAC_ADDRESS``. Jika Anda menentukan alamat MAC yang tidak valid, termasuk ``00:00:00:00:00:00`` atau ``ff:ff:ff:ff:ff:ff``, Anda akan mendapatkan error.

source: You can store data across multiple machines by setting up MongoDB sharded clusters.
id: Anda dapat menyimpan data di beberapa mesin dengan pengaturan kluster sharded MongoDB .

source: You can store multiple versions of your content so that you can recover from unintended overwrites. Object versioning is an easy way to implement version control, which you can use with any type of content.
id: Anda dapat menyimpan beberapa versi dari konten Anda sehingga Anda dapat pulih dari timpaan yang tidak diinginkan. Objek versi adalah cara mudah untuk menerapkan kontrol versi, yang dapat Anda gunakan dengan semua tipe konten.

source: You can track usage for instances for each project. You can track costs per month by showing meters like number of vCPUs, disks, RAM, and uptime for all your instances.
id: Anda dapat melacak penggunaan instance untuk setiap proyek. Anda dapat melacak biaya per bulan dengan menunjukkan meter seperti jumlah vCPUs, disk, RAM, dan uptime untuk semua instance Anda.

source: You can upload manifest and segment objects in any order. You are recommended to upload the manifest object after the segments in case a premature download of the manifest occurs. However, this is not enforced.
id: Anda dapat meng-upload manifest dan segmen objek dalam urutan apapun. Anda dianjurkan untuk meng-upload objek nyata setelah segmen dalam kasus download prematur manifes terjadi. Namun, hal ini tidak ditegakkan (not enforced).

source: You can upload new segment objects or remove existing segments. The names must simply match the ``PREFIX`` supplied in ``X-Object-Manifest``.
id: Anda dapat meng-upload object segmen baru atau menghapus segmen yang ada. Nama harus sungguh sesuai dengan ``PREFIX`` disediakan di ``X-Object-Manifest``.

source: You can upload regular files but you cannot upload other items (for example, empty directories or symbolic links).
id: Anda dapat meng-upload file biasa tetapi Anda tidak dapat meng-upload item lainnya (misalnya, direktori kosong atau link simbolik).

source: You can use Database services to backup a database and store the backup artifact in the Object Storage service. Later on, if the original database is damaged, you can use the backup artifact to restore the database. The restore process creates a database instance.
id: Anda dapat menggunakan layanan database untuk backup (cadangan) database dan menyimpan artefak cadangan dalam pelayanan Object Storage. Kemudian, jika database asli rusak, Anda dapat menggunakan artefak cadangan untuk mengembalikan database. Proses pemulihan menciptakan instance database.

source: You can use the :command:`blkid` command to identify the block device that corresponds to the configuration drive. For example, when you boot the CirrOS image with the ``m1.tiny`` flavor, the device is ``/dev/vdb``:
id: Anda dapat menggunakan perintah :command:`blkid` untuk mengidentifikasi perangkat blok yang sesuai dengan drive konfigurasi. Misalnya, ketika anda boot image CirrOS dengan flavor ``m1.tiny``, perangkat ``/dev/vdb``:

source: You can use the ``X-Trans-Id-Extra`` request header to include extra information to help you debug any errors that might occur with large object upload and other Object Storage transactions.
id: Anda dapat menggunakan header permintaan (request) ``X-Trans-Id-Extra`` untuk memasukkan informasi tambahan untuk membantu Anda debug kesalahan yang mungkin terjadi dengan meng-upload objek besar dan transaksi Object Storage lainnya.

source: You can use your Object Storage account to create a static website. This static website is created with Static Web middleware and serves container data with a specified index file, error file resolution, and optional file listings. This mode is normally active only for anonymous requests, which provide no authentication token. To use it with authenticated requests, set the header ``X-Web-Mode`` to ``TRUE`` on the request.
id: Anda dapat menggunakan akun Object Storage Anda untuk membuat website statis. Website statis ini dibuat dengan Static Web middleware dan melayani data kontainer dengan file indek tertentu, resolusi file error, dan daftar file opsional. Mode ini biasanya hanya aktif untuk request (permintaan) anonim, yang tidak memberikan token otentikasi. Untuk menggunakannya dengan permintaan dikonfirmasi (authenticated request), aturlah header ``X-Web-Mode`` ke ``TRUE`` pada permintaan.

source: You can view rules for a specified security group:
id: Anda dapat melihat aturan untuk kelompok keamanan tertentu (specified):

source: You can view the modules on your instance by doing the following:
id: Anda dapat melihat modul di instance Anda dengan melakukan hal berikut:

source: You can view the status of a volume in the Volumes tab of the dashboard. The volume is either Available or In-Use.
id: Anda dapat melihat status volume di tab Volume dashboard. Volume menunjukkan Available ataupun In-Use.

source: You cannot add or remove segment objects from the manifest. However, you can create a completely new manifest object of the same name with a different manifest list.
id: Anda tidak dapat menambah atau menghapus objek segmen dari manifes. Namun, Anda dapat membuat objek nyata (manifest) benar-benar baru dengan nama yang sama dengan daftar manifest yang berbeda.

source: You cannot delete the default security group for a project. Also, you cannot delete a security group that is assigned to a running instance.
id: Anda tidak dapat menghapus kelompok keamanan default untuk sebuah proyek. Juga, Anda tidak dapat menghapus kelompok keamanan yang ditugaskan untuk instance menjalankan.

source: You cannot version a large-object manifest file, but the large-object manifest file can point to versioned segments.
id: Anda tidak bisa memversi file manifest large-object, tapi file manifest large-object dapat menunjuk ke segmen berversi.

source: You detach a replica using the :command:`trove detach-replica` command:
id: Anda melepaskan replika menggunakan perintah :command:`trove detach-replica`:

source: You do not have to specify a subnet when you create a network, but if you do not specify a subnet, the network can not be attached to an instance.
id: Anda tidak harus menentukan subnet ketika Anda membuat jaringan, tetapi jika Anda tidak menentukan subnet, jaringan tidak dapat dihubungkan ke sebuah instance.

source: You get a list with all the volumes in your system. In this list, you can find the volume that is attached to your ISO created instance, with the false bootable property.
id: Anda mendapatkan daftar dengan semua volume dalam sistem Anda. Dalam daftar ini, Anda dapat menemukan volume yang melekat pada ISO Anda membuat instance, dengan properti bootable palsu.

source: You have successfully created a container.
id: Anda telah berhasil membuat sebuah wadah (container).

source: You have successfully created the router. You can view the new topology from the :guilabel:`Network Topology` tab.
id: Anda telah berhasil membuat router. Anda dapat melihat topologi baru dari tab :guilabel:`Network Topology`.

source: You have successfully uploaded an object to the container.
id: Anda telah berhasil mengunggah sebuah objek untuk wadah.

source: You must UTF-8-encode the member names.
id: Anda harus utf-8-encode nama anggota.

source: You must record the ``ETag`` response header value that the ``PUT`` operation returns. Alternatively, you can calculate the MD5 checksum of the segment before you perform the upload and include this value in the ``ETag`` request header. This action ensures that the upload cannot corrupt your data.
id: Anda harus mencatat nilai header respon ``ETag`` dimana pengembalian operation ``PUT``. Atau, Anda dapat menghitung checksum MD5 dari segmen sebelum Anda melakukan upload dan termasuk nilai ini dalam header permintaan ``ETag``. Tindakan ini memastikan bahwa upload tidak dapat merusak data Anda.

source: You must upload the segment objects before upload the manifest object.
id: Anda harus meng-upload benda segmen sebelum meng-upload objek nyata (manifest).

source: You must use the tar utility to create the tar archive file.
id: Anda harus menggunakan tar utility untuk membuat file arsip tar.

source: You only have to set the ``X-Container-Meta-Web-Error`` metadata once for your entire static website.
id: Anda harus mengatur metadata ``X-Container-Meta-Web-Error`` hanya sekali untuk website Anda seluruh statis.

source: You receive a one-item response, which is fewer than the ``limit`` number of names. This indicates that this is the end of the list.
id: Anda menerima respon one-item, yang lebih sedikit daripada jumlah ``limit`` nama. Hal ini menunjukkan bahwa ini adalah akhir dari daftar.

source: You receive a result set of all container names before the ``end-marker`` value.
id: Anda menerima hasil set semua nama kontainer sebelum nilai `end-marker``.

source: You should also be familiar with:
id: Anda juga harus akrab dengan:

source: You specify that the new ``guest2`` instance has the same flavor (``10``) and the same root volume size (``2``) as the original ``guest1`` instance.
id: Anda menentukan bahwa baru instance ``guest2`` memiliki flavor yang sama (``10``) dan ukuran volume akar yang sama (``2``) seperti aslinya ``guest1`` instance.

source: You typically write the private key to a file to use it later. The file must be readable and writeable by only the file owner; otherwise, the SSH client will refuse to read the private key file. The safest way is to create the file with the appropriate permissions, as shown in the following example:
id: Anda biasanya menulis kunci pribadi (private key) ke file untuk digunakan nanti. File harus dibaca dan ditulisi dengan hanya pemilik file; jika tidak, klien SSH akan menolak untuk membaca file kunci pribadi. Cara paling aman adalah dengan membuat file dengan hak akses yang sesuai, seperti yang ditunjukkan dalam contoh berikut:

source: You use the ``--backup`` argument to indicate that this new instance is based on the backup artifact identified by ``BACKUP_ID``. In this example, replace ``BACKUP_ID`` with ``8af30763-61fd-4aab-8fe8-57d528911138``.
id: Anda menggunakan argumen ``--backup`` untuk menunjukkan bahwa instance baru ini didasarkan pada artefak cadangan yang diidentifikasi oleh ``BACKUP_ID``. Dalam contoh ini, gantilah ``BACKUP_ID`` dengan ``8af30763-61fd-4aab-8fe8-57d528911138``.

source: Your Object Storage system might not enable all features that this document describes. These features are:
id: Sistem Object Storage Anda mungkin tidak memungkinkan semua fitur yang dokumen ini menjelaskan. Fitur-fitur ini:

source: Your options are:
id: Pilihan Anda adalah:

source: Your publicly readable containers are checked for two headers, ``X-Container-Meta-Web-Index`` and ``X-Container-Meta-Web-Error``. The ``X-Container-Meta-Web-Error`` header is discussed below, in the section called :ref:`set_error_static_website`.
id: Kontainer Anda yang terbaca publik diperiksa untuk dua header, ``X-Container-Meta-Web-Index`` dan ``X-Container-Meta-Web-Error``. Header ``X-Container-Meta-Web-Error`` dibahas di bawah ini, di bagian yang disebut :ref:`set_error_static_website`.

source: ``--xvpvnc`` can be replaced by any of the above values as connection types.
id: ``--xvpvnc`` dapat digantikan oleh salah satu nilai di atas sebagai tipe koneksi.

source: ``<name>`` is the name of the container to which you are uploading the object.
id: ``<name>`` adalah nama dari wadah (container) yang Anda upload objek.

source: ``NAME``. The name for the server.
id: ``NAME``. Nama untuk server.

source: ``Segment objects`` store the object content. You can divide your content into segments and upload each segment into its own segment object. Segment objects do not have any special features. You create, update, download, and delete segment objects just as you do with normal objects.
id: `` Segmen objects`` menyimpan konten objek. Anda dapat membagi konten Anda ke dalam segmen dan meng-upload setiap segmen ke objek segmen sendiri. Object segmen tidak memiliki fitur spesial. Anda membuat, memperbarui, download, dan menghapus objek segmen seperti yang Anda lakukan dengan object yang normal.

source: ``application/xml`` or ``text/xml``
id: ``application/xml`` atau ``text/xml``

source: ``clouds.yaml`` is a bit newer and was designed to help folks who have more than one OpenStack cloud that they are using.
id: ``clouds.yaml`` adalah hal lebih baru sedikit dan dirancang untuk membantu orang yang memiliki lebih dari satu cloud OpenStack yang mereka gunakan.

source: ``host`` is optional for the ``--availability-zone`` parameter. You can simply specify ``zone:,node``, still including the comma.
id: ``host`` adalah opsional untuk parameter ``--availability-zone``. Anda hanya dapat menentukan ``zona:,node``, masih termasuk koma.

source: ``print_server`` is a method defined in ``utils.py`` and prints the server details as shown in the code listing below:
id: ``print_server`` adalah metode didefinisikan dalam ``utils.py`` dan mencetak rincian server seperti yang ditunjukkan di daftar kode di bawah ini:

source: `shade <http://pypi.python.org/pypi/shade>`_ is an abstraction library focused on hiding implementation differences between OpenStack clouds. While the OpenStack SDK presents a clean object interface to the underlying REST APIs, shade hides them if doing so is advantageous. If you plan on running the same Python program against many OpenStack clouds, you may want to use shade - but if you need to access any features of a cloud that do not have a cloud-neutral abstraction mapping, you will be unable to do so with shade.
id: `shade <http://pypi.python.org/pypi/shade>`_ adalah perpustakaan abstraksi berfokus pada penyembunyian perbedaan implementasi antara cloud OpenStack. Sementara OpenStack SDK menyajikan antarmuka objek bersih untuk REST API yang mendasarinya, shade menyembunyikan mereka jika melakukan hal ini menguntungkan. Jika Anda berencana untuk menjalankan program Python yang sama terhadap banyak cloud OpenStack, Anda mungkin ingin menggunakan shade - tetapi jika Anda perlu untuk mengakses semua fitur dari cloud yang tidak memiliki pemetaan abstraksi cloud-neutral, Anda tidak akan dapat melakukannya dengan shade.

source: clouds.yaml config file
id: File konfigurasi clouds.yaml
