Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: By default, this value is set to the availability zone given by the cloud provider (for example, ``us-west`` or ``apac-south``). For some cases, it could be ``nova``.
id: Secara default, nilai ini diatur ke zona ketersediaan (availability zone) diberikan oleh penyedia cloud (for example, ``us-west`` atau ``apac-south``). Untuk beberapa kasus, hal itu bisa menjadi ``nova``.

source: By default, when you reboot an instance, it is a soft reboot.
id: Secara default, ketika Anda reboot sebuah instance, itu adalah reboot lembut.

source: By default, you cannot attach the configuration drive image as a CD drive instead of as a disk drive. To attach a CD drive, add the following line to the ``/etc/nova/nova.conf`` file:
id: Secara default, Anda tidak dapat menghubungkan image drive konfigurasi sebagai drive CD bukan sebagai disk drive. Untuk menghubungkan CD drive, tambahkan baris berikut ke file ``/etc/nova/nova.conf``:

source: Call ``print_server`` again to check the update server details:
id: Call (panggil) ``print_server``lagi untuk memeriksa rincian update server:

source: Call ``server.update`` on the server object with the new value for ``name`` variable:
id: Call (panggil) ``server.update`` pada objek server dengan nilai baru untuk variable ``name``:

source: Change the name of the image.
id: Mengubah nama image.

source: Change the size of a server by changing its flavor.
id: Mengubah ukuran server dengan mengubah flavor.

source: Change the size of your server
id: Mengubah ukuran server Anda

source: Check if the instance is online.
id: Periksa apakah instance yang online.

source: Check the backup you want to use and click :guilabel:`Restore Backup`.
id: Periksa cadangan (backup) yang ingin Anda gunakan dan klik :guilabel:`Restore Backup`.

source: Check the instance you want to work with. In the :guilabel:`Actions` column, expand the drop down menu and select :guilabel:`Resize Instance`.
id: Periksa instance dimana Anda ingin bekerja dengannya.. Dalam kolom :guilabel:`Actions`, perluas drop down menu dan pilih :guilabel:`Resize Instance`.

source: Check the instance you want to work with. In the :guilabel:`Actions` column, expand the drop down menu and select :guilabel:`Resize Volume`.
id: Periksa instance dimana Anda ingin bekerja dengannya. Dalam kolom :guilabel:`Actions`, perluas drop down menu dan pilih :guilabel:`Resize Volume`.

source: Choose the image source from the dropdown list. Your choices are :guilabel:`Image Location` and :guilabel:`Image File`.
id: Pilih sumber image dari daftar dropdown. Pilihan Anda adalah :guilabel:`Image Location` dan :guilabel:`Image File`.

source: Choose the pool from which to pick the IP address.
id: Pilih kolam (pool) untuk memilih alamat IP.

source: Choose the rule you want to delete.
id: Pilih aturan yang ingin Anda hapus.

source: Choose the source of the environment from the list. The environment files contain additional settings for the stack.
id: Pilih sumber lingkungan dari daftar. File lingkungan berisi pengaturan tambahan untuk stack.

source: Choose the source of the template from the list.
id: Pilih sumber template dari daftar.

source: Clear the :guilabel:`Public` check box to make the image private.
id: Bersihkan check box :guilabel:`Public` untuk membuat image private.

source: Click :guilabel:`Add Interface`.
id: Klik :guilabel:`Add Interface`.

source: Click :guilabel:`Add Rule`.
id: Klik :guilabel:`Add Rule`.

source: Click :guilabel:`Add rule`.
id: Klik :guilabel:`Add rule`.

source: Click :guilabel:`Add`.
id: Klik :guilabel:`Add`.

source: Click :guilabel:`Allocate IP To Project`.
id: Klik :guilabel:`Allocate IP To Project`.

source: Click :guilabel:`Allocate IP`.
id: Klik :guilabel:`Allocate IP`.

source: Click :guilabel:`Associate`.
id: Klik :guilabel:`Associate`.

source: Click :guilabel:`Attach Volume`.
id: Klik :guilabel:`Attach Volume`.

source: Click :guilabel:`Backup`. The new backup appears in the backup list.
id: Klik :guilabel:`Backup`. Cadangan (backup) baru muncul dalam daftar cadangan.

source: Click :guilabel:`Change Stack Template`.
id: Klik :guilabel:`Change Stack Template`.

source: Click :guilabel:`Container`.
id: Klik :guilabel:`Container`.

source: Click :guilabel:`Copy Object`.
id: Klik :guilabel:`Copy Object`.

source: Click :guilabel:`Create Backup`.
id: Klik :guilabel:`Create Backup`.

source: Click :guilabel:`Create Image`.
id: Klik :guilabel:`Create Image`.

source: Click :guilabel:`Create Key Pair`.
id: Klik :guilabel:`Create Key Pair`.

source: Click :guilabel:`Create Network`.
id: Klik :guilabel:`Create Network`.

source: Click :guilabel:`Create Pseudo-folder`.
id: Klik :guilabel:`Create Pseudo-folder`.

source: Click :guilabel:`Create Security Service`.
id: Klik :guilabel:`Create Security Service`.

source: Click :guilabel:`Create Share Network`.
id: Klik :guilabel:`Create Share Network`.

source: Click :guilabel:`Create Share`.
id: Klik :guilabel:`Create Share`.

source: Click :guilabel:`Create Volume`.
id: Klik :guilabel:`Create Volume`.

source: Click :guilabel:`Create`.
id: Klik :guilabel:`Create`.

source: Click :guilabel:`Delete Images`.
id: Klik :guilabel:`Delete Images`.

source: Click :guilabel:`Delete Security Services` and confirm your choice.
id: Klik :guilabel:`Delete Security Services` dan mengkonfirmasi pilihan Anda.

source: Click :guilabel:`Delete Share Networks` and confirm your choice.
id: Klik :guilabel:`Delete Share Networks` dan mengkonfirmasi pilihan Anda.

source: Click :guilabel:`Delete Shares` and confirm your choice.
id: Klik :guilabel:`Delete Shares` dan mengkonfirmasi pilihan Anda.

source: Click :guilabel:`Delete Stack`.
id: Klik :guilabel:`Delete Stack`.

source: Click :guilabel:`Delete Volumes` and confirm your choice.
id: Klik :guilabel:`Delete Volumes` dan mengkonfirmasi pilihan Anda.

source: Click :guilabel:`Delete rule` and confirm your choice.
id: Klik :guilabel:`Delete rule` dan mengkonfirmasi pilihan Anda.

source: Click :guilabel:`Detach Volume` and confirm your changes.
id: Klik :guilabel:`Detach Volume` dan mengkonfirmasi perubahan.

source: Click :guilabel:`Edit Image`.
id: Klik :guilabel:`Edit Image`.

source: Click :guilabel:`Edit Security Service`.
id: Klik :guilabel:`Edit Security Service`.

source: Click :guilabel:`Edit Share Metadata`.
id: Klik :guilabel:`Edit Share Metadata`.

source: Click :guilabel:`Edit Share Network`.
id: Klik :guilabel:`Edit Share Network`.

source: Click :guilabel:`Edit Share`.
id: Klik :guilabel:`Edit Share`.

source: Click :guilabel:`Edit Volume`.
id: Klik :guilabel:`Edit Volume`.

source: Click :guilabel:`Extend Share`.
id: Klik :guilabel:`Extend Share`.

source: Click :guilabel:`Import Key Pair`.
id: Klik :guilabel:`Import Key Pair`.

source: Click :guilabel:`Launch Instance`.
id: Klik :guilabel:`Launch Instance`.

source: Click :guilabel:`Launch Stack`.
id: Klik :guilabel:`Launch Stack`.

source: Click :guilabel:`Launch` to create a stack. The :guilabel:`Stacks` tab shows the stack.
id: Klik :guilabel:`Launch` untuk buat stack. Tab :guilabel:`Stacks` menunjukkan tumpukan (stack).

source: Click :guilabel:`Launch`.
id: Klik :guilabel:`Launch`.

source: Click :guilabel:`Resize Database Instance`.
id: Klik :guilabel:`Resize Database Instance`.

source: Click :guilabel:`Resize Database Volume`.
id: Klik :guilabel:`Resize Database Volume`.

source: Click :guilabel:`Update Object`.
id: Klik :guilabel:`Update Object`.

source: Click :guilabel:`Update`.
id: Klik :guilabel:`Update`.

source: Click :guilabel:`Upload File`.
id: Klik :guilabel:`Upload File`.

source: Click :guilabel:`Upload Object`.
id: Klik :guilabel:`Upload Object`.

source: Click on the :guilabel:`Network Name` of the network in which the port has to be created.
id: Klik pada :guilabel:`Network Name` jaringan dimana port harus dibuat.

source: Click the :guilabel:`Create Load Balancer` button.
id: Klik tombol :guilabel:`Create Load Balancer`.

source: Click the :guilabel:`Floating IPs` tab, which shows the floating IP addresses allocated to instances.
id: Klik tab :guilabel:`Floating IPs`, yang menunjukkan alamat IP mengambang dialokasikan untuk Instance.

source: Click the :guilabel:`Key Pairs` tab, which shows the key pairs that are available for this project.
id: Klik tab :guilabel:`Key Pairs`, yang menunjukkan pasangan kunci (key pair) yang tersedia untuk proyek ini.

source: Click the :guilabel:`Launch` button. The new database instance appears in the databases list.
id: Klik tombol :guilabel:`Launch`. Instance database baru muncul dalam daftar database.

source: Click the :guilabel:`Restore From Database` tab and make sure that this new instance is based on the correct backup.
id: Klik tab :guilabel:`Restore From Database` dan pastikan bahwa instance baru ini didasarkan pada cadangan (backup) yang benar.

source: Click the :guilabel:`Settings` button from the user drop down menu at the top right of any page, you will see the :guilabel:`Settings` tab.
id: Klik tombol :guilabel:`Settings` dari pengguna drop down menu di bagian kanan atas halaman manapun, Anda akan melihat tab :guilabel:`Settings`.

source: Click the :guilabel:`Upload File` icon.
id: Klik icon :guilabel:`Upload File`.

source: Click the menu button and choose :guilabel:`Copy` from the dropdown list.
id: Klik tombol menu dan pilih :guilabel:`Copy` dari daftar dropdown.

source: Click the menu button and choose :guilabel:`Edit` from the dropdown list.
id: Klik tombol menu dan pilih :guilabel:`Edit` dari daftar dropdown.

source: Commands
id: Commands (perintah)

source: Comparison of static and dynamic large objects
id: Perbandingan object besar (large object) statis dan dinamis

source: Compute
id: Compute (komputasi)

source: Configuration drive contents
id: Isi drive konfigurasi

source: Configuration drive format
id: Format drive konfigurasi

source: Configure access and security for instances
id: Mengkonfigurasi akses dan keamanan untuk instance

source: Confirm the resize,for example:
id: Konfirmasi mengubah ukuran, misalnya:

source: Confirm your changes.
id: Mengonfirmasi perubahan.

source: Connect to your instance by using SSH
id: Terhubung ke instance Anda dengan menggunakan SSH

source: Contents
id: Contents (konten)

source: Copy the IP address for your instance.
id: Salin alamat IP instance Anda.

source: Copy the administrative password value from the ``adminPass`` field. Use the password to log in to your server.
id: Salin nilai password administrasi dari field ``adminPass``. Gunakan password untuk login ke server Anda.

source: Copy the server ID value from the ``id`` field in the output. Use the ID to get server details or to delete your server.
id: Salin Server ID value dari field ``id`` dalam output. Gunakan ID untuk mendapatkan rincian server atau menghapus server Anda.

source: Copying the manifest object
id: Menyalin objek manifest

source: Create a Legacy Client Object
id: Create a Legacy Client Object (buat objek klien warisan)

source: Create a ``current`` container to store current versions of objects.
id: Buat wadah (container) ``current`` untuk menyimpan versi saat ini dari objek.

source: Create a bare-metal node
id: Buat node bare-metal.

source: Create a bootable volume for the instance to reside on after shutdown.
id: Buat volume bootable instance untuk diam setelah shutdown.

source: Create a bootable volume from an image. Cinder makes a volume bootable when ``--image`` parameter is passed.
id: Buat volume bootable dari sebuah image. Cinder membuat bootable volume saat parameter ``--image`` dilewatkan.

source: Create a cluster by using the :command:`trove cluster-create` command. This command creates a one-shard cluster. Pass in:
id: Buat sebuah cluster dengan menggunakan perintah :command:`trove cluster-create`. Perintah ini akan membuat kluster one-shard. Lewatkan di:

source: Create a container
id: Buat sebuah wadah (container)

source: Create a database instance
id: Buat instance database

source: Create a file on the volume
id: Buat file pada volume

source: Create a flavor named m1.tiny
id: Buatlah flavor bernama m1.tiny

source: Create a flavor.
id: Membuat flavor.

source: Create a load balancer
id: Buat load balancer (penyeimbang beban)

source: Create a manifest object. Include the ``?multipart-manifest=put`` query string at the end of the manifest object name to indicate that this is a manifest object.
id: Buat objek nyata (manifest). Sertakan query string ``?multipart-manifest=put`` pada akhir nama objek nyata untuk menunjukkan bahwa ini adalah objek nyata.

source: Create a mountpoint
id: Buat mountpoint

source: Create a network
id: Membuat jaringan (network)

source: Create a network with specified provider network type.
id: Membuat jaringan dengan ditentukan jenis jaringan penyedia.

source: Create a network:
id: Membuat jaringan:

source: Create a new instance that will be a replica of the original instance. You do this by passing in the ``--replica_of`` option with the :command:`trove create` command. This example creates a replica called ``replica_1``. ``replica_1`` is a replica of the original instance, ``base_1``:
id: Buat instance baru yang akan menjadi replika instance asli. Anda melakukan ini dengan melewati dalam opsi ``--replica_of`` dengan perintah :command:`trove create`. Contoh ini membuat replika yang disebut ``replica_1``. ``replica_1`` adalah replika instance asli, ``base_1``:

source: Create a new volume
id: Membuat volume baru

source: Create a non-bootable volume and attach that volume to an instance that you boot from an image.
id: Membuat volume non-bootable dan menghubungkan dimana volume ke sebuah instance dimana Anda boot dari sebuah image.

source: Create a non-bootable volume.
id: Membuat volume non-bootable.

source: Create a port
id: Buat port

source: Create a port with specified IP address:
id: Membuat port dengan alamat IP tertentu:

source: Create a port without specified IP address:
id: Membuat port tanpa alamat IP tertentu:

source: Create a router
id: Buat router

source: Create a router and add a port to the subnet:
id: Buat router dan menambahkan port untuk subnet:

source: Create a router:
id: Buat router:

source: Create a second version of the object in the ``current`` container:
id: Membuat versi kedua dari objek dalam kontainer ``current``:

source: Create a share
id: Buat share

source: Create a share from a snapshot.
id: Buat share dari snapshot.

source: Create a share network
id: Buat jaringan bersama (share)

source: Create a share network.
id: Buat jaringan bersama (share)

source: Create a share.
id: Buat share

source: Create a snapshot from a volume
id: Membuat snapshot dari volume

source: Create a snapshot of the instance
id: Membuat snapshot dari instance

source: Create a snapshot.
id: Membuat snapshot.

source: Create a stack from an example template file
id: Membuat tumpukan (stack) dari file template contoh

source: Create a subnet
id: Buat subnet

source: Create a subnet of the ``public`` external network:
id: Buat subnet dari jaringan eksternal ``public``:

source: Create a subnet:
id: Buat subnet:

source: Create a volume
id: Buat volume

source: Create a volume from an image and boot an instance from that volume.
id: Membuat volume dari sebuah image dan boot sebuah instance dari volume tersebut.

source: Create an ``archive`` container to store older versions of objects:
id: Buat wadah (container) ``archive`` untuk menyimpan versi objek:

source: Create an archive for auto-extract
id: Buat arsip untuk auto-extract

source: Create an auto-scaling stack by running the following command. The ``-f`` option specifies the name of the stack template file, and the ``-P`` option specifies the ``KeyName`` parameter as ``heat_key``:
id: Buat tumpukan auto-scaling dengan menjalankan perintah berikut. Opsi ``-f`` menentukan nama file stack template, dan opsi ``-P`` menentukan parameter ``KeyName`` sebagai ``heat_key``:

source: Create an external network
id: Buat jaringan eksternal

source: Create an external network named ``public``:
id: Buat jaringan eksternal bernama ``public``:

source: Create an image
id: Membuat image

source: Create an instance snapshot
id: Create instance snapshot

source: Create and access a database
id: Membuat dan mengakses database

source: Create and apply a module to a mysql database
id: Buat dan terapkan modul ke database mysql

source: Create and manage containers
id: Membuat dan mengelola wadah (container)

source: Create and manage databases
id: Membuat dan mengelola database

source: Create and manage networks
id: Membuat dan mengelola jaringan

source: Create and manage object containers
id: Membuat dan mengelola wadah objek (object container)

source: Create and manage security group rules
id: Membuat dan mengelola aturan kelompok keamanan

source: Create and manage security groups
id: Membuat dan mengelola kelompok keamanan

source: Create and manage shares
id: Membuat dan mengelola share

source: Create and manage stacks
id: Membuat dan mengelola tumpukan (stack)

source: Create and manage volumes
id: Membuat dan mengelola volume

source: Create and use incremental backups
id: Membuat dan menggunakan inkremental backup (cadangan)

source: Create and use modules for a database
id: Buat dan gunakan modul untuk database

source: Create at least one key pair for each project.
id: Buat setidaknya satu sepasang kunci (key pair) untuk setiap proyek.

source: Create keypair
id: Buat keypair

source: Create network
id: Buat jaringan (network)

source: Create networks
id: Membuat jaringan:

source: Create ports
id: Buat port

source: Create router and add port to subnet
id: Buat router dan menambahkan port subnet

source: Create router: complete code listing example
id: Buat router: kode lengkap daftar contoh

source: Create routers
id: Buat router

source: Create security service
id: Membuat layanan keamanan

source: Create server (API v2)
id: Membuat server (API v2)

source: Create server code listing example
id: Buat kode server pendaftaran contoh

source: Create share from snapshot
id: Buat share dari snapshot

source: Create share network
id: Buat jaringan bersama

source: Create snapshot
id: Buat snapshot

source: Create static website
id: Buat website statis

source: Create subnets
id: Buat subnet

source: Create the first version of an object in the ``current`` container:
id: Buat versi pertama dari sebuah objek dalam kontainer ``current``:

source: Create the volume:
id: Buat volume:

source: Create volume from image and boot instance
id: Membuat volume dari image dan boot instance

source: Creates a bare-metal node.
id: Buat node bare-metal.

source: Creating and managing ports requires administrator privileges. Contact an administrator before adding or changing ports.
id: Membuat dan mengelola port membutuhkan hak administrator. Hubungi administrator sebelum menambahkan atau mengubah port.

source: Database
id: Basis data

source: Database Instance
id: Instance database

source: Delete a cluster, using the :command:`trove cluster-delete` command.
id: Hapus cluster, gunakan perintah :command:`trove cluster-delete`.

source: Delete a configuration group, using the :command:`trove configuration-delete` command. You might want to do this if no instances use a group.
id: Menghapus kelompok konfigurasi, menggunakan perintah :command:`trove configuration-delete`. Anda mungkin ingin melakukan hal ini jika tidak ada instance menggunakan kelompok.

source: Delete a floating IP from the project which automatically deletes that IP's associations.
id: Menghapus IP mengambang dari proyek yang secara otomatis menghapus dimana asosiasi IP.

source: Delete a load balancer
id: Delete (hapus) load balancer

source: Delete a network
id: Hapus jaringan

source: Delete a security group rule
id: Menghapus aturan kelompok keamanan

source: Delete a security service
id: Hapus layanan keamanan

source: Delete a share
id: Delete (hapus) share

source: Delete a share network
id: Hapus jaringan bersama

source: Delete a share.
id: Hapus share.

source: Delete a snapshot.
id: Hapus snapshot.

source: Delete a stack
id: Delete stack

source: Delete a volume
id: Delete volume

source: Delete an image
id: Menghapus image

source: Delete an instance
id: Hapus instance

source: Delete network: complete code listing example
id: Hapus jaringan: kode lengkap daftar contoh

source: Delete server (API v2)
id: Hapus Server (API v2)

source: Delete server code example
id: Hapus kode server contoh

source: Delete share
id: Hapus share

source: Delete snapshot
id: Hapus snapshot

source: Delete specified image
id: Menghapus image tertentu

source: Delete the instance using the following command.
id: Hapus instance menggunakan perintah berikut.

source: Delete the network:
id: Hapus jaringan:

source: Deletion of images is permanent and **cannot** be reversed. Only users with the appropriate permissions can delete images.
id: Penghapusan image terjadi permanen dan tidak dapat dibalik (**cannot** be reversed). Hanya pengguna dengan hak akses yang sesuai dapat menghapus image.

source: Deny access
id: Tolak akses

source: Deny access.
id: Tolak akses

source: Depending on the parameters that you provide, the command returns a list of server properties.
id: Tergantung pada parameter yang Anda berikan, perintah mengembalikan daftar server properti.

source: Depending on the source that you select, browse to the file location, directly include the environment
id: Tergantung pada sumber yang Anda pilih, browse ke lokasi file, langsung masukan lingkungan

source: Depending on the source that you select, enter the URL, browse to the file location, or directly include the template.
id: Tergantung pada sumber yang Anda pilih, masukkan URL, browse ke lokasi file, atau langsung masukan template.

source: Depending on your role, you may have permission to upload and manage virtual machine images. Operators might restrict the upload and management of images to cloud administrators or operators only. If you have the appropriate privileges, you can use the dashboard to upload and manage images in the admin project.
id: Tergantung pada peran Anda, Anda mungkin memiliki izin untuk mengunggah dan mengelola image mesin virtual. Operator mungkin membatasi upload dan manajemen image bagi cloud administrator atau operator saja. Jika Anda memiliki hak istimewa yang sesuai, Anda dapat menggunakan dashboard untuk meng-upload dan mengelola foto dalam proyek admin.

source: Describe a specific image
id: Jelaskan image tertentu

source: Description
id: Deskripsi

source: Detach a volume from an instance
id: Lepaskan volume dari sebuah instance

source: Details
id: Rincian

source: Determine whether the ``vm1`` server exists:
id: Menentukan apakah `` vm1`` Server ada:

source: Direct REST calls via keystoneauth
id: Panggilan REST langsung melalui keystoneauth

source: Disassociate a configuration group from a database instance, using the :command:`trove configuration-detach` command.
id: Pisahkan kelompok konfigurasi dari instance database, gunakan perintah :command:`trove configuration-detach`.

source: Disassociate a floating IP address from an instance in the project.
id: Memisahkan alamat IP mengambang dari sebuah instance dalam proyek.

source: Disassociate floating IP addresses
id: Memisahkan alamat IP mengambang

source: Display information about a cluster by using the :command:`trove cluster-show` command. Pass in the ID of the cluster.
id: Menampilkan informasi tentang cluster dengan menggunakan perintah :command:`trove cluster-show`. Lewatkan dalam ID cluster.

source: Display information for the account, container, or object
id: Menampilkan informasi untuk akun, wadah (container), atau objek

source: Display the ``sync_binlog`` setting again:
id: Tampilkan kembali pengaturan ``sync_binlog``:
