Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: The ``openstack/2012-08-10/user_data``, ``openstack/latest/user_data``, ``ec2/2009-04-04/user-data``, and ``ec2/latest/user-data`` file are present only if the ``--user-data`` flag and the contents of the user data file are passed to the :command:`openstack server create` command.
id: File ``openstack/2012-08-10/user_data``, ``openstack/latest/user_data``, ``ec2/2009-04-04/user-data``, dan ``ec2/latest/user-data`` dihadirkan hanya jika flag ``--user-data`` dan isi dari file data pengguna dilewatkan ke perintah :command:`openstack server create`.

source: The ``print_flavors`` method is defined in ``utils.py`` and prints the flavor details:
id: Method ``print_flavors`` didefinisikan dalam ``utils.py`` dan mencetak rincian flavor:

source: The ``print_hosts`` method is defined in ``utils.py`` and prints the host object details:
id: Metode ``print_hosts`` didefinisikan dalam ``utils.py`` dan mencetak rincian obyek host:

source: The ``print_values_ip`` method is defined in ``utils.py`` and prints the floating\_ip object details:
id: Metode ``print_values_ip`` didefinisikan dalam ``utils.py`` dan mencetak rincian objek floating\_ip :

source: The ``subnet-create`` command has the following positional and optional parameters:
id: Perintah ``subnet-create`` memiliki parameter posisi dan opsional berikut:

source: The ``userA`` user with the ``password`` password.
id: User ``userA`` dengan password ``password``.

source: The access is created.
id: Akses yang dibuat.

source: The access is removed.
id: Akses akan dihapus.

source: The access permission for the image. ``Public`` or ``Private``.
id: Izin akses untuk image. ``Public`` atau ``Private``.

source: The actual device name might differ from the volume name because of hypervisor settings.
id: Nama perangkat yang sebenarnya mungkin berbeda dari nama volume karena pengaturan hypervisor.

source: The administrative user has created an appropriate :ref:`flavor that meets the MongoDB minimum requirements <create_db>`.
id: Pengguna administratif telah membuat flavour yang tepat :ref:`flavor that meets the MongoDB minimum requirements <create_db>`.

source: The administrative user has registered a MongoDB datastore type and version.
id: Pengguna administratif telah mendaftarkan tipe dan versi datastore MongoDB

source: The archive auto-extract feature supports these formats:
id: Fitur auto-extract arsip mendukung format ini:

source: The associated *rules* in each security group control the traffic to instances in the group. Any incoming traffic that is not matched by a rule is denied access by default. You can add rules to or remove rules from a security group, and you can modify rules for the default and any other security group.
id: *rules* terkait di setiap kontrol kelompok keamanan traffic ke instance dalam kelompok. Setiap traffic masuk yang tidak cocok dengan aturan ditolak akses secara default. Anda dapat menambahkan aturan atau menghapus aturan dari kelompok keamanan, dan Anda dapat memodifikasi aturan untuk default dan kelompok keamanan lainnya.

source: The authentication token for Object Storage.
id: Otentikasi token untuk Object Storage.

source: The bare-metal driver for OpenStack Compute manages provisioning of physical hardware by using common cloud APIs and tools such as Orchestration (Heat). The use case for this driver is for single project clouds such as a high-performance computing cluster, or for deploying OpenStack itself.
id: Driver bare-metal untuk OpenStack Compute mengelola penyediaan perangkat keras fisik dengan menggunakan API cloud umum dan alat-alat seperti Orchestration (Heat). Kasus penggunaan untuk driver ini adalah untuk cloud proyek tunggal seperti cluster komputasi kinerja tinggi (high-performance), atau untuk menyebarkan (deploying) OpenStack sendiri.

source: The body of the ``PUT`` request on the manifest object comprises a JSON list where each element contains these attributes:
id: Body permintaan (request) ``PUT`` pada objek nyata terdiri dari daftar JSON dimana setiap elemen mengandung atribut ini:

source: The cluster ID displays when you first create a cluster. (If you need to find it later on, use the :command:`trove cluster-list` command to list the names and IDs of all the clusters in your system.)
id: ID kluster akan tampil ketika Anda pertama kali membuat cluster. (Jika Anda perlu menemukan nanti, gunakan perintah :command:`trove cluster-list` untuk daftar nama dan ID semua kluster dalam sistem Anda.)

source: The command does not notify that your server was deleted.
id: Perintah tidak memberitahukan bahwa server Anda telah dihapus.

source: The command returns a URL from which you can access your instance:
id: Perintah mengembalikan URL dari mana Anda dapat mengakses instance Anda:

source: The command returns the following output:
id: Perintah mengembalikan output sebagai berikut:

source: The container and object name in the format: ``CONTAINER_NAME/OBJECT_NAME``.
id: Wadah (container) dan objek nama dalam format: ``CONTAINER_NAME/OBJECT_NAME``.

source: The dashboard is generally installed on the controller node.
id: Dashboard yang umumnya dipasang pada controller node.

source: The dashboard shows the instance to which the volume is now attached and the device name.
id: Dashboard menunjukkan instance dimana volume terhubung sekarang dan nama perangkat.

source: The dashboard shows the instances with its name, its private and floating IP addresses, size, status, task, power state, and so on.
id: Dashboard menunjukkan instance dengan nama, alamat IP pribadi dan mengambang, ukuran, status, tugas, kondisi daya, dan sebagainya.

source: The dashboard shows the network on the :guilabel:`Networks` tab.
id: Dashboard menunjukkan jaringan pada tab :guilabel:`Networks`.

source: The dashboard shows the new volume snapshot in Volume Snapshots tab.
id: Dashboard menunjukkan snapshot volume yang baru di tab Volume Snapshots.

source: The dashboard shows the security service on the :guilabel:`Security Services` tab.
id: Dashboard menunjukkan layanan keamanan di tab :guilabel:`Security Services`.

source: The dashboard shows the share network on the :guilabel:`Share Networks` tab.
id: Dashboard menunjukkan jaringan berbagi (share) pada tab :guilabel:`Share Networks`.

source: The dashboard shows the share on the :guilabel:`Shares` tab.
id: Dashboard menunjukkan berbagi (share) pada tab :guilabel:`Shares`.

source: The dashboard shows the volume on the :guilabel:`Volumes` tab.
id: Dashboard menunjukkan volume pada tab :guilabel:`Volumes`.

source: The database is based on the ``mysql`` data store and the ``mysql-5.5`` datastore\_version.
id: Database didasarkan pada data store ``mysql`` dan datastore\_version ``mysql-5.5`` .

source: The default format of the configuration drive as an ISO 9660 file system. To explicitly specify the ISO 9660 format, add the following line to the ``/etc/nova/nova.conf`` file:
id: Format default dari drive konfigurasi sebagai sistem file ISO 9660. Secara eksplisit menentukan format ISO 9660, tambahkan baris berikut ke file ``/etc/nova/nova.conf``:

source: The deleted instance does not appear in the list.
id: Instance dihapus tidak muncul dalam daftar.

source: The environment variables have been around the longest and are the form you are most likely to receive from your cloud provider. If you have one and only one cloud account, they are the most convenient way.
id: Variabel lingkungan telah berada lama di sekitar dan merupakan bentuk dimana Anda paling mungkin untuk menerima dari penyedia cloud Anda. Jika Anda memiliki satu dan hanya satu akun cloud, mereka adalah cara yang paling nyaman.

source: The events related to the stack.
id: Kejadian yang berhubungan dengan stack.

source: The examples in this guide show you how to perform tasks by using the following methods:
id: Contoh dalam buku ini menunjukkan cara untuk melakukan tugas dengan menggunakan metode berikut:

source: The examples in this section use the ``get_credentials`` method:
id: Contoh pada bagian ini menggunakan metode ``get_credentials``:

source: The examples in this section use the ``get_nova_credentials`` method:
id: Contoh pada bagian ini menggunakan metode ``get_nova_credentials``

source: The examples in this section use the ``print_values`` and ``print_values_server`` methods:
id: Contoh pada bagian ini menggunakan metode ``print_values`` dan ``print_values_server```:

source: The files that appear on the configuration drive depend on the arguments that you pass to the :command:`openstack server create` command.
id: File-file yang muncul pada drive konfigurasi tergantung pada argumen dimana Anda melewatkan ke perintah :command:`openstack server create`.

source: The first step is to list flavors by using the :command:`openstack flavor list` command.
id: Langkah pertama adalah mendaftar flavor dengan menggunakan perintah :command:`openstack flavor list`.

source: The flavor defines the maximum swap and ephemeral disk size. You cannot exceed these maximum values.
id: Flavor mendefinisikan swap maksimum dan ukuran disk ephemeral (tidal kekal). Anda tidak dapat melebihi nilai-nilai maksimum.

source: The flavor is selected based on the size of the image selected for launching an instance. For example, while creating an image, if you have entered the value in the :guilabel:`Minimum RAM (MB)` field as 2048, then on selecting the image, the default flavor is ``m1.small``.
id: Flavor dipilih berdasarkan ukuran image yang dipilih untuk meluncurkan sebuah instance. Misalnya, saat membuat image, jika Anda memasukkan nilai dalam field (kolom) :guilabel:`Minimum RAM (MB)` misalnya 2048, kemudian pada memilih image, flavor default adalah ``m1.small``.

source: The following are examples of `read` ACLs for containers:
id: Berikut ini adalah contoh dari ACL `read` untuk kontainer:

source: The following are examples of `write` ACLs for containers:
id: Berikut ini adalah contoh dari ACL `write` untuk kontainer:

source: The following auto-extract archive files example shows a ``text/plain`` response body where no failures occurred:
id: Berikut auto-extract file arsip contoh menunjukkan response body ``text/plain`` dimana ada kegagalan terjadi:

source: The following auto-extract archive files example shows a ``text/plain`` response where some failures occurred. In this example, the Object Storage system is configured to reject certain character strings so that the 400 Bad Request error occurs for any objects that use the restricted strings.
id: Berikut contoh file arsip auto-extract menunjukkan respon ``text/plain`` dimana beberapa kegagalan terjadi. Dalam contoh ini, sistem Object Storage dikonfigurasi untuk menolak karakter string tertentu sehingga terjadi 400 Bad Request error untuk setiap objek yang menggunakan string dibatasi.

source: The following bulk delete response is in ``application/xml`` format. In this example, the ``mycontainer`` container is not empty, so it cannot be deleted.
id: Berikut respon penghapusan massal berbentuk format ``application/xml``. Dalam contoh ini, wadah (container) ``mycontainer`` tidak kosong, sehingga tidak dapat dihapus.

source: The following command launches the ``MyCirrosServer`` instance with the ``m1.small`` flavor (ID of ``1``), ``cirros-0.3.2-x86_64-uec`` image (ID of ``397e713c-b95b-4186-ad46-6126863ea0a9``), ``default`` security group, ``KeyPair01`` key, and a user data file called ``cloudinit.file``:
id: Perintah berikut meluncurkan instance ``MyCirrosServer`` dengan ``m1.small`` flavor (ID of ``1``), ``cirros-0.3.2-x86_64-uec`` image (ID of ``397e713c-b95b-4186-ad46-6126863ea0a9``), ``default`` security group, key ``KeyPair01``, dan file data pengguna yang disebut ``cloudinit.file``:

source: The following commands can be used to manage bare-metal nodes.
id: Perintah berikut dapat digunakan untuk mengelola node bare-metal.

source: The following example enables the configuration drive and passes user data, two files, and two key/value metadata pairs, all of which are accessible from the configuration drive:
id: Contoh berikut memungkinkan drive konfigurasi dan melewati data pengguna, dua file, dan dua kunci/nilai metadata pasangan (key/value metadata pair), yang semuanya dapat diakses dari drive konfigurasi:

source: The following example shows the command and results from creating a node with the PM address ``1.2.3.4``, the PM user name ipmi, and password ``ipmi``.
id: Contoh berikut menunjukkan perintah dan hasil dari pembuatan node dengan alamat PM ``1.2.3.4``, PM nama pengguna IPMI, dan password ``ipmi``.

source: The following example shows the contents of the ``ec2/2009-04-04/meta-data.json`` and the ``ec2/latest/meta-data.json`` files. These files are identical. The file contents are formatted to improve readability.
id: Contoh berikut menunjukkan isi dari file ``ec2/2009-04-04/meta-data.json`` dan ``ec2/latest/meta-data.json``. File ini adalah identik. Isi file diformat agar lebih mudah dibaca.

source: The following example shows the contents of the ``openstack/2012-08-10/meta_data.json`` and ``openstack/latest/meta_data.json`` files. These files are identical. The file contents are formatted for readability.
id: Contoh berikut menunjukkan isi dari file ``openstack/2012-08-10/meta_data.json`` dan ``openstack/latest/meta_data.json``. File ini adalah identik. Isi file diformat supaya dapat dibaca.

source: The following example shows the failure response in ``application/json`` format.
id: Contoh berikut menunjukkan respon kegagalan dalam format ``application/json``.

source: The following example shows the results of a search on ``10.0.0.4``.
id: Contoh berikut menunjukkan hasil pencarian di ``10.0.0.4``.

source: The following hypervisors support the configuration drive: libvirt, XenServer, Hyper-V, and VMware.
id: Hypervisors berikut mendukung drive konfigurasi: libvirt, XenServer, Hyper-V, dan VMware.

source: The following program creates a network:
id: Program berikut membuat jaringan:

source: The following program creates a port:
id: Program berikut membuat port:

source: The following program creates a server (VM) by using the Compute API v2.
id: Program berikut membuat server (VM) dengan menggunakan Compute API v2.

source: The following program deletes a server (VM) by using the Compute API v2.
id: Program berikut menghapus server (VM) dengan menggunakan Compute API v2.

source: The following program lists flavors and their details by using the Compute API v2.
id: Program berikut daftar flavor dan rincian mereka dengan menggunakan Compute API v2.

source: The following program lists networks:
id: Program berikut daftar jaringan:

source: The following program lists ports:
id: Program berikut daftar port:

source: The following program lists servers by using the Compute API v2.
id: Program berikut ini berisi server dengan menggunakan Compute API v2.

source: The following program lists the floating IPs and their details by using the Compute API v2.
id: Program berikut daftar IP mengambang dan rincian mereka dengan menggunakan Compute API v2.

source: The following program lists the hosts by using the Compute API v2.
id: Program berikut berisi host dengan menggunakan Compute API v2.

source: The following program lists the ports for a server:
id: Program berikut berisi port untuk server:

source: The following program updates the name of a server (VM) by using the Compute API v2.
id: Program berikut men-update nama server (VM) dengan menggunakan Compute API v2.

source: The following sections show how to use Static Web middleware through Object Storage.
id: Bagian berikut menunjukkan bagaimana menggunakan Static Web middleware melalui Object Storage.

source: The image is queued to be uploaded. It might take some time before the status changes from Queued to Active.
id: Image diantrikan (queued) untuk di-upload. Mungkin butuh beberapa waktu sebelum perubahan statusnya dari Antri ke Aktif (Queued to Active).

source: The images method returns a Python generator, as shown in the following interaction with the Python interpreter:
id: Image metode akan mengembalikan generator Python, seperti yang ditunjukkan dalam interaksi berikut dengan interpreter Python:

source: The instance is now associated with two IP addresses:
id: Instance sekarang terkait dengan dua alamat IP:

source: The instance starts on a compute node in the cloud.
id: Instance dimulai pada node komputasi di cloud.

source: The instances launched using this image contain the system that you have just installed using the ISO image.
id: Instance diluncurkan menggunakan image ini berisi sistem yang Anda baru saja menginstal menggunakan image ISO.

source: The list shows all the instances with their fixed IP addresses.
id: Daftar menunjukkan semua Instance dengan alamat IP tetap nya.

source: The list shows the ID, name, status, and private (and if assigned, public) IP addresses for all instances in the project to which you belong:
id: Daftar ini menunjukkan ID, nama, status, dan alamat IP private (dan jika ditugaskan, publik) untuk semua instance dalam proyek yang Anda milik:

source: The load balancer occupies a neutron network port and has an IP address assigned from a subnet.
id: Penyeimbang beban (load balancer) menempati port jaringan neutron dan memiliki alamat IP yang ditetapkan dari subnet.

source: The manifest list includes the container name of each object. Segment objects can be in different containers.
id: Daftar manifest mencakup nama wadah (container) setiap objek. Object segmen dapat dalam wadah yang berbeda.

source: The manifest object content is an ordered list of the names of the segment objects in JSON format. See :ref:`static_large_objects`.
id: Isi objek manifest adalah sebuah ordered list nama object segmen dalam format JSON. Lihat :ref: `static_large_objects`.

source: The manifest object has no content but it has a ``X-Object-Manifest`` metadata header. The value of this header is ``CONTAINER/PREFIX``, where ``CONTAINER`` is the name of the container where the segment objects are stored, and ``PREFIX`` is a string that all segment objects have in common. See :ref:`dynamic_large_objects`.
id: Objek manifest tidak memiliki konten tetapi memiliki metadata header ``X-Object-Manifest`` . Nilai dari header ini adalah ``CONTAINER/PREFIX``, dimana ``CONTAINER`` adalah nama dari kontainer dimana objek segmen disimpan, dan ``PREFIX`` adalah string bahwa semua object segmen memiliki kesamaan. Lihat :ref: `dynamic_large_objects`.

source: The module created here is a demo module called ping. It is the basic type made for testing purposes. To create it, it is as simple as the following :command: ``echo`` command:
id: Modul yang dibuat disini adalah modul demo yang disebut ping. Ini adalah jenis dasar yang dibuat untuk tujuan pengujian. Untuk membuatnya, sesederhana yang berikut perintah :command: ``echo``:

source: The name and version of the datastore you want to use.
id: Nama dan versi dari datastore yang ingin Anda gunakan.

source: The name of the cluster.
id: Nama kluster.

source: The name of the incremental backup you are creating: ``backup1.1``
id: Nama inkremental backup Anda membuat: ``backup1.1``

source: The name of your second incremental backup is ``backup1.2``. This time, when you specify the parent, pass in the ID of the incremental backup you just created in the previous step (``backup1.1``). In this example, it is ``1d474981-a006-4f62-b25f-43d7b8a7097e``.
id: Nama inkremental backup kedua adalah ``backup1.2``. Kali ini, ketika Anda menentukan parent, lulus dalam ID dari inkremental backup yang baru saja dibuat pada langkah sebelumnya (``backup1.1``). Dalam contoh ini, itu adalah ``1d474981-a006-4f62-b25f-43d7b8a7097e``.

source: The name or ID of the network to which the subnet belongs.
id: Nama atau ID dari jaringan yang subnet kepemilikan (subnet belongs).

source: The name you assign here becomes the initial host name of the server. If the name is longer than 63 characters, the Compute service truncates it automatically to ensure dnsmasq works correctly.
id: Nama dimana Anda menetapkan disini menjadi nama host server awal. Jika nama lebih panjang dari 63 karakter, layanan Compute memotong secara otomatis untuk memastikan dnsmasq bekerja dengan benar.

source: The new instance appears in the database instances list.
id: Instance baru muncul dalam daftar instance database.

source: The new port is now displayed in the :guilabel:`Ports` list.
id: Port baru tidak ditampilkan dalam daftar :guilabel:`Ports`.

source: The new router is now displayed in the :guilabel:`Routers` tab.
id: Router baru sekarang ditampilkan dalam tab :guilabel:`Routers`.

source: The number of files actually deleted.
id: Jumlah file benar-benar dihapus.

source: The number of not found objects.
id: Jumlah objek tidak ditemukan.

source: The object has ``X-Static-Large-Object`` set to ``true``. You do not set this metadata directly. Instead the system sets it when you ``PUT`` a static manifest object.
id: Objek memiliki ``X-Static-Large-Object`` diatur untuk ``true``. Anda tidak menetapkan metadata ini secara langsung. Sebaliknya, sistem mengatur itu ketika Anda ``PUT`` objek manifest statis.

source: The original :command: ``count`` command will show the first instance, unless the ``--include_clustered`` option is used. You can see the MD5 from each applied module, and you know that the single instance one is not current.
id: Perintah :command: ``count`` asli akan menunjukkan instance pertama, kecuali opsi ``--include_clustered`` digunakan. Anda dapat melihat MD5 dari masing-masing modul yang diterapkan, dan Anda tahu bahwa instance tunggal tidak mutakhir.

source: The parameters and details of the stack.
id: Parameter dan rincian dari stack.

source: The parameters are:
id: Parameter adalah:

source: The path is the account, such as ``/v1/12345678912345``, that contains the objects and containers.
id: Path adalah account, seperti ``/v1/12345678912345``, yang berisi objek dan kontainer.

source: The path you specify in the ``PUT`` request is used for the location of the object and the prefix for the resulting object names.
id: Path yang Anda tentukan dalam permintaan ``PUT`` digunakan untuk lokasi objek dan awalan (prefix) untuk nama objek yang dihasilkan.

source: The public URL that is the HTTP endpoint from where you can access Object Storage. It includes the Object Storage API version number and your account name. For example, ``https://23.253.72.207/v1/my_account``.
id: URL publik yang merupakan endpoint HTTP dari tempat Anda dapat mengakses Object Storage. Ini mencakup Object Storage nomor versi API dan nama akun Anda. Misalnya, ``https://23.253.72.207/v1/my_account``.

source: The remainder of the examples in this guide use standard, non-serialized responses. However, all ``GET`` requests that perform list operations accept the ``format`` query parameter or ``Accept`` request header.
id: Contoh selanjutnya di buku ini menggunakan standar, tanggapan non-serial. Namun, semua request (permintaan) ``GET`` yang melakukan operasi pendaftaran menerima parameter kueri ``format`` atau header permintaan `` Accept``.

source: The resources used by the stack.
id: Sumber daya yang digunakan oleh stack.

source: The response body contains the following information:
id: Response body berisi informasi berikut:

source: The server status becomes ACTIVE.
id: Status server menjadi ACTIVE.

source: The share is being deleted.
id: Share sedang dihapus.

source: The size (flavor) of the server is ``m1.small (2)``.
id: Ukuran (flavor) dari server ``m1.small (2) ``.

source: The size of the segment object. This value must match the ``Content-Length`` of that object.
id: Ukuran dari objek segmen. Nilai ini harus sesuai dengan ``Content-Length`` dari objek itu.

source: The snapshot is deleted.
id: Snapshot akan dihapus.
