Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: To bring every instance to the current version, use some of the optional arguments to control how many instances are updated at the same time. This is useful to avoid potential network issues, if the module payload is large. Since we are not using the ``--force`` flag, the minimum updated date will not change.
id: Untuk membawa setiap instance ke versi saat ini, gunakan beberapa argumen opsional untuk mengontrol jumlah instal yang diperbarui pada waktu yang bersamaan. Ini berguna untuk menghindari masalah jaringan potensial, jika muatan modulnya besar. Karena kita tidak menggunakan flag ``--force``, tanggal update minimum tidak akan berubah.

source: To change its permissions so that only you can read and write to the file, run the following command:
id: Untuk mengubah perizinannya sehingga hanya Anda yang dapat membaca dan menulis ke file, jalankan perintah berikut:

source: To change the flavor of an instance
id: Untuk mengubah flavor sebuah instance

source: To change the manifest, use a ``PUT`` operation with the ``?multipart-manifest=put`` query parameter. This request creates a manifest object. You can also update the object metadata in the usual way.
id: Untuk mengubah manifes, menggunakan operasi ``PUT`` dengan parameter query ``?multi-bagian-manifest = put`` . Permintaan ini membuat objek nyata (manifest). Anda juga dapat memperbarui metadata objek dengan cara yang biasa.

source: To change the volume size of an instance
id: Untuk mengubah ukuran volume instance

source: To check the status of containers, run the following command:
id: Untuk memeriksa status kontainer, jalankan perintah berikut:

source: To check the status of the object, run the following command:
id: Untuk memeriksa status dari objek, jalankan perintah berikut:

source: To complete these tasks, use these parameters on the :command:`openstack server create` command:
id: Untuk menyelesaikan tugas ini, gunakan parameter ini pada perintah: :command:`openstack server create`:

source: To connect a private network to the newly created router, perform the following steps:
id: Untuk menghubungkan jaringan pribadi ke router yang baru dibuat, lakukan langkah berikut:

source: To continue with this document, we recommend that you have installed the Database service and populated your data store with images for the type and versions of databases that you want, and that you can create and access a database.
id: Untuk melanjutkan dokumen ini, kami merekomendasikan agar Anda telah menginstal layanan Database dan menyimpan data store Anda dengan image untuk jenis dan versi database yang Anda inginkan, dan Anda dapat membuat dan mengakses database.

source: To create a container, run the following command and replace ``CONTAINER`` with the name of your container.
id: Untuk membuat sebuah kontainer, jalankan perintah berikut dan ganti ``CONTAINER`` dengan nama kontainer Anda.

source: To create a non-bootable volume, do not create it from an image. The volume must be entirely empty with no partition table and no file system.
id: Untuk membuat volume non-bootable, jangan menciptakannya dari sebuah image. Volume harus sepenuhnya kosong tanpa tabel partisi dan tidak ada sistem file.

source: To create a security group with a specified name and description, call the `novaclient.v\_1.security\_groups.SecurityGroupManager.create <https://docs.openstack.org/developer/python-novaclient/api/novaclient. v1_1.security_groups.html#novaclient.v1_1.security_groups. SecurityGroupManager.create>`__ method:
id: Untuk membuat grup keamanan dengan nama tertentu dan deskripsinya, panggil `novaclient.v\_1.security\_groups.SecurityGroupManager.create <https://docs.openstack.org/developer/python-novaclient/api/novaclient. v1_1.security_groups.html#novaclient.v1_1.security_groups. SecurityGroupManager.create>`__ metode:

source: To create a security group with a specified name and description, enter the following command:
id: Untuk membuat kelompok keamanan dengan nama tertentu dan deskripsi, masukkan perintah berikut:

source: To create a stack, or template, from an `example template file <https://git.openstack.org/cgit/openstack/heat-templates>`__, run the following command:
id: Untuk membuat tumpukan (stack), atau template, dari `example template file <https://git.openstack.org/cgit/openstack/heat-templates>`__, jalankan perintah berikut:

source: To create a static large object, divide your content into pieces and create (upload) a segment object to contain each piece.
id: Untuk membuat sebuah objek besar statis, bagilah konten Anda menjadi potongan-potongan dan menciptakan (upload) objek segmen mengandung masing-masing bagian.

source: To create the server, use the network, image, and flavor:
id: Untuk membuat server, gunakan jaringan, image, dan flavor:

source: To define the response format, use one of these methods:
id: Untuk menentukan format respon, gunakan salah satu metode ini:

source: To delete a container, click the :guilabel:`More` button and select :guilabel:`Delete Container`.
id: Untuk menghapus sebuah kontainer, klik tombol :guilabel:`More` dan pilih :guilabel:`Delete Container`.

source: To delete a network:
id: Untuk menghapus jaringan:

source: To delete a security group rule, specify the ID of the rule.
id: Untuk menghapus grup aturan keamanan, tentukan ID dari aturan.

source: To delete a security group, call the `novaclient.v\_1.security\_groups.SecurityGroupManager.delete <https://docs.openstack.org/developer/python-novaclient/api/novaclient. v1_1.security_groups.html#novaclient.v1_1.security_groups. SecurityGroupManager.delete>`__ method, passing either a `novaclient.v1\_1.security\_groups.SecurityGroup <https://docs.openstack.org/developer/python-novaclient/api/novaclient .v1_1.security_groups.html#novaclient.v1_1.security_groups. SecurityGroup>`__ object or group ID as an argument:
id: Untuk menghapus grup keamanan, panggil `novaclient.v\_1.security\_groups.SecurityGroupManager.delete <https://docs.openstack.org/developer/python-novaclient/api/novaclient. v1_1.security_groups.html#novaclient.v1_1.security_groups. SecurityGroupManager.delete>`__ metode, melewati juga `novaclient.v1\_1.security\_groups.SecurityGroup <https://docs.openstack.org/developer/python-novaclient/api/novaclient .v1_1.security_groups.html#novaclient.v1_1.security_groups. SecurityGroup>`__ objek atau ID grup sebagai argumen:

source: To delete a specified group, enter the following command:
id: Untuk menghapus kelompok tertentu, masukkan perintah berikut:

source: To delete an object, click the :guilabel:`More button` and select :guilabel:`Delete Object`.
id: Untuk menghapus sebuah objek, klik :guilabel:`More button` dan pilih :guilabel:`Delete Object`.

source: To delete an object, click the menu button and select :guilabel:`Delete Object`.
id: Untuk menghapus sebuah objek, klik tombol menu dan pilih :guilabel:`Delete Object`.

source: To determine whether your Object Storage system supports this feature, see :doc:`managing-openstack-object-storage-with-swift-cli`. Alternatively, check with your service provider.
id: Untuk menentukan apakah sistem Object Storage Anda mendukung fitur ini, lihat :doc:`managing-openstack-object-storage-with-swift-cli`. Atau, hubungi penyedia layanan Anda.

source: To disable object versioning for the ``current`` container, remove its ``X-Versions-Location`` metadata header by sending an empty key value.
id: Untuk menonaktifkan objek versi kontainer ``current``, hapuslah header metadata ``X-Versi-Location`` dengan mengirimkan nilai kunci kosong.

source: To disassociate a floating IP address from an instance:
id: Untuk memisahkan alamat IP mengambang dari sebuah instance:

source: To disassociate an IP address from an instance, click the :guilabel:`Disassociate` button.
id: Untuk memisahkan alamat IP dari sebuah Instance, klik tombol :guilabel:`Disassociate`.

source: To discover whether your Object Storage system supports this feature, see :ref:`discoverability` or check with your service provider.
id: Untuk mengetahui apakah sistem Storage Object Anda mendukung fitur ini, lihat :ref: `discoverability` atau hubungi penyedia layanan Anda.

source: To discover whether your Object Storage system supports this feature, see :ref:`discoverability`. Alternatively, check with your service provider.
id: Untuk mengetahui apakah sistem Storage Object Anda mendukung fitur ini, lihat :ref: `discoverability`. Atau, hubungi penyedia layanan Anda.

source: To discover which features are enabled in your Object Storage system, use the ``/info`` request.
id: Untuk menemukan fitur yang diaktifkan dalam sistem Storage Object Anda, gunakan permintaan (request) ``/info`.

source: To display a list of all the objects in the storage container, use ``GET`` without a ``delimiter`` or ``prefix``.
id: Untuk menampilkan daftar semua objek dalam kontainer penyimpanan, gunakan ``GET`` tanpa ``delimiter`` atau ``prefix``.

source: To download a summary, click :guilabel:`Download CSV Summary`.
id: Untuk men-download ringkasan, klik :guilabel:`Download CSV Summary`.

source: To download an object from a container, run the following command:
id: Untuk men-download objek dari kontainer, jalankan perintah berikut:

source: To enable and use object versioning
id: Untuk mengaktifkan dan menggunakan objek versioning

source: To enable object versioning, ask your cloud provider to set the ``allow_versions`` option to ``TRUE`` in the container configuration file.
id: Untuk mengaktifkan objek versioning, mintalah penyedia cloud Anda untuk mengatur opsi ``allow_versions`` untuk ``TRUE`` di file konfigurasi kontainer.

source: To enable the configuration drive, pass the ``--config-drive true`` parameter to the :command:`openstack server create` command.
id: Untuk mengaktifkan drive konfigurasi, lewatkan parameter ``--config-drive true`` ke perintah :command:`openstack server create`.

source: To ensure that the key pair has been successfully imported, list key pairs as follows:
id: Untuk memastikan bahwa pasangan kunci (key pair) telah berhasil diimpor, daftar pasangan kunci sebagai berikut:

source: To ensure the download works correctly, you must upload all the object segments to the same container and prefix each object name so that the segments sort in correct concatenation order.
id: Untuk memastikan download bekerja dengan benar, Anda harus meng-upload semua segmen objek ke kontainer yang sama dan awalan (prefix) setiap nama objek sehingga segmen semacam agar rangkaian yang benar.

source: To explore the state and history of a particular stack, you can run a number of commands.
id: Untuk menjelajahi kondisi dan sejarah (history) dari tumpukan (stack) tertentu, Anda dapat menjalankan sejumlah perintah.

source: To generate a key pair, run the following command.
id: Untuk menghasilkan sepasang kunci, jalankan perintah berikut.

source: To generate a keypair, call the `novaclient.v1\_1.keypairs.KeypairManager.create <http://docs. openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs .html#novaclient.v1_1.keypairs.KeypairManager.create>`__ method:
id: Untuk menghasilkan keypair, panggil metode `novaclient.v1\_1.keypairs.KeypairManager.create <http://docs. openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs .html#novaclient.v1_1.keypairs.KeypairManager.create>`__:

source: To give a user read access, use the :command:`swift post` command with the ``-r`` parameter. To give a user write access, use the ``-w`` parameter.
id: Untuk memberikan pengguna akses baca, gunakan perintah :command:`swift post` dengan parameter ``-r``. Untuk memberikan pengguna akses menulis, gunakan parameter ``-w``.

source: To incorporate your incremental backups, you simply use the `--backup`` parameter to pass in the ``BACKUP_ID`` of your most recent incremental backup. The Database service handles the complexities of applying the chain of all previous incremental backups.
id: Untuk memasukkan incremental backup Anda, Anda hanya menggunakan parameter `--backup`` untuk melewatkan dalam` `BACKUP_ID`` dari incremental backup terbaru. Layanan Database menangani kompleksitas penerapan rantai dari semua incremental backup sebelumnya.

source: To indicate a container, specify the container name as: ``CONTAINER_NAME``. Make sure that the container is empty. If it contains objects, Object Storage cannot delete the container.
id: Untuk menunjukkan sebuah wadah (container), tentukan nama wadah sebagai: `` CONTAINER_NAME``. Pastikan bahwa wadah kosong. Jika berisi objek, Object Storage tidak dapat menghapus wadah.

source: To indicate an object, specify the container and object name as: ``CONTAINER_NAME``/``OBJECT_NAME``.
id: Untuk menunjukkan objek, tentukan wadah (container) dan objek nama sebagai: ``CONTAINER_NAME``/``OBJECT_NAME``.

source: To initiate a hypervisor-level suspend operation, run the following command:
id: Untuk memulai hypervisor tingkat menangguhkan operasi, jalankan perintah berikut:

source: To launch an instance from the snapshot, select the snapshot and click :guilabel:`Launch`. Proceed with launching an instance.
id: Untuk memulai sebuah instance dari snapshot, pilih snapshot dan klik :guilabel:`Launch`. Lanjutkan dengan meluncurkan sebuah instance.

source: To launch multiple instances, enter a value greater than ``1``. The default is ``1``.
id: Untuk meluncurkan beberapa instance, masukkan nilai lebih besar dari ``1``. Default adalah ``1``.

source: To learn how, refer to the `Template Guide <https://docs.openstack.org/developer/heat/template_guide/index.html>`__ on the OpenStack developer documentation website.
id: Untuk mempelajari caranya, merujuk pada `Template Guide <https://docs.openstack.org/developer/heat/template_guide/index.html>`__ di situs dokumentasi pengembang OpenStack.

source: To list all containers, run the following command:
id: Untuk daftar semua kontainer, jalankan perintah berikut:

source: To list all floating IP addresses that are allocated to the current project, run:
id: Untuk daftar semua alamat IP mengambang yang dialokasikan untuk proyek ini, jalankan:

source: To list all pools that provide floating IP addresses, run:
id: Untuk daftar semua kolam (pool) yang menyediakan alamat IP mengambang, jalankan:

source: To list keypairs, call the `novaclient.v1\_1.keypairs.KeypairManager.list <https://docs.openstack. org/developer/python-novaclient/api/novaclient.v1_1.keypairs.html #novaclient.v1_1.keypairs.KeypairManager.list>`__ method:
id: Untuk mendaftar pasangan kunci, panggil `novaclient.v1\_1.keypairs.KeypairManager.list <https://docs.openstack. org/developer/python-novaclient/api/novaclient.v1_1.keypairs.html #novaclient.v1_1.keypairs.KeypairManager.list>`__ metode:

source: To list security groups for the current project, call the `novaclient.v\_1.security\_groups.SecurityGroupManager.list <https://docs.openstack.org/developer/python-novaclient/api/novaclient .v1_1.security_groups.html#novaclient.v1_1.security_groups. SecurityGroupManager.list>`__ method:
id: Untuk mendaftar kelompok keamanan untuk proyek saat ini, panggil `novaclient.v\_1.security\_groups.SecurityGroupManager.list <https://docs.openstack.org/developer/python-novaclient/api/novaclient .v1_1.security_groups.html#novaclient.v1_1.security_groups. SecurityGroupManager.list>`__ metode:

source: To list the available images, call the ``glanceclient.v2.images.Controller.list`` method:
id: Untuk daftar image yang tersedia, panggil metode ``glanceclient.v2.images.Controller.list``:

source: To list the objects in a container, run the following command:
id: Untuk mendaftar objek dalam sebuah kontainer, jalankan perintah berikut:

source: To list the rules for a security group, run the following command:
id: Untuk mendaftar aturan untuk kelompok keamanan, jalankan perintah berikut:

source: To list the security groups for the current project, including descriptions, enter the following command:
id: Untuk mendaftar kelompok keamanan untuk proyek ini, termasuk deskripsi, masukkan perintah berikut:

source: To make the key pair known to SSH, run the :command:`ssh-add` command.
id: Membuat pasangan kunci (key pair) untuk diketahui SSH, jalankan perintah :command:`ssh-add` .

source: To model data, Telemetry uses the following abstractions:
id: Untuk data model, Telemetry menggunakan abstraksi berikut:

source: To obtain these values, run the :command:`swift stat -v` command.
id: Untuk mendapatkan nilai ini, jalankan perintah :command:`swift stat -v`.

source: To page through a large list of containers
id: Untuk halaman keseluruhan daftar besar kontainer

source: To pause an instance, run the following command:
id: Untuk menghentikan instance, jalankan perintah berikut:

source: To perform a bulk delete operation, add the ``bulk-delete`` query parameter to the path of a ``POST`` or ``DELETE`` operation.
id: Untuk melakukan operasi penghapusan massal, tambahkan parameter query ``bulk-delete`` ke path operasi ``POST`` atau ``DELETE``.

source: To perform a hard reboot, pass the ``--hard`` parameter, as follows:
id: Untuk melakukan hard reboot, lewatkan parameter ``--hard``, sebagai berikut:

source: To perform an instance reboot into rescue mode, run the following command:
id: Untuk melakukan sebuah instance reboot ke mode penyelamatan (rescue), jalankan perintah berikut:

source: To query the instance usage for a month, select a month and click :guilabel:`Submit`.
id: Untuk kueri penggunaan instance selama satu bulan, pilih bulan dan klik :guilabel:`Submit`.

source: To release the floating IP address back into the floating IP pool, click the :guilabel:`Release Floating IP` option in the :guilabel:`Actions` column.
id: Untuk melepaskan alamat IP mengambang kembali ke pool IP mengambang, klik opsi :guilabel:`Release Floating IP` dalam kolom :guilabel:`Actions`.

source: To remove the floating IP address from a project:
id: Untuk menghapus alamat IP mengambang dari proyek:

source: To resize the server, use the :command:`openstack server resize` command and add the server ID or name and the new flavor. For example:
id: Untuk mengubah ukuran server, gunakan: perintah :command:`openstack server resize` dan menambahkan ID server atau nama dan flavor baru. Sebagai contoh:

source: To restart the instance from the normal boot disk, run the following command:
id: Untuk me-restart instance dari disk boot normal, jalankan perintah berikut:

source: To restore a database instance
id: Untuk mengembalikan (restore) instance database

source: To resume a suspended instance, run the following command:
id: Untuk melanjutkan instance ditangguhkan, jalankan perintah berikut:

source: To retrieve an image object from its ID, call the ``glanceclient.v2.images.Controller.get`` method:
id: Untuk mengambil objek image dari ID-nya, sebut metode ``glanceclient.v2.images.Controller.get``:

source: To return fewer than 10,000 names, use the ``limit`` parameter. If the number of names returned equals the specified ``limit`` (or 10,000 if you omit the ``limit`` parameter), you can assume there are more names to list. If the number of names in the list is exactly divisible by the ``limit`` value, the last request has no content.
id: Untuk kembali kurang dari 10.000 nama, gunakan parameter ``limit``. Jika jumlah nama kembali sama ditentukan ``limit`` (atau 10.000 jika Anda menghilangkan parameter ``limit``), Anda dapat mengasumsikan ada lebih nama untuk daftar. Jika jumlah nama dalam daftar adalah tepat habis dibagi oleh nilai ``limit``, permintaan terakhir tidak memiliki konten.

source: To run the cURL command examples for the Object Storage API requests, set these environment variables:
id: Untuk menjalankan contoh perintah cURL untuk permintaan API Object Storage, atur variabel lingkungan ini:

source: To run the cURL command examples, you must export environment variables. For more information, see the section :ref:`env-vars`.
id: Untuk menjalankan contoh perintah Curl, Anda harus mengekspor variabel lingkungan. Untuk informasi lebih lanjut, lihat bagian :ref: `env-vars`.

source: To schedule an object for deletion, include one of these headers with the ``PUT`` or ``POST`` request on the object:
id: Untuk menjadwalkan sebuah objek untuk penghapusan, masukkan salah satu tajuk (header) ini dengan permintaan ``PUT`` atau ``POST`` pada objek:

source: To see which stacks are visible to the current user, run the following command:
id: Untuk melihat stacks yang terlihat untuk pengguna saat ini, jalankan perintah berikut:

source: To select the volume from which to launch, launch an instance from an arbitrary image on the volume. The arbitrary image that you select does not boot. Instead, it is replaced by the image on the volume that you choose in the next steps.
id: Untuk memilih volume dari mana untuk memulai, mulailah sebuah instance dari sebuah image apapun pada volume. Apapun image yang Anda pilih tidak bisa boot. Sebaliknya, itu diganti dengan image pada volume yang Anda pilih dalam langkah selanjutnya.

source: To set the permissions of the ``.pem`` file so that only you can read and write to it, run the following command.
id: Untuk mengatur hak akses dari file ``.pem`` sehingga hanya Anda dapat membaca dan menulis untuk itu, jalankan perintah berikut.

source: To set up environmental variables and authenticate against Compute API endpoints, see :ref:`sdk_authenticate`.
id: Untuk mengatur variabel lingkungan dan mengotentikasi terhadap endpoint Compute API, lihat :ref:`sdk_authenticate`.

source: To show the details for a particular event, run the following command:
id: Untuk menampilkan rincian untuk peristiwa tertentu, jalankan perintah berikut:

source: To show the details for a specific resource in a stack, run the following command:
id: Untuk menampilkan rincian untuk sumber daya tertentu dalam tumpukan (stack), jalankan perintah berikut:

source: To show the details of a stack, run the following command:
id: Untuk menampilkan rincian dari tumpukan (stack), jalankan perintah berikut:

source: To successfully write to a container, a user must have read privileges (in addition to write) on the container. For all aforementioned read/write ACL examples, one can replace the project/user name with project/user UUID, i.e. ``<project_uuid>:<user_uuid>``. If using multiple keystone domains, UUID format is required.
id: Untuk berhasil menulis ke sebuah kontainer, pengguna harus memiliki hak baca (selain untuk menulis) pada kontainer. Untuk semua contoh membaca/menulis ACL tersebut, seseorang dapat menggantikan nama proyek/pengguna dengan UUID proyek/pengguna , yaitu ``<project_uuid>: <user_uuid> ``. Jika menggunakan beberapa domain keystone, Format UUID diperlukan.

source: To unpause an instance, run the following command:
id: Menghentikan jeda instance, jalankan perintah berikut:

source: To update a module you should have another file ready to update the module with:
id: Untuk memperbarui modul Anda harus memiliki file lain yang siap untuk memperbarui modul dengan:

source: To update an existing stack from a modified template file, run a command like the following command:
id: Untuk memperbarui tumpukan (stack) yang ada dari file template dimodifikasi, menjalankan perintah seperti perintah berikut:

source: To update an instance in a cluster you can use the :command:`trove module-apply` command:
id: Untuk mengupdate sebuah instance di cluster Anda bisa menggunakan perintah :command:`trove module-apply`:

source: To upload an archive file, make a ``PUT`` request. Add the ``extract-archive=format`` query parameter to indicate that you are uploading a tar archive file instead of normal content.
id: Untuk meng-upload file arsip, buat permintaan ``PUT``. Tambahkan query parameter ``extract-archive=format`` untuk menunjukkan bahwa Anda meng-upload file arsip tar bukannya konten normal.
