Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: The strings ``$OS_IMAGE_URL`` and ``$OS_AUTH_TOKEN`` represent variables defined in the client's environment. ``$OS_IMAGE_URL`` is the full path to your image service endpoint, for example, ``http://example.com``. ``$OS_AUTH_TOKEN`` represents an auth token generated by the Identity Service, for example, ``6583fb17c27b48b4b4a6033fe9cc0fe0``.
id: String ``$OS_IMAGE_URL`` dan ``$OS_AUTH_TOKEN`` mewakili variabel didefinisikan dalam lingkungan klien. ``$OS_IMAGE_URL`` adalah path lengkap ke layanan endpoint image Anda, misalnya, ```http://example.com``. ``$OS_AUTH_TOKEN`` merupakan token otentikasi yang dihasilkan oleh Identity Service, misalnya, ``6583fb17c27b48b4b4a6033fe9cc0fe0``.

source: The subnet name, which is optional.
id: Nama subnet, yang opsional.

source: The system returns status code 2xx (between 200 and 299, inclusive) and the objects and pseudo-directories within the nested pseudo-directory.
id: Sistem ini mengembalikan kode status 2xx (antara 200 dan 299, inklusif) dan objek dan pseudo-directory dalam pseudo-directory bersarang.

source: The system returns status code 2xx (between 200 and 299, inclusive) and the objects and pseudo-directories within the top level pseudo-directory.
id: Sistem ini mengembalikan kode status 2xx (antara 200 dan 299, inklusif) dan objek dan pseudo-directory dalam pseudo-directory tingkat atas.

source: The system returns status code 2xx (between 200 and 299, inclusive) and the requested list of the objects.
id: Sistem ini mengembalikan kode status 2xx (antara 200 dan 299, inklusif) dan daftar yang diminta dari objek.

source: The system returns status code 2xx (between 200 and 299, inclusive) and the requested matching objects. Because you use the slash, only the pseudo-directory ``photos/`` displays. The returned values from a slash ``delimiter`` query are not real objects. The value will refer to a real object if it does not end with a slash. The pseudo-directories have no content-type, rather, each pseudo-directory has its own ``subdir`` entry in the response of JSON and XML results. For example:
id: Sistem ini mengembalikan kode status 2xx (antara 200 dan 299, inklusif) dan objek yang cocok dengan yang diminta. Karena Anda menggunakan garis miring, hanya menampilkan pseudo-directory ``photos/``. Nilai yang kembali dari query ``delimiter`` slash bukan obyek nyata. Nilai tersebut akan merujuk ke objek nyata jika tidak diakhiri dengan garis miring (slash). Pseudo-directory tidak memiliki content-type, bukan, setiap pseudo-directory memiliki entri ``subdir`` sendiri di respon hasil JSON dan XML. Sebagai contoh:

source: The template for the stack.
id: Template untuk stack.

source: The template languages are described in the `Template Guide <https://docs.openstack.org/developer/heat/template_guide/index. html>`_ in the `Heat developer documentation <http://docs. openstack.org/developer/heat/>`_.
id: Bahasa template dijelaskan dalam `Template Guide <https://docs.openstack.org/developer/heat/template_guide/index. html>`_ dalam `Heat developer documentation <http://docs. openstack.org/developer/heat/>`_.

source: The template languages are described in the `Template Guide <https://docs.openstack.org/developer/heat/template_guide/index.html>`__ in the `Heat developer documentation <https://docs.openstack.org/developer/heat/>`__.
id: Bahasa template dijelaskan dalam `Template Guide <https://docs.openstack.org/developer/heat/template_guide/index.html>`__ dalam `Heat developer documentation <https://docs.openstack.org/developer/heat/>`__.

source: The three instances you want to include in the replication set for the first shard. Specify each instance by using the ``--instance`` argument and the associated flavor ID and volume size. Use the same flavor ID and volume size for each instance. In this example, flavor ``7`` is a custom flavor that meets the MongoDB minimum requirements.
id: Tiga instance yang ingin Anda sertakan dalam replikasi ditetapkan untuk pecahan pertama (first shard). Tentukan setiap instance dengan menggunakan argumen ``--instance`` dan ID flavor dan volume ukuran terkait. Gunakan ID flavor dan ukuran volume yang sama untuk setiap instance. Dalam contoh ini, flavor ``7`` adalah flavor kustom yang memenuhi persyaratan minimum MongoDB.

source: The timeout value can be overridden on a per image basis by means of ``os_shutdown_timeout`` that is an image metadata setting allowing different types of operating systems to specify how much time they need to shut down cleanly.
id: Nilai timeout dapat diganti pada basis per image dengan cara ``os_shutdown_timeout`` yang merupakan pengaturan metadata image memungkinkan berbagai jenis sistem operasi untuk menentukan berapa banyak waktu yang mereka butuhkan untuk menutup (shut down) rapi.

source: The top of the window displays your user name. You can also access the :guilabel:`Settings` tab (:ref:`dashboard-settings-tab`) or sign out of the dashboard.
id: Bagian atas jendela menampilkan nama pengguna. Anda juga dapat mengakses tab :guilabel:`Settings` (:ref:`dashboard-settings-tab`) atau keluar dari dashboard.

source: The topology of the stack.
id: Topologi dari stack.

source: The user name is ``ubuntu`` for the Ubuntu cloud images on TryStack.
id: Username adalah ``ubuntu`` untuk image cloud Ubuntu di TryStack.

source: The visible tabs and functions in the dashboard depend on the access permissions, or roles, of the user you are logged in as.
id: Tab dan fungsi terlihat di dashboard tergantung pada hak akses, atau peran, pengguna dimana Anda login sebagai apa.

source: There are three remote console access methods commonly used with OpenStack:
id: Ada tiga metode akses remote konsol umumnya digunakan dengan OpenStack:

source: There are two basic ways to deal with your cloud config and credentials:
id: Ada dua cara dasar untuk menangani konfigurasi cloud dan kredensial:

source: These commands assume the implementation of the v2 Image API using the Identity Service for authentication and authorization. The X-Auth-Token header is used to provide the authentication token issued by the Identity Service.
id: Perintah ini beranggapan pelaksanaan v2 Image API menggunakan Layanan Identity untuk otentikasi dan otorisasi. Header X-Auth-Token digunakan untuk menyediakan token otentikasi yang dikeluarkan oleh Identity Service.

source: These flexible template languages enable application developers to describe and automate the deployment of infrastructure, services, and applications. The templates enable creation of most OpenStack resource types, such as instances, floating IP addresses, volumes, security groups, and users. Once created, the resources are referred to as stacks.
id: Bahasa template fleksibel ini memungkinkan pengembang aplikasi untuk menggambarkan (describe) dan mengotomatisasi pengerahan (deployment) infrastruktur, layanan, dan aplikasi. Template memungkinkan pembuatan sebagian besar tipe sumber daya OpenStack, seperti instance, alamat IP mengambang, volume, kelompok keamanan, dan pengguna. Setelah dibuat, sumber daya ini diacu sebagai tumpukan (stack).

source: These flexible template languages enable application developers to describe and automate the deployment of infrastructure, services, and applications. The templates enable creation of most OpenStack resource types, such as instances, floating IP addresses, volumes, security groups, and users. The resources, once created, are referred to as stacks.
id: Bahasa template fleksibel ini memungkinkan pengembang aplikasi untuk menggambarkan dan mengotomatisasi penyebaran (deployment) infrastruktur, layanan, dan aplikasi. Template memungkinkan penciptaan sebagian besar jenis sumber daya OpenStack, seperti instance, alamat IP mengambang, volume, kelompok keamanan, dan pengguna. Sumber daya, yang telah diciptakan, yang disebut sebagai tumpukan (stack).

source: These non-current versions are named as follows:
id: Versi non-current ini diberi nama sebagai berikut:

source: This allows access to all codes and all types of ICMP traffic.
id: Hal ini Mengizinkan akses ke semua kode dan semua jenis lalu lintas ICMP.

source: This book is written for anyone who uses virtual machines and cloud resources to develop software or perform research. You should have years of experience with Linux-based tool sets and be comfortable using both GUI and CLI based tools. While this book includes some information about using Python to create and manage cloud resources, Python knowledge is not a pre-requisite for reading this book.
id: Buku ini ditulis untuk siapa saja yang menggunakan mesin virtual dan sumber daya cloud untuk mengembangkan perangkat lunak atau melakukan penelitian. Anda harus memiliki pengalaman bertahun-tahun dengan set alat berbasis Linux dan nyaman menggunakan kedua GUI dan alat berbasis CLI. Meskipun buku ini mencakup beberapa informasi tentang menggunakan Python untuk membuat dan mengelola sumber daya cloud, Python pengetahuan bukanlah prasyarat untuk membaca buku ini.

source: This client is based on the native swift client library, ``client.py``, which seamlessly re-authenticates if the current token expires during processing, retries operations multiple times, and provides a processing concurrency of 10.
id: Klien ini didasarkan pada perpustakaan klien cepat asli, (native swift client library) ``client.py``, yang secara mulus mengotentikasi kembali (re-authenticates) jika token saat ini berakhir selama pemrosesan, mencoba ulang operasi beberapa kali, dan menyediakan pengolahan konkurensi dari 10.

source: This code resides in the ``credentials.py`` file, which all samples import.
id: Kode ini berada di file ``credentials.py``, yang semua sampel impor.

source: This code resides in the ``utils.py`` file, which all samples import.
id: Kode ini berada di file ``utils.py``, yang semua sampel impor.

source: This command generates a key pair with the name that you specify for KEY\_NAME, writes the private key to the ``.pem`` file that you specify, and registers the public key to the Nova database.
id: Perintah ini menghasilkan pasangan kunci (key pair) dengan nama yang Anda tentukan untuk KEY\_NAME, menulis kunci pribadi (private key) ke file ``.pem`` yang Anda tentukan, dan register kunci publik (public key) ke database Nova.

source: This command registers the public key at the Nova database and names the key pair the name that you specify for ``KEY_NAME``.
id: Perintah ini me-register kunci publik di Nova database dan nama kunci pasangan nama yang Anda tentukan untuk ``KEY_NAME``.

source: This command returns the IP address of the database instance.
id: Perintah ini mengembalikan alamat IP dari instance database.

source: This command returns the instance ID of your new instance.
id: Perintah ini mengembalikan instance ID dari instance baru Anda.

source: This command stores the state of the VM in RAM. A paused instance continues to run in a frozen state.
id: Perintah ini menyimpan keadaan VM di RAM. Sebuah instance yang dijeda terus berjalan dalam keadaan beku.

source: This command syntax pertains only to python-troveclient version 1.0.6 and later. Earlier versions require you to pass in the backup name as the first argument.
id: Sintaks perintah ini berkaitan hanya dengan python-troveclient versi 1.0.6 dan kemudian. versi sebelumnya mengharuskan Anda untuk lulus dalam nama backup sebagai argumen pertama.

source: This command syntax pertains only to python-troveclient version 1.0.6 and later. Earlier versions require you to pass in the configuration group ID as the first argument.
id: Sintaks perintah ini berkaitan hanya dengan python-troveclient versi 1.0.6 dan kemudian. Versi sebelumnya mengharuskan Anda untuk melewatkan dalam ID kelompok konfigurasi sebagai argumen pertama.

source: This example assigns the file origin to the ``Origin`` header, which ensures that the file originated from a reputable source.
id: Contoh ini menetapkan asal muasal file ke header ``Origin``, yang menjamin bahwa file berasal dari sumber yang memiliki reputasi.

source: This example assumes you have created a MySQL database and shows you how to use a configuration group to configure it. Although this example sets just one option on one database, you can use these same procedures to set multiple options on multiple database instances throughout your environment. This can provide significant time savings in managing your cloud.
id: Contoh ini mengasumsikan Anda telah membuat database MySQL dan menunjukkan cara menggunakan kelompok konfigurasi untuk mengkonfigurasinya. Meskipun contoh ini menetapkan hanya satu pilihan pada satu database, Anda dapat menggunakan prosedur yang sama untuk mengatur beberapa pilihan di beberapa instance database seluruh lingkungan Anda. Hal ini dapat memberikan penghematan waktu yang signifikan dalam mengelola cloud Anda.

source: This example creates a configuration group called ``group1``. ``group1`` contains just one key and value pair, and this pair sets the ``sync_binlog`` option to ``1``.
id: Contoh ini membuat kelompok konfigurasi yang disebut ``group1``. ``group1`` hanya mengandung satu pasangan kunci dan nilai, dan pasangan ini menetapkan opsi ``sync_binlog`` ke ``1``.

source: This example creates a database instance with the following characteristics:
id: Contoh ini menciptakan instance database dengan karakteristik sebagai berikut:

source: This example queries OpenStack Networking to create a router and add a port to a subnet.
id: Contoh ini melakukan kueri OpenStack Networking untuk membuat sebuah router dan menambahkan port untuk subnet.

source: This example queries OpenStack Networking to delete a network.
id: Contoh ini melakukan kueri OpenStack Networking untuk menghapus jaringan.

source: This example queries OpenStack Networking to list all routers.
id: Contoh ini melakukan kueri OpenStack Networking untuk daftar semua router.

source: This example queries OpenStack Networking to list security groups.
id: Contoh ini melakukan kueri OpenStack Networking untuk daftar kelompok keamanan.

source: This example queries OpenStack Networking to list subnets.
id: Contoh ini melakukan kueri OpenStack Networking untuk daftar subnet.

source: This example shows a truncated response body:
id: Contoh ini menunjukkan respon tubuh terpotong (truncated response body) :

source: This example shows three segment objects. You can use several containers and the object names do not have to conform to a specific pattern, in contrast to dynamic large objects.
id: Contoh ini menunjukkan tiga objek segmen. Anda dapat menggunakan beberapa kontainer dan nama objek tidak harus sesuai dengan pola tertentu, berbeda dengan object besar yang dinamis.

source: This example shows you how to back up and restore a MySQL database.
id: Contoh ini menunjukkan Anda bagaimana untuk backup dan restore database MySQL.

source: This example shows you how to create and access a MySQL 5.5 database.
id: Contoh ini menunjukkan Anda bagaimana membuat dan mengakses database MySQL 5.5 .

source: This example shows you how to create and apply modules to a MySQL 5.6 database and redis 3.2.6 database cluster.
id: Contoh ini menunjukkan cara membuat dan menerapkan modul ke database MySQL 5.6 dan cluster database redis 3.2.6.

source: This example shows you how to replicate a MySQL database instance.
id: Contoh ini menunjukkan Anda bagaimana meniru (replicate) instance database MySQL.

source: This example shows you how to set up a MongoDB sharded cluster.
id: Contoh ini menunjukkan Anda bagaimana membuat sebuah kluster sharded MongoDB.

source: This example shows you how to use incremental backups with a MySQL database.
id: Contoh ini menunjukkan kepada Anda bagaimana menggunakan inkremental backup (cadangan) dengan database MySQL.

source: This example uses the :command:`openstack` client to create an auto-scaling stack and the :command:`ceilometer` client to measure resources.
id: Contoh ini menggunakan klien :command:`openstack` untuk membuat tumpukan auto-skala dan klien :command:`ceilometer` untuk mengukur sumber daya (resources).

source: This example uses the ``get_nova_credentials_v2`` method:
id: Contoh ini menggunakan method ``get_nova_credentials_v2``:

source: This field changes based on your previous selection. If you have chosen to launch an instance using a snapshot, the :guilabel:`Instance Snapshot` field displays. Select the snapshot name from the dropdown list.
id: Perubahan field (kolom) ini berdasarkan pilihan Anda sebelumnya. Jika Anda telah memilih untuk memulai sebuah instance menggunakan snapshot, field menampilkan :guilabel:`Instance Snapshot` . Pilih nama snapshot dari daftar dropdown.

source: This field changes based on your previous selection. If you have chosen to launch an instance using a volume, the :guilabel:`Volume` field displays. Select the volume name from the dropdown list. If you want to delete the volume on instance delete, check the :guilabel:`Delete Volume on Instance Delete` option.
id: Perubahan field (kolom) ini berdasarkan pilihan Anda sebelumnya. Jika Anda telah memilih untuk memulai sebuah instance menggunakan volume, field menampilkan :guilabel:`Volume` . Pilih nama volume dari daftar dropdown. Jika Anda ingin menghapus volume pada penghapusan instance, periksa opsi :guilabel:`Delete Volume on Instance Delete`.

source: This field changes based on your previous selection. If you have chosen to launch an instance using an image, the :guilabel:`Image Name` field displays. Select the image name from the dropdown list.
id: Perubahan filed (kolom) ini berdasarkan pilihan Anda sebelumnya. Jika Anda telah memilih untuk memulai sebuah instance menggunakan image, field menampilkan :guilabel:`Image Name` . Pilih nama image dari daftar dropdown.

source: This guide documents OpenStack Ocata, Newton and Mitaka releases.
id: Panduan ini mendokumentasikan OpenStack rilis Ocata, Newton and Mitaka.

source: This next-most current version carries with it any metadata last set on it. If you want to completely remove an object and you have five versions of it, you must ``DELETE`` it five times.
id: Versi terbaru berikutnya (next-most) ini membawa dengan semua set terakhir metadata. Jika Anda ingin benar-benar menghapus objek dan Anda memiliki lima versi itu, Anda harus ``DELETE`` lima kali.

source: This output shows that the Object Storage system has enabled the static website and temporary URL features.
id: Output ini menunjukkan bahwa sistem Object Storage telah mengaktifkan website statis dan fitur URL sementara.

source: This procedure can be adjusted as necessary to add additional security group rules to a project, if your cloud requires them.
id: Prosedur ini dapat disesuaikan seperlunya untuk menambahkan aturan kelompok keamanan tambahan untuk proyek, jika cloud Anda membutuhkan mereka.

source: This procedure enables SSH and ICMP (ping) access to instances. The rules apply to all instances within a given project, and should be set for every project unless there is a reason to prohibit SSH or ICMP access to the instances.
id: Prosedur ini memungkinkan akses SSH dan ICMP (ping) ke instance. Aturan berlaku untuk semua instance dalam proyek tertentu, dan harus ditetapkan untuk setiap proyek kecuali ada alasan untuk melarang akses SSH atau ICMP ke instance.

source: This request uses the ``Accept`` request header to ask for an XML response:
id: Request (permintaan) ini menggunakan header permintaan ``Accept`` untuk meminta respon XML:

source: This section describes how to perform the different tasks involved in instance management, such as adding floating IP addresses, stopping and starting instances, and terminating instances. This section also discusses node management tasks.
id: Bagian ini menjelaskan cara untuk melakukan tugas yang berbeda yang terlibat dalam manajemen instance, seperti menambahkan alamat IP mengambang, berhenti dan mulai instance, dan mengakhiri instance. Bagian ini juga membahas tugas manajemen node.

source: This section is intended to provide a series of commands a typical client of the API might use to create and modify an image.
id: Bagian ini dimaksudkan untuk memberikan serangkaian perintah klien tipikal API mungkin digunakan untuk membuat dan memodifikasi image.

source: This view shows the list of existing load balancers. To view details of any of the load balancers, click on the specific load balancer.
id: Pandangan ini menunjukkan daftar penyeimbang beban yang ada. Untuk melihat rincian dari setiap penyeimbang beban, klik pada penyeimbang beban tertentu.

source: To accept requests from a particular range of IP addresses, specify the IP address block in the :guilabel:`CIDR` box.
id: Untuk menerima permintaan dari berbagai alamat IP tertentu, tentukan blok alamat IP di box :guilabel:`CIDR`.

source: To access an instance through a remote console, run the following command:
id: Untuk mengakses sebuah instance melalui remote konsol, jalankan perintah berikut:

source: To add a network to the instance, click the :guilabel:`+` in the :guilabel:`Available` field.
id: Untuk menambah jaringan ke instance, klik field (kolom) :guilabel:`+` dalam :guilabel:`Available`.

source: To add a rule to a security group, call the `novaclient.v1\_1.security\_group\_rules.SecurityGroupRuleManager.create <https://docs.openstack.org/developer/python-novaclient/api/ novaclient.v1_1.security_group_rules.html#novaclient.v1_1. security_group_rules.SecurityGroupRuleManager.create>`__ method:
id: Untuk menambahkan aturan untuk grup keamanan, panggil `novaclient.v1\_1.security\_group\_rules.SecurityGroupRuleManager.create <https://docs.openstack.org/developer/python-novaclient/api/ novaclient.v1_1.security_group_rules.html#novaclient.v1_1. security_group_rules.SecurityGroupRuleManager.create>`__ metode:

source: To add an ICMP rule, click :guilabel:`Add Rule`.
id: Untuk menambahkan aturan ICMP, klik :guilabel:`Add Rule`.

source: To allow SSH access to the instances, choose one of the following options:
id: Untuk mengizinkan akses SSH ke instance, pilih salah satu opsi berikut:

source: To allow SSH access, click :guilabel:`Add Rule`.
id: Untuk mengizinkan akses SSH, klik :guilabel:`Add Rule`.

source: To allow access through a UDP port, such as allowing access to a DNS server that runs on a VM, choose one of the following options:
id: Untuk Mengizinkan akses melalui port UDP, seperti mengizinkan akses ke server DNS yang berjalan pada VM, pilih salah satu opsi berikut:

source: To allow pinging of the instances, choose one of the following options:
id: Untuk Mengizinkan ping dari instance, pilih salah satu opsi berikut:

source: To attach a volume to a running instance, see :ref:`Attach_a_volume_to_an_instance`.
id: Untuk menghubungkan volume pada instance berjalan, lihat :ref: `Attach_a_volume_to_an_instance`.

source: To backup the database instance
id: Untuk backup (cadangan) instance database

source: To be deleted successfully, a load balancer must not have any listeners or pools associated with it. The delete action is also available in the :guilabel:`Actions` column for the individual load balancers.
id: Supaya dihapus berhasil, penyeimbang beban tidak harus memiliki pendengar atau kolam yang terkait dengan itu. Aksi penghapusan juga tersedia di kolom :guilabel: `Actions` untuk penyeimbang beban individu.

source: To boot a Xen image from a volume, the image you launch in must be the same type, fully virtualized or paravirtualized, as the one on the volume.
id: Untuk boot image Xen dari volume, image Anda memulai pada harus tipe yang sama, sepenuhnya virtual atau paravirtualized, sebagai salah satu pada volume.
