Repository: px22222/openstack-manuals
Catalog: doc/user-guide/source/locale/*/LC_MESSAGES/user-guide.po
Languages: id

source: :guilabel:`Routers`: View, create, edit properties for, and delete routers.
id: :guilabel:`Routers`: Melihat, membuat, mengedit properti, dan menghapus router.

source: :guilabel:`Security Groups` tab
id: Tab :guilabel:`Security Groups`

source: :guilabel:`Security Groups`: View, create, edit, and delete security groups and security group rules.
id: :guilabel:`Security Groups`: Melihat, membuat, mengedit, dan menghapus kelompok keamanan dan aturan kelompok keamanan.

source: :guilabel:`Security Services`: View, manage, and delete security services.
id: :guilabel:`Security Services`: Melihat, mengelola, dan menghapus layanan keamanan.

source: :guilabel:`Server`: Enter the server name.
id: :guilabel:`Server`: Masukkan nama server.

source: :guilabel:`Services`: View a list of the services.
id: :guilabel:`Services`: Melihat daftar layanan.

source: :guilabel:`Share Name`: Enter a new share name.
id: :guilabel:`Share Name`: Masukkan nama share baru.

source: :guilabel:`Share Name`: Specify a name for the share.
id: :guilabel:`Share Name`: Tentukan nama untuk berbagi.

source: :guilabel:`Share Network`: Choose a share network.
id: :guilabel:`Share Network`: Pilih jaringan berbagi (share).

source: :guilabel:`Share Networks`: View, manage, and delete share networks.
id: :guilabel:`Share Networks`: Melihat, mengelola, dan menghapus jaringan bersama.

source: :guilabel:`Share Protocol`: Select NFS, CIFS, GlusterFS, or HDFS.
id: :guilabel:`Share Protocol`: Pilih NFS, CIFS, GlusterFS, atau HDFS.

source: :guilabel:`Share Servers`: View, manage, and delete share servers.
id: :guilabel:`Share Servers`: Melihat, mengelola, dan menghapus server bersama.

source: :guilabel:`Share Type`: Choose a share type.
id: :guilabel:`Share Type`: Pilih tipe share.

source: :guilabel:`Share Types`: View, create, manage, and delete share types.
id: :guilabel:`Share Types`: Melihat, membuat, mengelola, dan menghapus tipe share.

source: :guilabel:`Shared`: Share the network with other projects. Non admin users are not allowed to set shared option.
id: :guilabel:`Shared`: Berbagi jaringan dengan proyek lainnya. Pengguna non admin tidak diizinkan untuk menetapkan pilihan bersama (shared option).

source: :guilabel:`Shares`: Use the following tabs to complete these tasks:
id: :guilabel:`Shares`: Gunakan tab berikut untuk menyelesaikan tugas ini:

source: :guilabel:`Shares`: View, create, manage, and delete shares.
id: :guilabel:`Shares`: Melihat, membuat, mengelola, dan menghapus share.

source: :guilabel:`Size (GB)`: The size of the share in gibibytes (GiB).
id: :guilabel:`Size (GB)`: Ukuran share di gibibytes (GIB).

source: :guilabel:`Size (GB)`: The size of the volume in gibibytes (GiB).
id: :guilabel:`Size (GB)`: Ukuran volume di gibibytes (GIB).

source: :guilabel:`Snapshots`: View, manage, and delete volume snapshots.
id: :guilabel:`Snapshots`: Melihat, mengelola, dan menghapus snapshot volume.

source: :guilabel:`Source` tab
id: Tab :guilabel:`Source`

source: :guilabel:`Stacks`: Use the REST API to orchestrate multiple composite cloud applications.
id: :guilabel:`Stacks`: Gunakan REST API untuk mengatur (orchestrate) beberapa aplikasi cloud komposit.

source: :guilabel:`Stats`: View the statistics of all resources.
id: :guilabel:`Stats`: Melihat statistik dari semua sumber daya.

source: :guilabel:`Subnet Details` tab
id: Tab :guilabel:`Subnet Details`

source: :guilabel:`Subnet Name`: Specify a name for the subnet.
id: :guilabel:`Subnet Name`: Tentukan nama untuk subnet.

source: :guilabel:`Subnet` tab
id: Tab :guilabel:`Subnet`

source: :guilabel:`System Information`: Use the following tabs to view the service information:
id: :guilabel:`System Information`: Gunakan tab berikut untuk melihat informasi layanan:

source: :guilabel:`Type`: Choose the type from Active Directory, LDAP, or Kerberos.
id: :guilabel:`Type`: Pilih tipe dari Active Directory, LDAP, atau Kerberos.

source: :guilabel:`Type`: Leave this field blank.
id: :guilabel:`Type`: Tinggalkan field ini kosong.

source: :guilabel:`Usage Report`: View the usage report.
id: :guilabel:`Usage Report`: Melihat laporan penggunaan.

source: :guilabel:`User Settings`: View and manage dashboard settings.
id: :guilabel:`User Settings`: Melihat dan mengelola pengaturan dashboard.

source: :guilabel:`User`: Enter the user name.
id: :guilabel:`User`: Masukkan username.

source: :guilabel:`Users`: View, create, enable, disable, and delete users.
id: :guilabel:`Users`: Melihat, membuat, mengaktifkan, menonaktifkan, dan menghapus pengguna.

source: :guilabel:`Volume Name`: Specify a name for the volume.
id: :guilabel:`Volume Name`: Tentukan nama untuk volume.

source: :guilabel:`Volume Size`: Select a volume size. Volume size is expressed in GB.
id: :guilabel:`Volume Size`: Pilih ukuran volume. Ukuran volume dinyatakan dalam GB.

source: :guilabel:`Volume Snapshots`: View, create, edit, and delete volume snapshots.
id: :guilabel:`Volume Snapshots`: Melihat, membuat, mengedit, dan menghapus snapshot volume.

source: :guilabel:`Volume Snapshots`: View, manage, and delete volume snapshots.
id: :guilabel:`Volume Snapshots`: Melihat, mengelola, dan menghapus snapshot volume.

source: :guilabel:`Volume Source`: Select one of the following options:
id: :guilabel:`Volume Source`: Pilih salah satu dari opsi berikut:

source: :guilabel:`Volume Types`: View, create, manage, and delete volume types.
id: :guilabel:`Volume Types`: Lihat, membuat, mengelola, dan menghapus jenis volume.

source: :guilabel:`Volumes`: Use the following tabs to complete these tasks:
id: :guilabel:`Volumes`: Gunakan tab berikut untuk menyelesaikan tugas ini:

source: :guilabel:`Volumes`: View, create, edit, and delete volumes.
id: :guilabel:`Volumes`: Melihat, membuat, mengedit, dan menghapus volume.

source: :guilabel:`Volumes`: View, create, manage, and delete volumes.
id: :guilabel:`Volumes`: Melihat, membuat, mengelola, dan menghapus volume.

source: :term:`Cross-Origin Resource Sharing (CORS)` is a specification that defines how browsers and servers communicate across origins by using HTTP headers, such as those assigned by Object Storage API requests. The Object Storage API supports the following headers:
id: :term:`Cross-Origin Resource Sharing (CORS)` adalah spesifikasi yang mendefinisikan bagaimana browser dan server berkomunikasi melintasi asal muasal dengan menggunakan header HTTP, seperti yang ditugaskan oleh permintaan API Object Storage. Objek Storage API mendukung header berikut:

source: A **key pair** for your instance, which are SSH credentials that are injected into images when they are launched. For the key pair to be successfully injected, the image must contain the ``cloud-init`` package. Create at least one key pair for each project. If you already have generated a key pair with an external tool, you can import it into OpenStack. You can use the key pair for multiple instances that belong to that project.
id: **key pair** (sepasang kunci) untuk instance Anda, yang mandat SSH yang disuntikkan ke dalam image ketika mereka diluncurkan. Untuk pasangan kunci supaya sukses disuntikkan, image harus berisi paket ``cloud-init`` . Buat setidaknya satu sepasang kunci untuk setiap proyek. Jika Anda sudah telah menghasilkan sepasang kunci dengan alat eksternal, Anda dapat mengimpor ke OpenStack. Anda dapat menggunakan sepasang kunci untuk beberapa instance yang tergabung dalam proyek itu.

source: A **name** for your instance.
id: **name** untuk instance Anda.

source: A **security group** that defines which incoming network traffic is forwarded to instances. Security groups hold a set of firewall policies, known as *security group rules*.
id: Sebuah **security group** (kelompok keamanan) yang mendefinisikan yang lalu lintas jaringan yang masuk diteruskan ke instance. kelompok keamanan mengadakan serangkaian kebijakan firewall, dikenal sebagai *security group rules* (aturan kelompok keamanan).

source: A *security group* is a named collection of network access rules that are use to limit the types of traffic that have access to instances. When you launch an instance, you can assign one or more security groups to it. If you do not create security groups, new instances are automatically assigned to the default security group, unless you explicitly specify a different security group.
id: *security group* adalah kumpulan nama aturan akses jaringan yang digunakan untuk membatasi tipe traffic yang memiliki akses ke instance. Ketika Anda memulai sebuah instance, Anda dapat menetapkan satu atau lebih kelompok keamanan untuk itu. Jika Anda tidak membuat kelompok keamanan, instance baru secara otomatis ditetapkan ke kelompok keamanan secara default, kecuali Anda secara eksplisit menentukan kelompok keamanan yang berbeda.

source: A Java client offering console access to an instance
id: Sebuah klien Java menyediakan konsol akses ke sebuah instance

source: A UNIX epoch timestamp, in integer form. For example, ``1348691905`` represents ``Wed, 26 Sept 2012 20:38:25 GMT``. It specifies the time you want the object to expire, no longer be served, and be deleted completely from the object store.
id: Sebuah timestamp jangka waktu UNIX, dalam bentuk integer. Sebagai contoh, ``1348691905`` merupakan ``Wed, 26 Sept 2012 20:38:25 GMT``. Ini menentukan waktu yang Anda inginkan obyek berakhir, tidak lagi dilayani, dan dihapus sepenuhnya dari penyimpanan objek.

source: A ``GET`` or ``HEAD`` request on the manifest returns a ``Content-Type`` response header value that is the same as the ``Content-Type`` request header value in the ``PUT`` request that created the manifest. To change the ``Content- Type``, reissue the ``PUT`` request.
id: Sebuah permintaan (request) ``GET`` atau ``HEAD`` di manifes mengembalikan nilai header respon ``Content-Type`` yang sama dengan nilai header request ``Content-Type`` di request ``PUT` `yang membuat manifes. Untuk mengubah ``Content Type``, terbitkan kembali request ``PUT``.

source: A ``POST`` request to a versioned object updates only the metadata for the object and does not create a new version of the object. New versions are created only when the content of the object changes.
id: Sebuah request (permintaan) ``POST`` ke objek berversi update hanya metadata untuk objek dan tidak membuat versi baru dari objek. Versi baru diciptakan hanya bila ada perubahan isi dari objek.

source: A ``manifest object`` links the segment objects into one logical large object. When you download a manifest object, Object Storage concatenates and returns the contents of the segment objects in the response body. This behavior extends to the response headers returned by ``GET`` and ``HEAD`` requests. The ``Content-Length`` response header contains the total size of all segment objects.
id: Sebuah ``manifest object`` menghubungkan object segmen menjadi satu objek besar logis. Ketika Anda men-download sebuah objek nyata (manifest) , Object Storage concatenate (merangkai) dan mengembalikan isi dari object segmen dalam response body. Perilaku ini meluas ke header respon dikembalikan oleh permintaan (request) `` GET`` dan ``HEAD``. Respon header ``Content-Length`` berisi ukuran total semua object segmen.

source: A bare-metal instance is an instance created directly on a physical machine, without any virtualization layer running underneath it. Nova retains power control via IPMI. In some situations, Nova may retain network control via Neutron and OpenFlow.
id: Sebuah instance bare-metal adalah turunan langsung dibuat pada mesin fisik, tanpa lapisan virtualisasi berjalan di bawahnya. Nova mempertahankan kontrol daya melalui IPMI. Dalam beberapa situasi, Nova mungkin mempertahankan kontrol jaringan melalui Neutron dan OpenFlow.

source: A complete in-browser client solution for interaction with virtualized instances
id: Solusi klien in-browser lengkap untuk interaksi dengan instance virtual

source: A configuration group can specify a large number of option values.
id: Sekelompok konfigurasi dapat menentukan sejumlah besar nilai pilihan.

source: A configuration group contains a comma-separated list of key-value pairs. Each pair consists of a configuration option and its value.
id: Sebuah kelompok konfigurasi berisi daftar pasangan kunci-nilai (key-value pair) yang dipisahkan koma (comma-separated) . Setiap pasangan terdiri dari opsi konfigurasi dan nilainya.

source: A key pair belongs to an individual user, not to a project. To share a key pair across multiple users, each user needs to import that key pair.
id: Key pair milik pengguna individu, bukan untuk sebuah proyek. Untuk share key pair di beberapa pengguna, setiap pengguna perlu mengimpor sepasang kunci itu.

source: A list of specific HTTP referer headers denied read access:
id: Daftar header referer HTTP spesifik membantah akses baca:

source: A list of specific HTTP referer headers permitted to read container contents:
id: Daftar header referer HTTP tertentu diizinkan untuk membaca konten kontainer:

source: A list of specific users and projects permitted to read container contents:
id: Daftar pengguna tertentu dan proyek diizinkan untuk membaca konten kontainer:

source: A list of specific users and projects permitted to write to the container:
id: Daftar pengguna tertentu dan proyek diizinkan untuk menulis ke kontainer:

source: A message indicates whether the action succeeded.
id: Sebuah pesan menunjukkan apakah tindakan berhasil.

source: A message indicates whether the action was successful.
id: Sebuah pesan menunjukkan apakah aksi itu berhasil.

source: A meter has the following attributes:
id: Meter memiliki atribut sebagai berikut:

source: A pool is a group of hosts that sits behind the load balancer and serves traffic through the load balancer.
id: Sebuah kolam (pool) adalah sekelompok host yang berada di belakang penyeimbang beban dan melayani lalu lintas melalui serves traffic through the load balancer.

source: A pool of floating IP addresses, configured by the cloud administrator, is available in OpenStack Compute. The project quota defines the maximum number of floating IP addresses that you can allocate to the project. After you allocate a floating IP address to a project, you can:
id: Sebuah kolam alamat IP mengambang, dikonfigurasi oleh administrator cloud, tersedia dalam OpenStack Compute. Kuota proyek mendefinisikan jumlah maksimum alamat IP mengambang yang dapat Anda alokasikan untuk proyek. Setelah Anda mengalokasikan alamat IP mengambang untuk proyek, Anda dapat:

source: A request with any HTTP referer header can read and list container contents:
id: Permintaan dengan header HTTP referer dapat membaca dan mendaftar konten kontainer:

source: A request with any HTTP referer header can read container contents:
id: Permintaan dengan header HTTP referer dapat membaca isi kontainer:

source: A series of events is generated during the lifecycle of a stack. To display lifecycle events, run the following command:
id: Serangkaian peristiwa (event) yang dihasilkan selama siklus hidup stack. Untuk menampilkan peristiwa siklus hidup, jalankan perintah berikut:

source: A set of data point aggregates over a time duration. (In contrast, a sample represents a single data point.) The Telemetry service employs the following aggregation functions:
id: Satu set data titik agregat (data point aggregates) selama durasi waktu. (Sebaliknya, sampel merupakan titik data tunggal.) Layanan Telemetry mempekerjakan fungsi agregasi berikut:

source: A set of rules that define a monitor and a current state, with edge-triggered actions associated with target states. Alarms provide user-oriented Monitoring-as-a-Service and a general purpose utility for OpenStack. Orchestration auto scaling is a typical use case. Alarms follow a tristate model of ``ok``, ``alarm``, and ``insufficient data``. For conventional threshold-oriented alarms, a static threshold value and comparison operator govern state transitions. The comparison operator compares a selected meter statistic against an evaluation window of configurable length into the recent past.
id: Satu set aturan yang mendefinisikan monitor dan keadaan saat ini, dengan tindakan edge-triggered terkait dengan kondisi sasaran. Alarm menyediakan berorientasi pengguna Monitoring-as-a-Service dan tujuan utilitas umum untuk OpenStack. Skala auto Orchestration adalah kasus penggunaan yang khas. Alarm mengikuti model tristate dari ``ok``, ``alarm``, dan ``insufficient data``. Untuk alarm threshold-oriented` konvensional, nilai static threshold dan operator perbandingan mengatur transisi keadaan. Operator perbandingan membandingkan statistik meteran yang dipilih terhadap window evaluasi jangka waktu dikonfigurasi ke masa lalu.

source: A share is provided by file storage. You can give access to a share to instances. To create and manage shares, you use ``manila`` client commands.
id: Sebuah share disediakan oleh penyimpanan file. Anda dapat memberikan akses untuk berbagi untuk instance. Untuk membuat dan mengelola share, Anda menggunakan perintah klien ``manila``.

source: A slash (/) character is used as the delimiter for pseudo-folders in Object Storage.
id: Sebuah karakter garis miring (/) slash digunakan sebagai pembatas untuk pseudo-folder dalam Object Storage.

source: A stack consists of a collection of resources. To list the resources and their status, run the following command:
id: Tumpukan (stack) terdiri dari koleksi sumber daya. Untuk daftar sumber daya dan status, jalankan perintah berikut:

source: A status of ``ACTIVE`` indicates that the instance is active.
id: Sebuah status ``ACTIVE`` menunjukkan bahwa instance aktif.

source: A status of ``BUILD`` indicates that the instance has started, but is not yet online.
id: Sebuah status ``BUILD`` menunjukkan bahwa instance telah dimulai, namun belum online.

source: A type, which indicates whether values increase monotonically (cumulative), are interpreted as a change from the previous value (delta), or are stand-alone and relate only to the current duration (gauge)
id: Sebuah tipe, yang menunjukkan apakah nilai-nilai meningkat secara monoton (kumulatif), yang diartikan sebagai perubahan dari nilai sebelumnya (delta), atau berdiri sendiri dan hanya berhubungan dengan durasi saat ini (gauge)

source: A unit of measurement
id: Sebuah unit pengukuran

source: A user data file is a special key in the metadata service that holds a file that cloud-aware applications in the guest instance can access. For example, one application that uses :term:`user data` is the `cloud-init <https://help.ubuntu.com/community/CloudInit>`__ system, which is an open-source package from Ubuntu that is available on various Linux distributions and which handles early initialization of a cloud instance.
id: Sebuah file data user (user data file) adalah kunci spesial dalam layanan metadata yang memegang sebuah file dimana aplikasi cloud-aware dalam instance tamu (guest) dapat mengakses. Misalnya, salah satu aplikasi yang menggunakan sistem :term:`user data` adalah `cloud-init <https://help.ubuntu.com/community/CloudInit> `__ , yang merupakan paket open-source dari Ubuntu yang tersedia di berbagai distribusi Linux dan yang menangani inisialisasi awal dari instance cloud.

source: A virtual machine image, referred to in this document simply as an image, is a single file that contains a virtual disk that has a bootable operating system installed on it. Images are used to create virtual machine instances within the cloud. For information about creating image files, see the `OpenStack Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`_.
id: Sebuah image mesin virtual, disebut dalam dokumen ini hanya sebagai image, adalah satu file yang berisi disk virtual yang memiliki sistem operasi bootable yang diinstal di atasnya. Image yang digunakan untuk membuat instance mesin virtual dalam cloud. Untuk informasi tentang membuat file image, lihat `OpenStack Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`_.

source: A volume size of ``5`` (5 GB).
id: Ukuran volume ``5`` (5 GB).

source: Access an instance through a console
id: Mengakses instance melalui konsol

source: Access and security credentials, which include one or both of the following credentials:
id: Akses dan keamanan kredensial, yang meliputi salah satu atau kedua kredensial berikut:

source: Access the security group rules from the ``rules`` attribute of a `novaclient.v1\_1.security\_groups.SecurityGroup <http://docs. openstack.org/developer/python-novaclient/api/novaclient.v1_1.security _groups.html#novaclient.v1_1.security_groups.SecurityGroup>`__ object:
id: Mengakses aturan kelompok keamanan dari atribut ``rules`` dari objek `novaclient.v1\_1.security\_groups.SecurityGroup <http://docs. openstack.org/developer/python-novaclient/api/novaclient.v1_1.security _groups.html#novaclient.v1_1.security_groups.SecurityGroup>`__:

source: Activate the ports that you want to assign to the instance.
id: Aktifkan port yang ingin Anda tetapkan untuk instance.

source: Activate the security groups that you want to assign to the instance.
id: Aktifkan kelompok keamanan yang ingin Anda tetapkan untuk instance.

source: Add Metadata items to your instance.
id: Tambahkan item Metadata ke instance Anda.

source: Add a key pair
id: Menambahkan sepasang kunci (key pair)

source: Add a keypair
id: Menambahkan sepasang kunci (keypair)

source: Add a network interface to the node
id: Menambahkan antarmuka jaringan ke node

source: Add a rule to the default security group
id: Menambahkan sebuah aturan untuk kelompok keamanan default

source: Add rules to default security group allowing ping and SSH between instances in the default security group
id: Menambahkan aturan ke default grup keamanan yang memungkinkan ping dan SSH antar instance dalam kelompok keamanan default

source: Add the following line to ``/etc/trove/trove.conf``:
id: Tambahkan baris berikut untuk ``/etc/trove/trove.conf``:

source: Adds a network interface to a bare-metal node.
id: Menambahkan antarmuka jaringan ke node bare-metal.

source: Administrative users can use the :guilabel:`Admin` tab to view usage and to manage instances, volumes, flavors, images, networks, and so on.
id: Pengguna administrasi dapat menggunakan tab :guilabel:`Admin` untuk melihat penggunaan dan untuk mengelola instance, volume, flavor, image, jaringan, dan sebagainya.

source: After the image is successfully uploaded, you can use the new image to boot instances.
id: Setelah image berhasil diupload, Anda dapat menggunakan image baru untuk boot instance.

source: After the instance is successfully launched, connect to the instance using a remote console and follow the instructions to install the system as using ISO images on regular computers. When the installation is finished and system is rebooted, the instance asks you again to install the operating system, which means your instance is not usable. If you have problems with image creation, please check the `Virtual Machine Image Guide <https://docs.openstack.org/image-guide/create-images-manually.html>`_ for reference.
id: Setelah instance tersebut berhasil diluncurkan, terhubung ke instance menggunakan konsol jarak jauh dan ikuti petunjuk untuk menginstal sistem dengan menggunakan image ISO di komputer biasa. Ketika instalasi selesai dan sistem reboot, instance akan meminta Anda lagi untuk menginstal sistem operasi, yang berarti instance Anda tidak bisa digunakan. Jika Anda memiliki masalah dengan penciptaan image, periksa `Virtual Machine Image Guide <https://docs.openstack.org/image-guide/create-images-manually.html>`_ sebagai referensi.
