Repository: px22222/openstack-manuals
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: de, ja

source: These release notes cover all aspects of the work of the documentation team with the exception of those repositories that have their own release notes (currently openstackdocstheme and openstack-doc-tools). Thus this file covers the content of the following repositories:
de: Diese Releasenotes decken alle Aspekte der Arbeit des Dokumentationsteams ab, mit Ausnahme der Repositories, die eigene Releasenotes beinhalten (gegenwärtig openstackdocstheme und openstack-doc-tools). Daher deckt diese Datei den Inhalt folgender Repositories ab:
ja: これらのリリースノートは、Documentation チームの作業のすべてを取り扱います。独自のリポジトリーにリリースノートを持つ、openstackdocstheme と openstack-doc-tools は対象外になります。このファイルは、以下のリポジトリーの内容を取り扱います。

source: This delay is intentional, to let the distribution packages stabilize, and to ensure all test cases and reliability checks meet certain criteria.
de: Diese Verzögerung ist beabsichtigt, um die Distributionspakete zu stabilisieren und sicherzustellen, dass alle Testfälle und Verlässlichkeitsprüfungen bestimmte Kriterien erfüllen.

source: Tracking of release notes in the ``releasenotes`` directory.
de: Verfolgen der Releasenotes im ``releasenotes`` Verzeichnis.
ja: リリースノートを ``releasenotes`` ディレクトリーに管理しはじめました。

source: Training Guides
de: Traininganleitungen
ja: トレーニングガイド

source: Training cluster should additionally have higher deployment rate.
de: Trainingcluster sollte außerdem häufiger bereitgestellt werden.
ja: トレーニングクラスターが、さらに高いデプロイレートになるべきです。

source: Training guides
de: Trainingsanleitungen
ja: トレーニングガイド

source: Training labs landing page is published under `docs.openstack.org <https://docs.openstack.org/training_labs/>`_:
de: Training labs Startseite ist unter `docs.openstack.org <https://docs.openstack.org/training_labs/>`_ verfügbar:
ja: トレーニングラボのページが `docs.openstack.org <https://docs.openstack.org/training_labs/>`_ に公開されました。

source: Translations
de: Übersetzungen
ja: 翻訳

source: Troubleshooting chapters now have consistent formatting, which is a step toward improved troubleshooting sections.
de: Kapitel zur Fehlersuche haben jetzt eine konsistente Formatierung. Ein Schritt zur Verbesserung der Fehlersuche-Sektionen.
ja: トラブルシューティングの章について、フォーマットの整合性を取り、改善するための一歩になります。

source: URL and file names changed to use only hyphens for consistency and search engine optimization.
de: URL und Dateinamen geändert, so dass aus Gründen der Konsistenz und Optimierung der Suchmaschine nur Bindestriche verwendet werden.
ja: URL とファイル名を変更して、一貫性と検索エンジン最適化のためにハイフンのみを使用するにしました。

source: Updated OpenStack command-line client commands to OpenStackClient commands.
de: Aktualisieren der OpenStack command-line Client Kommandos zu OpenStackClient Kommandos.
ja: OpenStack の各コマンドラインクライアントを OpenStackClient コマンドに更新しました。

source: Updated command examples for accuracy and parity with latest versions.
de: Kommandobeispiele für verbesserte Genauigkeit und um auf dem gleichen Stand wie die letzte Version zu sein aktualisiert

source: Updated configuration for all services.
de: Aktualisierte Konfiguration für alle Dienste.
ja: すべてのサービスの設定を更新しました。

source: Updated glossary terms for Nginx, SPICE, Data Loss Prevention (DLP), Trusted Platform Module (TPM), Secure Boot, and other acronyms.
de: Glossar-Ausdrücke für Nginx, SPICE, Data Loss Prevention (DLP), Trusted Platform Module (TPM), Secure Boot und andere Akronyme aktualisiert..

source: Updated graphics advice.
de: Grafik Advice überarbeitet.
ja: グラフィックに関するアドバイスを更新しました。

source: Updated landing page to improve ease of use.
de: Startseite zur einfacheren Verwendung aktualisiert.

source: Updated the user interface text guidelines.
de: User Interface Text Richtlinien wurden überarbeitet.
ja: ユーザーインターフェースのテキストのガイドラインを更新しました。

source: Updates for supporting new operating systems. For example, Ubuntu 16.04.
de: Aktualisierungen zur Unterstützung neuer Betriebssysteme, z.B. Ubuntu 16.04.
ja: Ubuntu 16.04 などの新しいオペレーティングシステム向けに更新しました。

source: Updates to compliance section around audit phases and links.
de: Aktualisierungen der Compliance Sektion über Auditphasen und Links

source: Updates to the CLI along with many improvements to address new features.
de: Aktualisierung des CLI zusammen mit vielen Verbesserungen und neuen Eigenschaften.
ja: 新機能を実現するために、さまざまな改善とともに CLI を更新しました。

source: User Guides
de: Benutzeranleitung
ja: ユーザーガイド

source: User guides
de: Benutzeranleitungen
ja: ユーザーガイド

source: User interface test cases to check the availability of horizon have been implemented.
de: Userinterface Tests zur Verfügbarkeitsprüfung von Horizon wurden hinzugefügt.
ja: horizon の利用可否を確認するために、ユーザーインターフェースのテストケースが実装されました。

source: User visible changes
de: Für Benutzer sichtbare Änderungen
ja: 利用者に見える変更

source: Users can download zip/tar files for Windows, Linux and Mac OS X platforms for supported releases.
de: Anwender können zip/tar Dateien für Windows, Linux und Mac OS X Plattformen für unterstütze Releases herunterladen.
ja: ユーザーは、サポートしているリリース向けの Windows、Linux、Mac OS X 用の zip/tar ファイルをダウンロードできます。

source: Various stability improvements have been added in this release.
de: Mannigfaltige Stabilitätsverbesserungen wurden in diesem Release hinzugefügt.
ja: このリリースで、さまざまな安定性の改善が図られました。

source: Virtual Machine Image Guide
de: Virtuelle-Maschinen-Abbild-Anleitung
ja: 仮想マシンイメージガイド

source: Windows platform support has been updated and improved.
de: Unterstützung der Windows-Plattform wurde aktualisiert und verbessert.
ja: Windows 環境のサポートを更新して改善しました。

source: `API Quick Start <https://developer.openstack.org/api-guide/quick-start/>`_ converted to RST with theme styling to match.
de: `API Quick Start <https://developer.openstack.org/api-guide/quick-start/>`_ nach RST wkonvertiert mit passendem Themenstil.
ja: `API Quick Start <https://developer.openstack.org/api-guide/quick-start/>`_ が、対応するテーマスタイルとともに RST に変換されました。

source: `Compute API Guide <https://developer.openstack.org/api-guide/compute/>`_ now built from nova source tree.
de: `Compute API Guide <https://developer.openstack.org/api-guide/compute/>`_ wird jetzt aus den Nova Quellzweig gebaut.
ja: `Compute API Guide <https://developer.openstack.org/api-guide/compute/>`_ が nova のソースツリーからビルドされるようになりました。

source: Added the `Upstream Training Archives <https://docs.openstack.org/upstream-training/upstream-archives.html>`_ (the list of past global and local Upstream Training events).
ja: `Upstream Training Archives <https://docs.openstack.org/upstream-training/upstream-archives.html>`_ (グローバルとローカルな Upstream Training のイベントの開催一覧) を追加しました。

source: Administrator Guide
ja: 管理者ガイド

source: Built draft swagger files.
ja: ドラフト版 swagger ファイルをビルドしました。

source: Changes to swift content on ``.rlistings``, and neutron dnsmasq log file content.
ja: swift の ``.rlistings`` の内容、neutron dnsmasq ログファイルの内容を変更しました。

source: Created `cookiecutter <https://git.openstack.org/cgit/openstack/installguide-cookiecutter/>`_ tool to ensure project specific guides have a consistent structure.
ja: `cookiecutter <https://git.openstack.org/cgit/openstack/installguide-cookiecutter/>`_ ツールを作成して、プロジェクト別ガイドが一貫した構造を持つようにしました。

source: Mitaka release
ja: Mitaka リリース

source: Newton release
ja: Newton リリース

source: The API reference documentation has been moved from the api-site repository to project specific repositories. The collection of API docs is now available on the `OpenStack API Documentation <https://developer.openstack.org/api-guide/quick-start/>`_.
ja: API リファレンスドキュメントは api-site リポジトリーからプロジェクト毎のリポジトリーに移動されました。API ドキュメントの一覧が `OpenStack API Documentation <https://developer.openstack.org/ja/api-guide/quick-start/>`_ にあります。

source: The `Compute API <https://developer.openstack.org/api-ref/compute/>`_ and `DNS API <https://developer.openstack.org/api-ref/dns/>`__ sites offer great examples of the new API reference, maintained by the project team rather than a central docs team.
ja: `Compute API <https://developer.openstack.org/api-ref/compute/>`_ と `DNS API <https://developer.openstack.org/api-ref/dns/>`__ のサイトが、新しい API リファレンスの素晴らしい例を提供してくれました。ドキュメントチームではなく、そのプロジェクトチームにより管理されています。

source: Training labs
ja: トレーニングラボ

source: Updated the `Contributor Guide <https://docs.openstack.org/contributor-guide/api-guides.html>`__ to include specific API Guides information.
ja: `Contributor Guide <https://docs.openstack.org/contributor-guide/api-guides.html>`__ を更新して、具体的な API ガイドの情報を含めました。
