Repository: px22222/openstack-manuals
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: de, ja

source: A revised Architecture Design Guide is currently under development, no changes to the current guide.
de: Eine überarbeiteter Architektur Design Guide ist derzeit in Arbeit, keine Änderungen am aktuellen Guide.
ja: アーキテクチャー設計ガイドの改版が進んでいます。現在のガイドに変更ありません。

source: API Guides
de: API-Anleitungen
ja: API ガイド

source: API guides
de: API-Anleitungen
ja: API ガイド

source: Added BGP dynamic routing.
de: BGP dynamisches Routing hinzugefügt.
ja: BGP 動的ルーティングを追加しました。

source: Added DPDK for Open vSwitch.
de: DPDK für Open vSwitch hinzugefügt.
ja: Open vSwitch 向け DPDK を追加しました。

source: Added Database service (trove) content.
de: Inhalt für Datenbankdienst (trove) hinzugefügt.
ja: Database サービス (trove) のコンテンツを追加しました。

source: Added OSSNs 0063, 0066, 0068, 0069, 0073.
de: OSSNs 0063, 0066, 0068, 0069, 0073 hinzugefügt.
ja: OSSN 0063, 0066, 0068, 0069, 0073 を追加しました。

source: Added RBAC.
de: RBAC hinzugefügt.
ja: RBAC を追加しました。

source: Added RFC 5737 and 3849 compliance policy.
de: RFC 5737 und 3849 Konformitätsrichtlinien hinzugefügt.
ja: RFC 5737 と RFC 3849 コンプライアンスポリシーを追加しました。

source: Added Redis replication information and Rootwrap Daemon configuration information to the Administrator Guide.
de: Redis Replikationsinformationen und Rootwrap Konfigurationsinformationen zum Administrator Guide hinzugefügt.

source: Added Shared File Systems (manila) content.
de: Inhalt für geteiltes Dateisystem (manila) hinzugefügt.
ja: Shared File Systems (manila) を追加しました。

source: Added VLAN trunking.
de: VLAN Verteilung hinzugefügt.
ja: VLAN トランキングを追加しました。

source: Added address scopes.
de: Adressbereiche hinzugefügt.
ja: アドレススコープを追加しました。

source: Added build tools so that the Security Guide can be built both separately and with the OSSN and TA sections.
de: Bauwerkzeuge hinzugefügt, so dass der Security Guide separat und mit den OSSN und TA Sektionen gebaut werden kann.

source: Added enterprise operations documentation including RabbitMQ troubleshooting information, instructions to retrieve lost IP addresses, and procedures to manage floating IP addresses between instances.
de: Enterprise Operations Dokumentation einschließlich Informationen zur RabbitMQ Fehlersuche hinzugefügt, sowie Anweisungen zum Abruf verlorener IP-Adressen und Prozeduren zur Verwaltung von Floating IP-Adressen zwischen Instanzen.

source: Added information about creating project-specific Installation Tutorials.
de: Informationen zum erstellen projektspezifischer Tutorials hinzugefügt.
ja: プロジェクト別インストールチュートリアルの作成に関する情報を追加しました。

source: Added more tests to ``repeat_test`` scripts.
de: Mehr Tests zu ``repeat_test`` Skripts hinzugefügt.
ja: ``repeat_test`` スクリプトのテストをさらに追加しました。

source: Added new chapters in the draft `Training guides <https://docs.openstack.org/draft/training-guides/>`_
de: Neue Kapitel im Entwurf der `Training guides <https://docs.openstack.org/draft/training-guides/>`_ hinzugefügt.
ja: ドラフトの `Training guides <https://docs.openstack.org/draft/training-guides/>`_ に新しい章を追加しました。

source: Added personas content to the user experience section.
de: Inhalt zu Personas zur User Experience Sektion hinzugefügt.
ja: ペルソナ関連のコンテンツをユーザーエクスペリエンスのセクションに追加しました。

source: Added routed provider networks.
de: Geroutete Anbieternetzwerke hinzugefügt.
ja: ルーティング済みプロバイダーネットワークを追加しました。

source: Added section regarding automated instance recovery.
de: Sektion zur automatischen Instanzwiederherstellung hinzugefügt.
ja: インスタンスの自動リカバリーに関するセクションを追加しました。

source: Added senlin, monasca, and cloudkitty clients.
de: Senlin, monasca und cloudkitty Klienten hinzugefügt.
ja: senlin、monasca、cloudkitty クライアントを追加しました。

source: Added service function chaining.
de: Dienst Funktionsverkettung hunzugefügt.
ja: Service Function Chaining (SFC) を追加しました。

source: Added service subnets.
de: Dienst Subnetz hinzugefügt.
ja: サービスサブネットを追加しました。

source: Added subnet pools.
de: Subnetzpools hinzugefügt.
ja: サブネットプールを追加しました。

source: Added the Shared File Systems chapter.
de: Kapitel zum geteilten Dateisystem hinzugefügt.
ja: Shared File Systems の章を追加しました。

source: Added the `Highly available Shared File Systems API <https://docs.openstack.org/ha-guide/storage-ha-file-systems.html>`_ section.
de: `Highly available Shared File Systems API <https://docs.openstack.org/ha-guide/storage-ha-file-systems.html>`_ Sektion hinzugefügt.
ja: `Highly available Shared File Systems API <https://docs.openstack.org/ha-guide/storage-ha-file-systems.html>`_ セクションを追加しました。

source: Added the `MariaDB Galera cluster <https://docs.openstack.org/ha-guide/shared-database.html>`_ installation, configuration, and management details.
de: `MariaDB Galera cluster <https://docs.openstack.org/ha-guide/shared-database.html>`_ Installation, Konfiguration und Managementdetails hinzugefügt.
ja: `MariaDB Galera cluster <https://docs.openstack.org/ha-guide/shared-database.html>`_ のインストール、設定、管理の詳細を追加しました。

source: Added the bug report links to each slide and the landing page.
de: Bugreport Link zu allen Slides sowie der Startseite hinzugefügt.
ja: 各スライドとトップページにバグ報告のリンクを追加しました。

source: Adds support for x86/i386 architecture.
de: Unterstützung fürx86/i386 Architektur hinzugefügt.
ja: x86/i386 アーキテクチャーをサポートしました。

source: Approximately one third of the **Administrator Guide** chapters received a thorough edit for style and consistency, following the contributor guide standard.
de: Etwa ein Drittel des **Administrator Guide** Kapitels wurde nach dem Contributor Guide Standard auf Stil und Konsistenz überarbeitet.
ja: **Administrator Guide** の約 1/3 の内容を取り込みました。コントリビューターガイドの標準に従い、スタイルや整合性のための編集を行いました。

source: Architecture Design Guide
de: Architektur-Designaleitung

source: Architecture design guide
de: Architektur Design Guide
ja: アーキテクチャー設計ガイド

source: Assorted updates and cleanups.
de: Gruppierte Aktualisierungen und Bereinigungen.
ja: 各種更新およびクリーンアップ。

source: Besides updating the existing translated manuals, the internationalization team added the following new manuals:
de: Neben Aktualisierungen der vorhandenen übersetzten Manuals hat das Internationalisierungsteam die folgenden neuen Manuals hinzugefügt:
ja: 既存の翻訳済みドキュメントの更新に加えて、国際化 (I18n) チームが以下のドキュメントを新規追加しました。

source: Block storage (cinder) has a dedicated disk as opposed to being file mounted as a loop device. This should improve performance and provide persistence for cinder-volumes across reboots.
de: Block Storage (cinder) hat fest zugewiesene Platten, im Gegensatz zu als Loop-Device gemounteten Dateien. Dies verbessert die Performanz und bietet Persistenz für cinder-Datenträger über Reboots.

source: Cluster setup speed is improving after addition of multiple features.
de: Geschwindigkeit der Clustereinrichtung wurde nach Hinzufügen einer Vielzahl von Features verbessert.
ja: 複数の機能の追加後、クラスターのセットアップ速度が改善しています。

source: Collected the user experience content in a single section.
de: User Experience Inhalte in einer einzigen Sektion zusammengefasst.
ja: ユーザーエクスペリエンス関連のコンテンツを 1 つのセクションにまとめました。

source: Command-Line Interface Reference
de: Kommandozeilen-Interface Referenz

source: Command-Line Interface Reference abandons the `openstack` command reference in favor of the reference in the OpenStackClient repository.
de: Die Kommandozeilen-Interface Referenz vermeidet die `openstack` Kommandoreferenz zugunsten der Referenz im OpenStackClient Repository.
ja: Command-Line Interface Reference が `openstack` コマンドのリファレンスを中止して、OpenStackClient リポジトリーにあるリファレンスを参照するようになりました。

source: Completed RST conversion.
de: RST-Konvertierung abgeschlossen.
ja: RST 形式に移行しました。

source: Completely restructured the guide.
de: Anleitung komplett neu strukturiert.
ja: 完全に再構成しました。

source: Configuration Reference
de: Konfigurationsreferenz

source: Configuration Reference consolidates the common configurations such as database connections and RPC messaging.
de: Konfigurationsreferenz konsolidiert die allgemeine Konfiguration wie z.B. Datenbankverbindungen und RPC Messaging.
ja: Configuration Reference が、データベース接続や RPC メッセージングなどの共通設定を独立させて集約しました。

source: Configuration Reference supports the Application Catalog service.
de: Konfigurationsreferenz unterstützt den Applikationskatalog-Dienst.
ja: Configuration Reference が Application Catalog サービスをサポートします。

source: Contents
de: Inhalt
ja: 内容

source: Contributor Guide
de: Mitarbeiter Guide

source: Created templates for writing API guides for projects teams available in projects repositories.
de: Vorlagen zur Erstellung von API-Guides für Projektteams verfügbar in Projekt-Repositories.
ja: プロジェクトチームが API ガイドを書くためのテンプレートを、プロジェクトのリポジトリーに作成しました。

source: Deleted references to default flavors.
de: Referenzen zu Standard-Varianten entfernt.

source: Documentation of some of the new features in Mitaka.
de: Dokumentation einiger neuer Eigenschaften in Mitaka.
ja: Mitaka の新機能をいくつか追加しました。

source: Documentation team release notes
de: Releasenotes des Dokumentationsteams
ja: Documentation チーム リリースノート

source: Documented Message service (zaqar).
de: Nachrichtendienst (zaqar) dokumentiert.
ja: Message サービス (zaqar) を追加しました。

source: Documented that individual CLIs are deprecated in favor of the common OpenStack client.
de: Dokumentiert, dass einzelne CLIs zugunsten des allgemeinen OpenStack Klienten als veraltet gelten.
ja: 共通の OpenStack クライアントへの置き換えにより、個別の CLI に非推奨と記載しました。

source: Documented the `Pacemaker cluster manager <https://docs.openstack.org/ha-guide/intro-ha-arch-pacemaker.html>`_ and Keepalived architecture details and limitations.
de: `Pacemaker Cluster Manager <https://docs.openstack.org/ha-guide/intro-ha-arch-pacemaker.html>`_ und Keepalived Architektur Details und Begrenzungen dokumentiert.
ja: `Pacemaker cluster manager <https://docs.openstack.org/ha-guide/intro-ha-arch-pacemaker.html>`_ と Keepalived アーキテクチャーの詳細および制限事項を記載しました。

source: Enabled translation.
de: Übersetzungen aktiviert.
ja: 翻訳をサポートしました。

source: End User Guide
de: Endbenutzer Handbuch
ja: エンドユーザーガイド

source: General bug fixes and updates.
de: Allgemeine Fehlerkorrekturen und Aktualisierungen.

source: German
de: Deutsch
ja: ドイツ語

source: Glossary reorganized to support ease of access for users.
de: Glossar neu organisiert, um einfacheren Zugriff für Benutzer zu ermöglichen.
ja: 用語集を整理して、利用しやすくしました。

source: High Availability Guide
de: High Availability Anleitung
ja: 高可用性ガイド

source: High availability guide
de: High Availability Anleitung
ja: 高可用性ガイド

source: Improved DNS resolution.
de: DNS_Auflösung verbessert.
ja: DNS 解決を改善しました。

source: Improved Load-Balancer-as-a-Service.
de: Verbesserter Load-Balancer-as-a-Service.
ja: Load-Balancer-as-a-Service を改善しました。

source: Improved MTU considerations.
de: Verbesserte MTU Berücksichtigung.
ja: MTU に関する考慮事項を改善しました。

source: Improved Open vSwitch HA DVR deployment.
de: Verbesserte Open vSwitch HA DVR Bereitstellung.
ja: Open vSwitch HA DVR の導入を改善しました。

source: Improved Quality of Service (QoS).
de: Verbesserter Quality of Service (QoS).
ja: Quality of Service (QoS) を改善しました。

source: Improved SR-IOV.
de: SR-IOV verbessert.
ja: SR-IOV を改善しました。

source: Improved `Pacemaker/Corosync cluster <https://docs.openstack.org/ha-guide/controller-ha-pacemaker.html>`_ installation and configuration details.
de: `Pacemaker/Corosync Cluster <https://docs.openstack.org/ha-guide/controller-ha-pacemaker.html>`_ Installation und Konfigurationsdetails hinzugefügt.
ja: `Pacemaker/Corosync cluster <https://docs.openstack.org/ha-guide/controller-ha-pacemaker.html>`_ のインストールおよび設定の詳細を改善しました。

source: Improved address scopes.
de: Adressbereiche verbessert.
ja: アドレススコープを改善しました。

source: Improved and restructured `Upstream Training <https://docs.openstack.org/upstream-training/>`_
de: Verbesserung und Restrukturierung des `Upstream Training <https://docs.openstack.org/upstream-training/>`_
ja: `Upstream Training <https://docs.openstack.org/upstream-training/>`_ を改善して再構成しました。

source: Improved high-availability for DHCP.
de: Hochverfügbarkeit für DHCP verbessert.
ja: DHCP の高可用性を改善しました。

source: Improved security groups.
de: Sicherheitsgruppen verbessert.
ja: セキュリティーグループを改善しました。

source: Improved service subnets.
de: Subnetz-Dienst verbessert.
ja: サービスサブネットを改善しました。

source: Improved the `RabbitMQ section <https://docs.openstack.org/ha-guide/shared-messaging.html>`_.
de: Verbesserungen der `RabbitMQ Sektion <https://docs.openstack.org/ha-guide/shared-messaging.html>`_.
ja: `RabbitMQ のセクション <https://docs.openstack.org/ha-guide/shared-messaging.html>`_ を改善しました。

source: Improvements in networking related challenges.
de: Verbesserungen für netzwerkbezogene Schwierigkeiten.
ja: ネットワーク関連の課題を改善しました。

source: Improvements to the library scripts.
de: Verbesserungen an den Bibliothek-Skripten.
ja: ライブラリースクリプトを改善しました。

source: Indonesian
de: Indonesisch
ja: インドネシア語

source: Installation Guide
de: Installationsanleitung
ja: インストールガイド

source: Installation guide
de: Installationsanleitung
ja: インストールガイド

source: Internal changes
de: Interne Änderungen
ja: 内部の変更

source: Italian
de: Intalienisch
ja: イタリア語

source: Japanese
de: Japanisch
ja: 日本語

source: KVM/Libvirt backends now use shared storage. Hard disks for the cluster are diffs on top of the base disk. This uses less storage space.
de: KVM/Libvirt Backends verwenden jetzt Shared Storage. Festplatten für den Cluster sind diffs auf den Basisdisks. Dies verwendet weniger Storage-Speicher.
ja: KVM/Libvirt バックエンドが、共有ストレージを使用するようになりました。クラスターのハードディスクが、ベースディスクの差分になります。これにより、ストレージの容量を減らせます。

source: Korean
de: Koreanisch
ja: 韓国語

source: Marked Identity API v2 as deprecated.
de: Identitäts API v2 wurde als überholt markiert.
ja: Identity API v2 に非推奨と明記しました。

source: Migrated content on configuring and customizing the Dashboard, previously maintained in the Configuration Reference, to the Dashboard chapter of the Administrator Guide.
de: Zuvor in der Konfigurationsreferenz enthaltene Inhalte zur Konfiguration und Anpassung des Dashboards wurden in das Dashboard-Kapitel im Administrator Guide migriert.

source: Migrated examples from deprecated Identity service (keystone) direct driver loading examples to stevedore.
de: Beispiele von veralteten Identitätsdienst (keystone) direct driver loading nach stevedore verschoben.

source: Networking Guide
de: Netzwerkanleitung
ja: ネットワークガイド

source: Networking guide
de: Netzwerkanleitung
ja: ネットワークガイド

source: New content including documentation for LBaaS, DNS integration, and macvtap ml2 driver.
de: Neuer Inhalt einschließlich Dokumentation von LBaaS, DNS Integration und macvtap ml2 Treiber.
ja: 新規に LBaaS、DNS 統合、macvtap ML2 ドライバーのドキュメントなどを追加しました。

source: New section on rate-limiting and API endpoint traffic.
de: Neue Sektion zur Durchsatzbegrenzung und API Endpunkt-Verkehr.
ja: レートリミットと API エンドポイントのトラフィックに関する新規セクション。

source: New, cleaner `developer.openstack.org <https://developer.openstack.org>`_ landing page.
de: Neue, ordentlichere `developer.openstack.org <https://developer.openstack.org>`_ Startseite.
ja: 新しい簡潔な `developer.openstack.org <https://developer.openstack.org>`_ トップページ。

source: Newton support should be available shortly after the OpenStack release.
de: Newton Unterstützung ist geplant als verfügbar kurz nach dem dem OpenStack Release.
ja: OpenStack の Newton リリース後すぐに、サポートされるべきです。

source: Newton support:
de: Newton Unterstützung:
ja: Newton サポート:

source: Operations Guide
de: Betriebsanleitung
ja: 運用ガイド

source: Operations guide
de: Betriebsanleitung
ja: 運用ガイド

source: PXE boot could also be used as a mechanism for provisioning KVM/VirtualBox based workloads.
de: PXE Boot konnte ebenso als Mechanismus zur Provisionierung von KVM/VirtualBox basierten Workloads verwendet werden.
ja: PXE ブートが、KVM/VirtualBox ベースのワークロードをデプロイするための機構として使用できるようにもなりました。

source: PXE booting functionality is available as a pluggable driver in parallel with KVM/VirtualBox.
de: PXE Bootfunktionalität ist als steckbarer Treiber parallel für KVM/VirtualBox verfügbar.
ja: PXE ブート機能が、KVM/VirtualBox を同時にプラグインドライバーとして利用できます。

source: PXE feature for training-labs:
de: PXE Feature für training-labs:
ja: トレーニングラボ向け PXE 機能:

source: Performance improvements by fixing race conditions occurring due to virtualization overhead.
de: Performanzverbesserungen durch Beseitigung von Fehlern (race conditions) aufgrund von Virtualisierungsüberladungen.
ja: 仮想化のオーバーヘッドにより発生する競合状態を修正して、パフォーマンスを改善しました。

source: Performance improvements:
de: Leistungsverbesserungen:
ja: パフォーマンス改善:

source: Provide details for contacting the OpenStack HA community.
de: Details zum kontaktieren der OpenStack HA Community angegeben.
ja: OpenStack HA コミュニティーへの連絡方法について詳細を提供しました。

source: Published API Guide.
de: API Anleitung veröffentlicht.
ja: API ガイドを公開しました。

source: Published Installation Tutorials for Mitaka and Liberty.
de: Intallations-Tutorien für Mitaka und Liberty veröffentlicht.
ja: Mitaka 版と Liberty 版のインストールガイドを公開しました。

source: Published Installation Tutorials for Mitaka.
de: Installations-Tutorium für Mitaka veröffentlicht.
ja: Mitaka 版インストールガイドを公開しました。

source: Published Networking Guide.
de: Netzwerkanleitung veröffentlicht.
ja: ネットワークガイドを公開しました。

source: Published Upstream Training.
de: Upstream-Training veröffentlicht.
ja: Upstream Training を公開しました。

source: Published project specific guides for Container Infrastructure Management service (magnum), Messaging service (zaqar), Key Manager service (barbican), and Bare Metal service (ironic).
de: Projektspezifische Anleitungen für Container Infrastrukture Management Dient (magnum), Nachrichtendienst (zaqar), Schlüsselmanager Dienst (barbican) und Bare Metal Dienst (ironic) hinzugefügt.
ja: Container Infrastructure Management サービス (magnum)、Messaging サービス (zaqar)、Key Manager サービス (barbican)、Bare Metal サービス (ironic) のプロジェクト別ガイドを公開しました。

source: Published the Networking Guide.
de: Netzwerkanleitung veröffentlicht.
ja: ネットワークガイドを公開しました。

source: Published the Upstream Training.
de: Upstream Training veröffentlicht.
ja: Upstream Training を公開しました。

source: Readability changes for links, images, and document format.
de: Verbesserung der Lesbarkeit von Verknüpfungen, Bildern und des Dokumentenformats.
ja: 可読性のためにリンク、イメージ、ドキュメント形式を変更しました。

source: Released fairy-slipper, a migration tool for WADL to RST plus API reference information.
de: Fairy-slipper wurde released, ein Migrationswerkzeug für WADL nach RST sowie zusätzliche API Referenzinformationen.
ja: fairy-slipper をリリースしました。WADL から RST への移行と API リファレンスの情報を移行するツールです。

source: Removed Keepalived architecture as it is no longer advocated.
de: Keepalived Architektur entfernt, da sie nicht mehr gefördert wird.
ja: 支持されなくなった Keepalived のアーキテクチャーを削除しました。

source: Removed instructions to install DevStack and information on contributing to OpenStack, which is documented on the DevStack project website and Infrastructure Manual respectively.
de: Anweisungen zu Installation von DevStack und Mitarbeit in OpenStack entfernt, da dies auf der DevStack Projektwebseite bzw. im Infrastruktur Manual dokumentiert ist.

source: Removed tuskar client because of retirement.
de: Tuskar Klient als überholt entfernt.
ja: tuskar 廃止にともない、削除しました。

source: Renamed to Installation Tutorial.
de: Umbenannt nach Installationstutorium.
ja: 名前をインストールチュートリアルに変更しました。

source: Reorganised the **Admin User Guide** content together with the **Cloud Admin Guide** content to create a new **Administrator Guide**.
de: **Admin User Guide** Inhalt mit dem Inhalt von **Cloud Admin Guide** in einen neuen **Administrator Guide** verarbeitet.
ja: **Admin User Guide** と **Cloud Admin Guide** の内容を再編成して、新しい **Administrator Guide** を作成しました。

source: Reorganized and rewrote the deployment examples using "building blocks" to improve usability and understanding. After choosing either the Linux bridge or Open vSwitch mechanism driver, the audience can deploy increasingly complex architectures that build on prior simpler examples. Also reduced duplication of content.
de: Bereitstellungsbeispiele wurden neu geschrieben und als "building blocks" organisiert, um die Verwendbarkeit und das Verständnis zu verbessern. Nach der Auswahl von Linuxbridge oder Open vSwitch kann das Publikum zunehmend komplexe Architekturen bereitstellen, aufbauend auf zuvor einfacheren Beispielen. Doppelte Inhalte entfernt.

source: Reorganized the Administrator Guide Telemetry chapter to improve information architecture.
de: Telemerie-Kapitel im Administrator Guide neu organisiert, um die Informationsarchitektur zu verbessern.
ja: Administrator Guide の Telemetry の章を再整理して改善しました。

source: Replaced Keystone CLI examples with OpenStack CLI examples.
de: Keystone CLI Beispiele wurden mit OpenStack CLI Beispielen ersetzt.
ja: Keystone CLI の例を OpenStack CLI の例に置き換えました。

source: Replaced basic node and service installation instructions with links.
de: Grundsätzliche Anweisungen zur Knoten- und Diensteinstallation durch Links ersetzt.
ja: ノードとサービスの基本的なインストール方法をリンクに置き換えました。

source: Security Guide
de: Sicherheitsanleitung
ja: セキュリティーガイド

source: Simplified Chinese
de: Vereinfachtes Chinesisch
ja: 簡体字中国語

source: Stability improvements:
de: Stabilitätsverbesserungen:
ja: 安定性の改善:

source: Test coverage:
de: Testabdeckung:
ja: テストカバー率:

source: The **Admin User Guide** content has been removed from `OpenStack Docs <https://docs.openstack.org>`_ since all files have been reorganised into the **Administrator Guide**.
de: Der **Admin User Guide** Inhalt wurde von `OpenStack Docs <https://docs.openstack.org>`_ entfernt, da alle Dateien im **Administrator Guide** organisiert wurden.
ja: **Admin User Guide** が `OpenStack Docs <https://docs.openstack.org>`_ から削除されました。すべてのファイルが **Administrator Guide** に再整理されました。

source: The Installation Guide has been renamed to Installation Tutorial, and now includes Container Infrastructure Management service (magnum), Messaging service (zaqar), Key Manager service (barbican), and Bare Metal service (ironic).
de: Die Installationsanleitung wurde in Installationstutorial umbenannt und enthält jetzt Container Infrastrukture Management Dient (magnum), Nachrichtendienst (zaqar), Schlüsselmanager Dienst (barbican) und Bare Metal Dienst (ironic).
ja: インストールガイドがインストールチュートリアルに名称変更されました。Container Infrastructure Management サービス (magnum)、Messaging サービス (zaqar)、Key Manager サービス (barbican)、Bare Metal サービス (ironic) が追加されました。

source: The Installation Tutorial can now publish documentation from project specific repositories.
de: Das Installationstutorium kann jetzt Dokumentation aus projektspezifischen Repositories veröffentlichen.
ja: インストールチュートリアルが、プロジェクトごとのリポジトリーから公開されるようになりました。

source: The Operations Guide is now using RST as source format. This completes the transition to RST, and the old DocBook tools have been retired.
de: Der Operations Guide verwendet jetzt RST als Quellformat. Somit ist der Überhang zu RST abgeschlossen und die alten DocBook Werkzeuge werden nicht mehr benötigt.
ja: 運用ガイドはソースファイル形式として RST を使うようになりました。これにより、RST 移行が完了し、古い DocBook ツールは廃止されました。

source: The content of the separate repositories operations-guide and ha-guide has been moved into the openstack-manuals repository. The operations-guide and ha-guide repositories have been retired.
de: Der Inhalt der separaten Repositories operations-guide und ha-guide wurde ins openstack-manuals Repository verschoben. Die operations-guide und ha-guide repositories wurden stillgelegt.
ja: 別リポジトリー operations-guide と ha-guide の内容は openstack-manuals リポジトリーに移動されました。operations-guide と ha-guide のリポジトリーは使われなくなりました。
